var  all_country  = ["*","Австрија","Белгија","Бугарија","Хрватска","Република Чешка","Данска","Финска","Франција","Германија","Грција","Унгарија","Италија","Луксембург","Холандија","Норвешка","Полска","Португалија","Романија","Русија","Србија","Словенија","Шпанија","Шведска","Швајцарија","Обединето Кралство","*"," "/*Arab*/,"Естонија"," "/*Hebrew*/,"Латвија","Словачка","Турција","Ирска","*","*","*","*","Уругвај","Перу","Аргентина","Чиле","Венецуела","Еквадор","Костарика","Парагвај","Боливија","Белизе","Никарагва","Гватемала","*","*","Бразил","*","Мексико","*","*","Други","Литванија"/*新添加的，底层结构体中没有*/,"Украина"/*新添加的，底层结构体中没有*/,"*","*"," "," ","*"," ","*","*","*"," ","*","*"," "," "," ","*"," ","*"," "," "," "," ","*"," "," "," "," "," ","*"," ","Молдавија"," ","Ел Салвадор"," "," "," ","*"," "," "," "," "," "," "," "," "," "," "," "," ","*"," "," ","*"," "," "," ","*","Албанија","Белорусија","Исланд","Литванија","*","*","*","*","*","Босна и Херцеговина","Кипар","Косово","Македонија","Малта","Црна Гора","Други"];	


var all_language = ["чешки","*","дански","*","*","германски","англиски","шпански","грчки",
					"француски","хрватски","*","италијански","унгарски","холандски","норвешки","полски","португалски","руски","романски",
					"словенечки","српски","фински","шведски","бугарски","словачки","кинески","*","гаелски","*",
					"велшки","арапски","ирски","латвиски","*","турски","естонски","холандски"/*Netherlands*/,"корејски","*",
					"Hindi","*","*","Mandarin","Cantonese","Maori","Оригинално аудио"/*Qaa*/,"Недефинирано"/*Undetermined*/,"*","Непознато",
					"Недефинирано","*","*","*","*","*","*","*","*","*",
					"*","*","*","Албански","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","баскиски","*","*",
					"*","*","*","*","*","*","*","Босански","*","*",
					"*","*","*","*","белоруски","*","*","каталонски","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","галициски","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","исландски","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","Japanese","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","литвански",
					"*","*","*","*","*","*","*","Македонски","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","романски јазици","*","*","*","*",
					"*","*","*","лапонски јазици","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","Телетекст",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","украински","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","*",
					"*","*","*","*","*","*","*","*","*","кинески традиционален",
					"*"];	


var offOn = ["Исклучено","Вклучено"];	
var okCancel = ["ОК","Откажи"];	
var yesNo = ["Да","Не"];	
var level = ["Исклучено","Ниско","Високо","Средно"];	
var manualAuto = ["Прирачник","Автом."];	
var homeShop = ["Дом","Продавница"];	
var picPreset = ["Стандардно","Динамично","Природно","Филм","Лично"];	
var picColorTemp = ["Студено","Нормално","Топло","Приспособено"];	
var pic3dNavig = ["Прирачник","Автом.","Полуавтоматски"];	
var _3dOptions = ["3Д режим","3Д во 2Д","Прекинувач Л-Д","Длабочина на поле"];	
var pic3DMode = ["Исклучено","2Д во 3Д","Едно до друго","Горе и долу","Преплетување на линии"];	
var picEcoOptions = ["Штедење енергија","Светлосен сензор","Локално затемнување","Мешано затемнување"];	
var picGeoOptions = ["Геометрија","Х. позиција","В. позиција","Часовник","Фаза"];	
var picAdWhiteBal = ["R појачување","G појачување","B појачување","R Offset","G Offset","B Offset"];	
var souOptions = ["Претходно поставен звук","Баланс","Аудио задоцнување","SRS TSHD","Контрола на автом. јачина на звук","Тип SPDIF","Задоцнување SPDIF","ТВ позиција","Јазик на аудио","Тип на звук","Аудио опис","Засилување на бас","Dolby Digital Plus"];	
var souSpdifType = ["Автом."/*Dolby*/,"PCM","Исклучено"];	
var colorSpace = ["Автом.","Домашен","Приспособено"];	
var souPresetPara = ["100Hz","500Hz","1.5KHz","5KHz","10KHz"];
var chOptions = ["Скенирање на канали","Список со канали","Електронски програмски водич (EPG)","Организација на канали","Дијагностика на канали","Временско поместување","Поднаслов","Телетекст","Тип на список со канали","Податочна служба"];	
var chDiagOptions = ["Јачина на сигнал","Квалитет на сигнал","Фреквенција (KHz)","Ознака на служба","Ознака на мрежа","Име на мрежа"];	
var chScanOptions = ["Земја","Режим на приемник","Автом. пребарување","Автом. ажурирање","Аналогно рачно скенирање",["Рачна инсталација на кабел","Рачна инсталација на антена","Рачно поставување на сателит"],"Рачно поставување на сателитска антена","Избор на омилена мрежа","Исчисти список со канали","LCN"];
var favNetDes = "Изберете ја вашата омилена мрежа";	
var tuner = ["Кабел","Антена","Сателит"];	
var passError = "Грешна лозинка.\nВнесете ја повторно!";	
var chType = ["Аналогни канали:","Дигитални канали:"];	
var chScanStatus = ["Состојба: Се врши скенирање","Состојба: Скенирањето заврши","Состојба: Скенирањето се откажа","Состојба: Грешка при скенирање"];	
var chScanPara = ["Фреквенција (KHz)","Модулација","Рата на симбол(Ksym/s)","Ознака на мрежа","Систем","Фино подесување","Јачина на сигнал","Квалитет на сигнал","Режим за скенирање","Име на канал"];	
var chScanParaMHZ = ["Фреквенција (MHz)"];	
var chAtvManSys = ["Западна ЕВР","Источна ЕВР","Обединето Кралство","Франција"];	
var modulation = ["16QAM","32QAM","64QAM","128QAM","256QAM","Автом."];	
var chCleanDes = "Сакате да го избришете списокот со канали?";	
var chDeletDes = "Сакате да го избришете овој канал?";	
var chOperator = ["Ziggo","UPC","Други"];	
var chScanType = ["Дигитален и аналоген","Дигитален","Аналоген"];	
var chScanMode = ["Целосно","Напредно","Брзо"];	
var bookingModes = ["Снимање","Потсетник"];	
var dayName = ["Нед.","Пон.","Втор.","Сре.","Чет.","Пет.","Саб."];	
var monthName = ["Јан.", "Фев.","Март.","Апр.","Мај.","Јун.","Јул.","Авг.","Сеп.","Окт.","Ноем.","Дек."];	
var filter = ["Филтер","Тип","Подтип"];	
var chEpgFirstGenre = ["Филм","Новини","Забавна емисија","Спортови","Детски","Музика","Уметности","Социјални","Образование","Слободно време","Специјални"];	
var chEpgSecondGenre = [["Драма","Криминални","Авантура","Научна фантастика","Комедија","Сапуница","романски јазици","Сериозни","Филмови за возрасни"," "," "," "],["Тековни настани","Временска прогноза","Вести","Документарна програма","Дискусија"," "," "," "," "," "," "," "],["Забавна емисија","Игри","Забавни емисии","Дебатна емисија"," "," "," "," "," "," "," "," "],["Спортови","Специјални настани","Спортски програми","Фудбал","Тенис","Тимски спортови","Атлетика","Спортови со мотори","Водени спортови","Зимски спортови","Коњи","Боречки спортови"],["Детски","Претшколски деца","Забава за возрасти од 6 до 14","Забава за возрасти од 10 до 16","Информациски","Цртани филмови"," "," "," "," "," "," "," "],["Музика","Рок музика","Сериозни","Народна музика","Џез музика","Музички","Балет"," "," "," "," "," "],["Уметности","Сценска уметност","Фини уметности","Религија","Популарна култура","Литература","Филм","Експериментална програма","Емитување","Нови медиуми","Уметничка програма","Мода"],["Социјални","Магазини","Економија","Истакнати луѓе"," "," "," "," "," "," "," "," "],["Образование","Природа","Технологија","Медицина","Странски земји","Социјални науки","Понатамошно образование","Јазици"," "," "," "," "],["Хоби","Туризам","Рачни вештини","Мотори","Фитнес и здравје","Готвење","Реклами","Градинарство"," "," "," "," "],["Оригинален јазик","Црно и бело","необјавено","Емитување во живо"," "," "," "," "," "," "," "," "]];	
var chEpgFirstGenreLA = ["Новини","Спортови","Образование","Сапунска опера","Мини-серии","Серии","Забавни емисии","Реалити шоу","Информации","Комедии","Деца","Еротика","Филм","Лотарија, телевизиска продажба, награди","Дебати/интервјуа","Друго"];	
var chEpgSecondGenreLA = [["Новини","Извештај","Документарна програма","Биографија","Друго","*","*"],    ["Спортови","Друго","*","*","*","*","*"],["Образование","Друго","*","*","*","*","*"],["Сапунска опера","Друго","*","*","*","*","*"],["Мини-серии","Друго","*","*","*","*","*"],["Серии","Друго","*","*","*","*","*"],["Публика","Забавна емисија","Музички","Правењето на","Женски програми","Игри","Друго"],["Реалити шоу","Друго","*","*","*","*","*"],["Готвење","Мода","Земја","Здравје","Патување","Друго","*"],["Комедии","Друго","*","*","*","*","*"],["Деца","Друго","*","*","*","*","*"],["Еротика","Друго","*","*","*","*","*"],["Филм","Друго","*","*","*","*","*"],["Лотарија","Телевизиска продажба","Награди","Друго","*","*","*"],["Дискусија","Интервјуа","Друго","*","*","*","*"],["Цртани филмови за возрасни","Интерактивни","Политика","Религија","Инженерски услуги","Друго","*"]];	
var chOrganizer = ["Прескокни канал","Сортирај канал","Уреди канал","Избриши канал","Замени канал","Внеси канал"];	
var chEditPara = ["Име на мрежа","Број на канал","Име на канал","Фреквенција","Систем на бои","Звучен систем"];	
var chSatTitles = ["Сателитски тип","Рачно поставување на сателитска антена","Избери сателит"];	
var chSatEidtOptions = ["Име на сателит","Позиција","Снага на LNB","Фреквенција на LNB (MHz)","DiSEqC влез","Тон 22KHz","Тонски импулс","Фреквенција (KHz)","Рата на симбол(Ksym/s)","Поларизација","Јачина на сигнал","Квалитет на сигнал","Состојба на сателит"];	
var chSatAutoPromt = [["Сите","Мрежа"],["Сите","Бесплатно"]];	
var chSatAutoScanOptions = ["Избери сателит","Режим за скенирање","Канали"];	
var chSatPosition = ["A","B"];	
var chSatLNBFreq = ["Универзален",];	
var chSatDiSEqCInput = ["Исклучи","A","B","C","D"];	
var chSatTone22KHz = ["Автом.","Вклучено","Исклучено"];	
var chSatToneBurst = ["Исклучи","Тонски импулс А","Тонски импулс Б"];	
var chSatPolarization = ["Хоризонтално","Вертикално"];	
var chSatSetupOptions = ["Тип на антена","Приемник","РФ спектар"];	
var chSatAntennaType = ["Дистрибуција преку еден кабел","Универзален"];	
var chSatUserBands = ["Кориснички РФ спектар 1","Кориснички РФ спектар 2","Кориснички РФ спектар 3","Кориснички РФ спектар 4","Кориснички РФ спектар 5","Кориснички РФ спектар 6","Кориснички РФ спектар 7","Кориснички РФ спектар 8"];	
var chSatOthers = ["Транспондер"];	
var chSatSetupOthers = ["Одредено од корисник"];	
var pleaseSelectSat = "Најпрво изберете сателити!";	
var subOptions = ["Поднаслов","Јазик на дигитален поднаслов","Втор јазик на дигитален поднаслов","Тип на поднаслов"];	
var gingaOptions = ["Служба за автом. податоци","Список со услуги за податоци"];	
var ttxOptionsCon = ["Дешифрирање на јазик на страница","Јазик на дигитален телетекст"];	
var subType = ["Нормално","Лица со оштетен слух"];	
var netIntf = ["Етернет","Безжично"];	
var netConnDes = ["ТВ-уредот ја тестира мрежната врска.\nМолиме причекајте","Тестот за мрежна врска е успешен!","Тестот за мрежна врска беше неуспешен."];	
var netSsidError = "Важечката должина на SSID е 1-32 знака. Проверете ја SSID.";	
var netOthers = ["PIN-код"];	
var netWlessAutoDes = ["Обезбедете дека следниов PIN-код е инсталиран на пристапната точка пред да кликнете ОК.","Притиснете го копчето на пристапната точка во рок од 120 секунди пред да кликнете ОК."];	
var netConnRemind = ["Лозинката е грешна!","Се врши поврзување. Молиме, причекајте!","Поврзувањето е успешно и добиена е IP-адреса!","Поврзувањето беше неуспешно, проверете ја мрежата и обидете се повторно!","ТВ-уредот скенира пристапни точки. \nМолиме, причекајте","На ТВ-уредот нема поврзан безжичен адаптер!"];	
var netWireIpOptions = ["Поставување на IP","Тип на адреса","IP-адреса","Подмрежна маска","Стандардна капија","Примарна DNS","Секундарна DNS"];	
var netWireConnRemind = ["Внесете важечка вредност меѓу 0 и 255.","Поврзувањето е успешно!","Внесете важечка адреса","Поврзувањето е успешно!","Поврзувањето беше неуспешно!","Се врши поврзување. Молиме, причекајте!","Внесете важечка вредност меѓу 1 и 223."];	
var netFlixOptions = ["Деактивирај","ESN"];	
var netFlixDes = ["Сигурно сакате да го деактивирате?"," "/*Are you sure that you want to ESN?*/];	
var netUpdateTitle = "Ажурирање на софтвер";	
var netUpdateDialogTitle = "Се врши ажурирање на софтвер";	
var netBGDownloadTitle = "Се врши преземање";	
var netUpdateLoadingPrompt = ["Се пребарува надградба, причекајте!","Се врши преземање на софтвер... Молиме, причекајте!","НЕ ИСКЛУЧУВАЈТЕ ГО ТВ-уредот додека се врши надградба на софтверот!",                            "Неопходното ажурирање на софтвер се презема автоматски во заднина!"];	
var netUpdatePrompt = ["Честитки, ја имате најновата верзија на софтверот!","Се најде нова верзија на софтверот XXXX. Сакате ли да ја преземете сега? Тоа може да потрае, во зависност од состојбата на вашата мрежа.","Најавувањето беше неуспешно, проверете ја вашата врска и поврзете со повторно!","Добивањето податоци беше неуспешно, обидете се повторно подоцна!","Анализата на информации на надградба беше неуспешна, вклучете/исклучете со далечински управувач!","Поврзувањето беше неуспешно, проверете ја мрежата и обидете се повторно!","Софтверот беше успешно преземен. Дали сакате да почнете со ажурирање на ТВ-уредот?","Загубени податоци! Преземањето беше неуспешно!","Неуспешна проверка на софтверска датотека, обидете се повторно!","Проблеми со врска. Проверете и поврзете се повторно!","Ажурирањето беше неуспешно. Вклучете/исклучете со далечински управувач!","Датотеката за надградба неочекувано се избриша. Извршете ја повторно надградбата преку мрежа.","Софтверот се презеде успешно во заднина. Сакате да извршите надградба?"];	
var netUpdateButtonText = ["Преземете", "Ажурирајте", "Подоцна", "Никогаш", "ОК","Продолжете"];	
var autoDetectPrompt = ["Се најде нова верзија на софтверот XXXX. Сакате ли да ја преземете сега? Тоа може да потрае, во зависност од состојбата на вашата мрежа.","Се најде нова верзија на софтверот XXXX. Сакате да извршите ажурирање сега?","Последниот пат постапката за ажурирање беше прекината. Мора да ја извршите надградбата повторно.",                        "Преземањето на новата верзија на софтверот XXXX не е завршено. Сакате да продолжите сега?",                        "Софтверот е преземен, сакате ли да извршите ажурирање сега?"];	
var sysOptions = ["E-прирачник","Јазик на мени","Тајмер","Заклучи","Параметри на внес","Ажурирање на софтвер","Локација","Режим HbbTV","Колачиња","Заеднички интерфејс","Напредни параметри","Ресетирај продавница","LED-индикатор","Брзо вклучување","Auto shop mode","Area","Демо-режим"];
var sysResetDes = "Сигурно сакате да го извршите избраното дејство?";	
var sysMenuLangOptions = ["Јазик","Претпочитан јазик на аудио","Втор претпочитан јазик на аудио"];	
var sysTimerOptions = ["Временска зона","Име на регион","Часовник","Будилник","Автом. мирување", "Регион на земја"];	
var sysTimeZone = ["Според емитување","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00","GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30","GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00","GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00","GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00","GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00","GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];	
var sysTimeZoneLA = ["Според емитер","Регион1","Регион2","Регион3","Регион4","Регион5"];	
var sysSleepTimer = ["Исклучено","10 мин.","20 мин.","30 мин.","40 мин.","50 мин.","60 мин.","90 мин.","120 мин."];	
var sysStandby = ["Исклучено","4 часа","6 часа","8 часа"];	
var sysRegionName = ["Мадрид","Канарски Острови"];	
var sysClockOptions = ["Автом. синхронизација","Датум","Време","Вклучете тајмер","Тајмер","Вклучете канал","Исклучете тајмер","Тајмер","Летно сметање на време"];	
var sysTimer = ["Исклучено","Дневно","Еднаш"];	
var sysInputSet = ["Нема етикета","ДВД","Blu-ray","HDD","DVDR","HD снимање","Игра","VCR","Компјутер","Дигиталнa конверторска опрема (STB)","HD дигитална конверторска опрема (STB)","Камера","Снимач","Друго"];	
var sysAvVideoInput = ["Автом.","RGB_CVBS","RGB","CVBS","S-видео"];	
var sysUpdate = ["Преку USB","Преку мрежа","Преку канал"];	
var sysUpdateDes = [" "," "," ","Не може да најде нов софтвер во живо!","Се најде нова верзија на софтверот XXXX. Сакате да извршите ажурирање сега?","Внесете ја USB-меморијата.","Неуспешна проверка на софтверска датотека, обидете се повторно!","Се врши ажурирање. За ова ќе биде потребно малку време, а ТВ-уредот потоа ќе стартува автоматски!","Софтверот беше успешно ажуриран.\nТВ-уредот ќе се рестартира автоматски!","Се најде нова верзија на софтверот XXXX. Сакате ли да ја преземете сега? Тоа може да потрае, во зависност од состојбата на вашата мрежа.","Се врши преземање","Софтверот беше успешно преземен. Дали сакате да почнете со ажурирање на ТВ-уредот?","Ажурирањето беше неуспешно!","Се врши пребарување за датотеки за надградба","Софтверот беше успешно ажуриран.\nСега можете да го рестартитате ТВ-уредот."];	
var sysProductInfo = ["Тековна верзија","Име на производ","Име на произведувач","Има на шасија"];	
var sysCiDes = ["Не е најдена CI-картичка."];	
var sysAdOptions = ["Регистрација на DivX(R)","Дерегистрација на DivX(R)on","T-Link","Грешка при авторизација","Потврдување на дерегистрација","Потврда за изнајмување","Изнајмувањето истече"];	
var sysRegistDes = ["Морате да го регистрирате вашиот уред за да репродуцирате заштитени DivX(R) видео-записи.","Шифра за регистрација:","Регистрирајте се на http://vod.divx.com"];	
var sysDregistDes = ["Шифра за дерегистрација:","Дерегистрирајте се на http://vod.divx.com","Сакате да продолжите со регистрацијата?"];	
var mediaAuthorization = ["На вашиот уред не му е дозволено да го репродуцира овој заштитенDivX(R) видео-запис."];	
var deregistrationConfrimation = ["Вашиот уред е веќе регистриран.","Сигурни ли сте дека сакате да се дерегистрирате?"];	
var rentalConfirmation = "Изнајмувањето на DivX(R) искористи XXXX од YYYY прикази. Сакате ли да продолжите?";	
var rentalExpired = "Изнајмувањето на DivX(R) искористи XXXX од YYYY прикази. Изнајмувањето на DivX истече.";	
var parentalRatingLA = ["Родителска оцена","Оцена за возраст","Оцена на содржина"];	
var ageRatingOptions = ["L","10","12","14","16","18"];	
var contentRatingOptions = ["Исклучено","Дрога","Насилство","Секс","Насилство и дрога","Секс и дрога","Насилство и секс","Насилство, секс и дрога"];
var parentalRatingNA = ["Родителска оцена","*","Оцена за возраст","Оцена на содржина","*","*","*","*"];	
var parentalRatingOptionUS		= ["***","***","***"];
var sysTVRatingUS=["***","***","***","***","***"];
var sysMPAAUS=["***","***","***","***","***","***"];
var parentalRatingOptionCanada		= ["***","***","***"];
var sysCanadaEng=["***","***","***","***","***","***"];
var sysCanadaFre=["***","***","***","***","***",""];
var sysResetRRT=["***"];
var sysLockOptions = ["Заклучување на канал","Временски интервал за заклучување","Родителска оцена","Заклучување за внесување","Заклучување на преден панел","Заклучување за инсталација","Изменете лозинка","Макс. јачина на тон","Исчистете сѐ"];
var sysTimeIntervals = ["Тип на заклучување","Време на почеток","Време на завршување"];	
var sysRatingOptions = ["Ниедно","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","Оценето со Х (Шпанија)"];	
var changePass = ["Изменете лозинка","Нова лозинка","Потврдете лозинка"];	
var changePassDes = ["Грешна лозинка.\nВнесете ја повторно!","Лозинката не се совпаѓа.\nВнесете ја повторно!","Лозината е успешно поставена!","Овој код е премногу едноставен за да се постави како лозинка.\nВнесете го повторно!"];	
var sysPowerOnChOptions = "Изберете режим";	
var sysPowerOnCh = ["Последна состојба","Кориснички избор"];	
var netWlessSecu = ["Отворете","WEP","WPA/WPA2-PSK"];	
var netWlessSecu2 = ["Ниедно","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK","Не е поддржано"];	
var netWlessSecu3 = ["Ниедно","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)","Не е поддржано"];	
var netOptions = ["Интернет врска","Интерфејс","Параметри за безжично","Параметри за IP","Информации","Тест за врска","DLNA","TV Remote","Параметри за Netflix","WiFi приказ","Тип на адреса","IP-адреса","Подмрежна маска","Стандардна капија","Примарна DNS","Секундарна DNS","SSID","BSSID","Ве молиме, внесете SSID:","Корисничко ИД"];	
var chEditDes = ["Бројот на канал е внесен два пати!","Притиснете го црвеното копче за да го избришете тековниот знак!","Неважечки броеви на канали."];	
var chEpgNoProgram = "Сега нема информации за програма, најпрво пребарајте канали!";	
var chEpgWords = ["Водич на програма","Нема податоци за програма.","Каналот е заклучен!","Нема детали за програма.","Нема наслов на програма."];	
var chEpgBooking = ["Информации за распоред", "Број на канал","Датум на почеток","Време на почеток","Време на завршување","Повторете тип","Тип на програма","Додадете распоред","Заменете","Изменете","Додадете/Модифицирајте"];	
var epgHotKey = ["Претх. ден","Следен ден","Филтер","Список со распоред","Додадете распоред"];	
var chEpgBookRemind = ["Грешно време на почеток","Грешно време за завршување","Двоен распоред","Успешно зачуван.","Успешно избришан."];	
var chSchePara = ["Список со распоред","Време на почеток","Датум на почеток","Наслов на програма","Име на канал","Времетраење","Повторете","Распоред","Уредете","Избришете"];	
var dateTimer = ["Еднаш","Дневно","Неделно"];	
var scheduleDeleteReminds = "Сакате ли да го избришете овој распоред?";	
var scheduleNoLists = "Нема список со распоред. Притиснете го \"Црвеното\" копче за да додадете распоред.";	
var chListWords = ["Список со канали","Изберете список","Режим на приемник","Додадете во Омилени","Отстранете","Изберете список со канали","Изберете режим на приемник","Заменете"];	
var chListType = ["Сите","Дигитален","Аналоген","Радио","Бесплатно","Омилени"];	
var chAutoScanOptions = ["Изберете оператор","Тип на канал","Автом. пребарување"];	
var souSoundType = ["Неважечко","Моно","Моно","Стерео","Стерео","SAP","SAP","Dual1","Dual2","Dual2","Nicam Mono","Nicam Stereo","Nicam dual1","Nicam dual2","Nicam dual","Моно","ЛЛ","ДД","ЛД"];	
var souPreset = ["Музика","Филм","Говор","Стандардно","Лично"];	
var picAdRgbMode = ["Исклучено","Само црвено","Само зелено","Само сино"];	
var picAdOptions = ["Намалување на бука","MPEG NR","Режим RGB","Динамичен контраст","Јасност на движење на LED","Боја на кожа","Режим на филм","Режим на игра","Температура на боја","Баланс на бела боја","Замрзнување на слика","Зацрнување","Overscan","Гама","Режим HDMI","10P баланс на бела боја","Засилувач на боја","Намалување на замаглување","Намалување на тресење","Опсег на бои","Јасност на движење"];	
var pic10Pwhite = ["Интервал","Црвено","Зелено","Сино","Ресетирајте","Боја","Жолта","Тиркизна","Пурпурна"];	
var picMotionClarity = ["Режим за движење","Интерполација на движење","Јасност на движење на LED","Намалување на замаглување","Намалување на тресење","Ресетирајте"];	
var picMotionMode = ["Филм","Блага","Јасна","Спорт","Клиент"];	
var picResetDes = "Сите лични параметри ќе се ресетираат. Сигурно сакате да го извршите избраното дејство?";	
var pic10PReset = "Дали сте сигурни дека сакате да го ресетирате 10P балансот на бела боја?";	
var picMotionReset = "Дали сакате да ја ресетирате јасноста на движење?";	
var picColorSpaceReset = "Дали сакате да го ресетирате опсегот на бои?";	
var picOptions = ["Претходно поставена слика","Светло на заднина","Осветленост","Контраст","Заситеност","Боја","Острина","Температура на боја","Режим на екран","Автом. формат","Спортско подобрување","3Д","3Д навигација","ЕКО параметри","Геометрија","Напредни параметри","Ресетирање на слика"];	
var picSize = ["Формат 16:9", "Формат 4:3", "Формат 14:9", "Синерама","Зум 16:9", "Зум над 16:9","Зум 14:9","Растегање на зум","Широк зум","Зум 2","Широк зум2","Совпаѓање со изворен екран","Точка по точка","Оригинално","Панорама"];	
var others = ["Јачина на звук","Емитување","Лозинка","Состојба","Зачувајте","Заменете","Почнете","Излезете","Пребарајте","Избришете","Ниедно","Автоматски","Скенирање","Безбедност","Поврзување","Освежете","Обидете се повторно","Прекинете","Параметри","Канали","Уредете","Внесете","Сигнал","Завршете","Стерео","Аудио","Извор","Нема аудио","Совети","Ресетирајте","Клиент","Поставете","Зачувајте","Корисник","Затворете тастатура","Безбедносен режим","Секојдневно","Список PVR"];	
var direction = ["Лево","Десно","Горе","Долу"];	
var audioType = ["MPEG","DOLBY AUDIO"/*"AC3"*/,"MPEG4","AAC", "DOLBY AUDIO"/*"AC3P"*/,"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD"," "," "," "," "," "," ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2","HE-AAC_V4","Непознато"];
var soundChannels = ["Непознато","Моно","Sub","Dual Mono","Стерео","Stereo Sub","Stereo Dolby Surround","Surround 2Ch","Surround","3.0Ch","4.0Ch","5.0Ch","Mono Lfe","Dual Mono Lfe","Stereo Lfe","Surround 2Ch Lfe","Surround Lfe","3.1Ch","4.1Ch","5.1Ch","7.1Ch","Заедничко Стерео","Fmrdo Моно","Fmrdo Стерео","Fm Моно Nicam Моно","Fm Моно Nicam Стерео","Fm Моно Nicam Двојно","Лево","Десно","Други"];	
var prompts = ["Приспособете ги параметрите на слика што најдобро одговараат на вашите услови за гледање.","Приспособете ги нивоата на осветленост. Колку поблиску до 100, толку сликата е посветла.","Приспособете ги нивоата на контраст. Колку поблиску до 100, толку разликите во темна-светла слика се поголеми.","Приспособете ги нивоата на заситеност. Колку поблиску до 100, толку бојата е посилна.","Приспособете ги нивоата на острина. Колку поблиску до 100, деталите се толку појасни.","Приспособете ги нивоата на заднинско светло. Колку поблиску до 100, толку екранот е посветол.","Приспособете нивоа на тон на боја. Овој параметар ги модифицира тоновите на боја.","Изберете го форматот на слика што најдобро одговара на програмата што се гледа.","Конфигурирајте ги опциите за штедење на енергија.","Приспособете ги параметрите на геометрија на екран кога поврзувате компјутер.","Изберете повеќе напредни параметри за слика.","Обновете ги сите параметри на слика на стандардни.","Изберете режим за звук што најмногу одговара на вашиот вкус.","Приспособете го балансот на гласност меѓу лев и десен канал.","Системот за надополнување на звук TruSurround HD пружа богата звучна изведба и јасност на ниски и високи фреквенции.","Дигитален формат на интерфејс што го поврзува дигиталниот звук на ТВ-уредот со аудио опремата за домашно кино.","Изберете јазик за аудио што одговара на вашиот личен вкус.","Вклучете ја опцијата за лица со оштетен вид за да уживате во телевизиски програми.","Тестирајте ја сликата, звукот и сигналот на вашиот ТВ-уред.","Изберете тип на список со канали што одговара на вашиот ТВ-сигнал.","Изберете го јазикот на поднасловите на програмата што се прикажуваат во долниот дел на екранот.","Прикажете ги текстот и сликите на тековниот канал.","Digital Living Network Alliance. Уживајте во музика, фотографии и видео-записи преку домашна мрежа со други уреди, како на пример компјутер.","Прикажете ја содржината на вашиот паметен телефон на ТВ-уредот и користете го паметниот телефон како далечински управувач за ТВ.","Прикажете содржини од Андроид уред компатибилен со Miracast на вашиот ТВ-екран.","Заклучете го вашиот ТВ-уред.","Изберете име за вашиот уред.","Изберете ги вашите услови за гледање.","Обновете ги сите системски параметри на стандардни.","Switch off sports mode for more options.","Enhance the environmental contrast","A special mode to enjoy sport games","Enjoy more CEC functions."];
var initialTitle = ["Добредојдовте","Почетно поставување"];	
var initialPrompt = ["Направете го сега вашето почетно поставување и ве очекува свет полн со возбудливо искуство!","Изберете го вашиот јазик:","Изберете ја вашата земја:","Изберете ја вашата локација:","Изберете го видот на мрежна врска:","Изберете жичен режим на мрежна врска:","Неуспешно поврзување со xxxxxxxxx! Поврзете го уредот според следната шема или изберете Лево за ресетирање.","Поврзан со xxxxxxxxx! Изберете Десно за да продолжите.","1)Можно е вашиот ТВ-уред веќе да има вграден безжичен адаптер\n 2)Или,доколку ви е обезбеден безжичен адаптер, поврзете го со ТВ-уредот.  Потоа, изберете го режимот на безжична мрежна врска","Се врши скенирање. Ве молиме причекајте...","На ТВ-уредот нема поврзан безжичен адаптер!","Осигурете се дека следниот PIN-код е инсталиран во пристапната точка, пред да кликнете подолу на копчето „Следно“.","Притиснете го копчето на пристапната точка во рок од 120 секунди пред да притиснете Десно!","WPS(Поставување со заштитено Wi-Fi)","PIN (Број за лична идентификација)","PBC (Конфигурација со притисно копче)","Пристап во следните содржини може да се врши само со мрежна врска. Сакате да го прескокнете поставувањето на мрежа?","Има нови ажурирања на софтвер што можете да ги преземете, но тоа може да потрае во зависност од состојбата на мрежната врска.","Ажурирањето на вашиот ТВ-софтвер ви обезбедува дека можете да уживате во најновите одлики и услуги.","Нема да уживате во најновите одлики и услуги. Сакате да го прескокнете ажурирањето на софтверот?","Притиснете го копчето Десно за да продолжите.","Не исклучувајте го напојувањето додека се врши ажурирање, бидејќи тоа може да предизвика неисправно функционирање на ТВ-уредот.","Ако не сакате да ажурирате, ве молиме изберете НЕ.","Се врши ажурирање, ве молиме причекајте","Исто така, софтверот можете да го ажурирате во СИСТЕМ/АЖУРИРАЊЕ НА СОФТВЕР.","Избраната земја бара поставување на лозинка.\nПоставете код за вашиот ТВ-уред и потврдете го.","Овој код е премногу едноставен.\nВе молиме употребете различни бројки.","Честитки! Почетното поставување е завршено. Можете да ја модифицирате вашата конфигурација преку главното мени и сродните подменија.","Ве молиме, изберете го безбедносниот режим:","Ве молиме, изберете безжичен режим на мрежна конекција:","Мрежа"];	
var initNetCabAndDonRe = ["Нема поврзан мрежен кабел, ве молиме вклучете мрежен кабел!","Нема вграден безжичен адаптер или не е обезбеден безжичен USB-адаптер."];	
var initChPrompt = ["Инсталација на ТВ-канали","Изберете го типот на антенско скенирање.","Обработка на автом. подесување...","Најдени се следните антенски канали:","Изберете го типот на кабелско скенирање.","Изберете оператор од следниот список.","Извршете конфигурација на информациите од скенирањето","Најдени се следните кабелски канали:","Изберете еден оператор од следниот список","Изберете сателити за скенирање или уредете ги избраните сателити","Поставете ги параметрите на сателитот","Најдени се следните канали и скенирањето на каналите може повторно да се изврши во Канал/Скенирање на канал"];	
var initClockPrompt = ["Добијте го обезбеденото време од мрежа!","Поставете датум и време:"];	
var initialOptions = ["Средина","Поставување на мрежа","Ажурирање на софтвер","Инсталација на канал","Часовник"];	
var initialHotkeys = ["Назад","Изберете","Следно"];	
var initLocations = ["Дом","Продавница","Купувајте со демо"];	
var initNets = ["Жичен","Безжично","Немам мрежна врска"];	
var initWireManuals = ["IP-адреса","Подмрежна маска","Стандардна капија","Примарна DNS","Секундарна DNS"];	
var initSoftUpdates = ["Ажурирајте сега","Ажурирајте подоцна"];	
var initChannelIns = ["Продолжете","Не сакам да инсталирам канали"];	
var initChScanTypes = ["Дигитален и аналоген","Дигитален","Аналоген","Не сакам да извршам скенирање"];	
var initChDvbts = ["Антенски аналогни ТВ-канали:","Антенски дигитални ТВ-канали:"];	
var initChDvbcs = ["Кабелски аналогни ТВ-канали:","Кабелски дигитални ТВ-канали:"];	
var initChDvbss = ["Сателитски канали:"];	
var initChDvbSOther = ["Не сакам да скенирам сателит"];	
var initEndConnectedStatus = ["Исклучен","Поврзан со WiFi","Поврзан со жица"];	
var initEndInstallations = "Инсталирани се XXXX канали";	
var initEndUpdate = ["Ажуриран"];	
var audioScenes = ["Работна површина","Монтирање на ѕид"];	
var screenSavers = ["Сега нема информации за програма, најпрво пребарајте канали!","Нема сигнал!","Кодиран","Само податоци","Аудио програма","Нема аудио и видео","Не е достапно","Нема телетекст","Нема податоци за програма.","Програмата е заклучена!","Програмата е заклучена!\nПритиснете ОК и внесете го вашиот код.","Нема детали за програма.","Програмата е несоодветна за малолетници.\nПритиснете ОК и внесете го вашиот код.","Каналот е заклучен!","Каналот е заклучен!\nПритиснете ОК и внесете го вашиот код.","Внесувањето е заклучено!\nПритиснете ОК и внесете го вашиот код.","Не е поддржано!","Оваа услуга во моментот не е достапна","Внесувањето е заклучено!","Нема наслов на програма.","Нема функција","Нема Поднаслов"];
var chBookingPromt = ["На тековниот канал е програмирано снимање, ТВ-уредот ќе почне да снима.","Најдено е програмирано снимање.\n Префрлете се на XXXX за да снимате","Тековниот канал има потсетник.","Најден е програмиран потсетник.\n Префрлете се на XXXX"];	
var timeUnit = ["Сек.","Мин."];	
var ciPromt = ["Мрежните податоци се изменети. За да ажурирате, можете да извршите скенирање за ажурирање.",];	
var othersPromt = ["Ве молиме причекајте...",];	
var menuOptions = ["Слика","Звук","Канал","Паметен ТВ-уред","Мрежа","Систем","Поддршка"];	
var optionOptions = ["Претходно поставена слика","Претходно поставен звук","Замрзнување на слика","T-Link","Временско поместување","PVR","Список со распоред","Параметри","Демо"];	
var optionTLinkPromt = [["Автом. вклучување","Автом. мирување","Мени за упатство"],["Вклучување","Мирување","Јачина на звук на засилувач"]];	
var powerPromt = ["ТВ-уредот наскоро ќе се исклучи!\n Притиснете го кое било копче за да откажете."];	
var ttxLanguage = ["Западна ЕВР","Источна ЕВР","руски","арапски/еврејски","фарси","арапски","белоруски","грчки","турски"];	
var ttxOptions = ["Покажете","Подстраници на циклус","Јазик","Страница на аларм","Кратки вести"];	
var weekday = ["Недела","Понеделник","Вторник","Среда","Четврток","Петок","Сабота"];	
var lcnConfflict = "Оваа програма има проблеми со приемот. На каналот %d е достапна друга верзија";	
var inShopMode = "Вашиот ТВ-уред е во режим на продавница. За почетен режим изберете „Систем“ и изменете „Локација“ во менито.";	
var nitRefresh = "Мрежните податоци се изменети. Сакате да извршите скенирање за ажурирање?";	
var picHDMIMode = ["Автом.","Графика","Видео"];	
var glassRemind = ["Спојте ги вашите 3Д очила со TВ-уредот\n(Притиснете и задржете го копчето ВКЛУЧУВАЊЕ на 3Д очилата).","Вашите 3Д очила се поврзани со ТВ-уредот","*"];	
var pvrRemind = ["Не вадете ја USB-меморијата и не прекинувајте го напојувањето"];	
var pvrConName = ["PVR","Информации за програма:",["Белешка: За да снимите HD-канал, изберете USB-меморија (со брзина>5.0MB/sec); за да снимите SD-канал, изберете USB-меморија (со брзина>3.0MB/sec).","Снимениот видео-запис е сочуван во папката \"pvr\"."],"Прекинете","Снимање","Час","Минута","Времетраење","Совети","Користете ги стрелките за да поставите времетраење на снимање."];	
var pvrDisRemind = "Внесете USB-меморија за снимање.";	
var pvrRemindWords = ["Сакате да излезете?","Сакате да го прекинете снимањето и да прелистате снимени датотеки?","USB-меморијата е отстранета.","Нема доволно слободен простор.","Нема снимени датотеки. Почнете со снимање.","PVR не е поддржано на кодиран канал.","Одликата не е достапна","Успешно зачуван.","Дали сакате да го прекинете снимањето и да го измените изворот на внесување?","ТВ-уредот ќе го заврши тековното снимање. Сакате да излезете?","За правилна функција на снимање со PVR, потребен е ТВ-сигнал, молиме проверете го вашиот сигнал."];	
var pvrChangeCh = ["Сакате да го смените каналот?","Сакате да го прекинете снимањето и да смените канал?"];	
var pvrChangeToPIN8 = ["Сакате да го смените изворот на уред поврзан со SCART влез?",    "Сакате да го прекинете снимањето и да го смените изворот на уред поврзан со SCART влез?"];	
var pvrChangeToCEC = ["Сакате да го смените изворот на уред поврзан со HDMI влез?",   "Сакате да го прекинете снимањето и да го измените изворот на уред поврзан со HDMI влез?"];	
var pvrGuideJump = ["Сакате да влезете во Електронскиот водич низ програми (EPG)?","Сакате да го прекинете снимањето и да влезете во Електронскиот водич низ програми (EPG)?"];	
var pvrMediaJump = ["Сакате да влезете во Медиуми?","Сакате да го прекинете снимањето и да влезете во Медиуми?"];	
var timeshiftExtra = ["Сакате да го прекинете снимањето за одложено гледање и да смените канал?","Сакате да го прекинете снимањето за одложено гледање и да го смените изворот на уред поврзан со SCART влез?","Сакате да го прекинете снимањето за одложено гледање и да го смените изворот на уред поврзан со HDMI влез?","Снимањето за одложено гледање не е поддржано на кодиран канал.","Сакате да го прекинете снимањето за одложено гледање и да влезете во Електронскиот водич низ програми (EPG)?","Сакате да го прекинете снимањето за одложено гледање и да влезете во Медиуми?","Сакате да го прекинете снимањето за одложено гледање и да го смените влезниот извор?","Внесете USB-меморија за снимање.","USB-меморијата не е доволно голема.","ТВ-уредот ќе го заврши тековното снимање за одложено гледање. Сакате да излезете?"];	
var timeshiftStatus = ["Брзо премотување назад","Прекинете","Репродукција","Пауза","Брзо премотување напред"];	
var pvrPowerOffRemind = ["Снимање во мирување","Мирување","ТВ-уредот сега снима, дали сакате да продолжите со снимање кога ТВ-уредот е во режим на мирување?"];	
var timeshiftInitTitle = "Поставување на USB-меморија";	
var timeshiftInitReminds = ["Овој волшебник се користи за поставување на USB-меморија за снимање за одложено гледање. Изберете го режимот на поставување.", "За подобра изведба, препорачуваме да извршите форматирање на USB-меморијата. Тоа ќе ги избрише сите податоци.", "Изберете ја големината на датотека за снимање за одложено гледање.", "Се врши форматирање", "Нема доволно слободен простор.", "Создавање на датотека за снимање за одложено гледање", "Тестирање на брзина", "Брзината на USB-меморијата е премала (< %f MB/sec) за одликата за снимање за одложено гледање!", "USB-меморијата е подготвена за снимање за одложено гледање. Но, препорачуваме да ја смените (на брзина > %f MB/sec) за подобра изведба.", "USB-меморијата е подготвена за снимање за одложено гледање."];	
var timeshiftInitButtons = ["Форматирање","Прескокнете","Откажи","ОК","Завршете","Излезете"];	
var timeshiftInitOther = ["Брзина на USB-меморија:","MB/sec"];	
var selectChoice = "Сигурно сакате да го извршите избраното дејство?";	
var chAtvStore = "Сочувајте како XXXX";	
var chEpgFirstGenreUK = ["Филм","Новини и факти","Забава","Спорт","Детски","Образование","Животен стил","Драма"];	
var homePageTitleList = ["АПЛИКАЦИИ","ТВ","ВИДЕО-ЗАПИСИ","Почетна страница"];	
var homePageFavAndAllName = ["Омилени апликации","Сите апликации"];	
var homePageBackUp = ["E-прирачник","GuideOn"];	
var homePageRemind = ["Целосните функции се достапни само со мрежно поврзување.","Вашиот ТВ-уред сѐ уште нема канали. Програмите се достапни откако ќе скенирате за канали.","Нема програма","Сакате да пребарате канали сега?"];	
var homePageHistory = ["Историја"];	
var miracastTitle = ["WiFi приказ","TCL уред"];	
var miracastRemind = ["WiFi приказот ви овозможува да споделувате безжично екран и звук од вашиот уред, како на пример од паметен телефон или таблет на вашиот ТВ-уред (т.e. без кабли). Ова ви овозможува истовремено да го гледате на вашиот ТВ-уред она што се прикажува на вашиот паметен телефон или таблет. На пример, можете да стартувате видео-запис на вашиот паметен телефон и истовремено да го прикажувате на ТВ-уредот, или да користите таблет за да управувате со игра чија содржина се прикажува на големиот екран на ТВ-уредот.","WiFi приказот на ТВ-уредот е подготвен и сега можете да почнете со споделување на екранот на уредот со ТВ-уредот.","Се врши поврзување. Молиме, причекајте!","Поврзувањето беше неуспешно!","Неуспешно поврзување. Ве молиме проверете!"];	
var homePageLittleWin = ["Параметри","Медиуми","Омилени канали","Паметен ТВ-уред","Електронски програмски водич (EPG)"];	
var hbbtvStopRemind = ["Сакате да ја прекинете репродукцијата?"];	
var colorSystem = ["Автом.","PAL","SECAM","NTSC"];	
var deviceTitleTipsText = "Притиснете ≡ за повеќе информации";	
var emptyListInfo = "Нема USB-меморија поврзана со ТВ-уредот!";	
var optionVideoListArray_1 = ["Претходно поставена слика", "Претходно поставен звук", "Режим за репродукција", "Режим на екран", "3Д режим",   "Прекинувач Л-Д", "Длабочина на поле", "Поднаслов", "Песна", "Наслов", "Поглавје", "Информации"];	
var optionVideoListArray_2 = ["Претходно поставена слика", "Претходно поставен звук", "Режим за репродукција", "Режим на екран",   "Поднаслов", "Песна", "Наслов", "Поглавје", "Информации"];	
var bottomTipsText = ["Репродукција/Пауза", "Брзо премотување назад", "Брзо премотување напред", "Список за репродукција", "Параметри"];	
var picturePresetArray = ["Стандардно", "Динамично", "Природно", "Филм", "Лично"];	
var videoPlayModeArray = ["Повторете сѐ", "Повторете една", "Нормално"];	
var screenModeHDArray = ["16:9", "4:3", "Синерама", "Широк зум", "Зум 2", "Широк зум2", "Растегање на зум", "Автоматски"];	
var screenModeSDArray = ["16:9", "4:3", "Синерама", "Зум 14:9", "Зум 16:9", "Зум над 16:9", "Автоматски"];	
var Mode3DArray = ["Исклучено", "2Д во 3Д", "Едно до друго", "Горе и долу", "Преплетување на линии"];	
var videoOptionListArray = ["Исклучено", "Песна", "Поднаслов", "Наслов", "Поглавје"];	
var subMenuTitleText = "Поднаслов";	
var langMenuTitleText = "Јазик на аудио";	
var titleMenuTitleText = "Наслов";	
var mode3DMenuTitleText = "3Д режим";	
var langInfoText = "Песна";	
var STOP_RESUME_INFO = "Прекинете-Продолжете";	
var playListName = "Име";	
var eb_tips = "Совети";	
var ok_button = "ОК";	
var eb_info = ["Грешка при дешифрирање на аудио-запис.", "Грешка при дешифрирање на видео-запис.", "Форматот на аудио-запис не е поддржан.",    "Форматот на видео-запис не е поддржан.", "Не може да се отвори оваа датотека.", "Грешка при репродукција, обидете се повторно.",   "Форматот на датотека не е поддржан.", "Упс! Плеерот престана да врши репродукција.",   "Датотечната патека не постои или е неважечка.\n Внесете го повторно меморискиот уред и обидете се повторно.",   "Сакате да продолжите со репродукција од претходната\n состојба на репродукција?"];	
var picturePlayErrorTips = ["Неуспешно вчитување!!!","Сликата е преголема!!!","Мрежна грешка!!!","Грешка во нишка!!!","Грешка во парам!!!","Непозната грешка!!!"];
var frameTitleText = "Нов уред";	
var eb_quit_info = "Сигурно сакате да прекинете?";	
var eb_yes = "Да";	
var eb_no = "Не";	
var offinfo = "Исклучено";	
var naInfo = "Ништо";	
var consoleInfoArray = ["Брзо премотување назад", "Брзо премотување напред", "Репродукција/Пауза", "Список за репродукција"];	
var cantOperateText = ["Функцијата не е поддржана."];	
var chapterChangeInfo = "Достапни се само поглавја од 1 до XXXX.";	
var metaDataArray = ["Метаподатоци од наслов/издание:", "Метаподатоци од поглавје:", "Метаподатоци од аудио-запис:", "Метаподатоци од поднаслов:"];	
var metaTitleInfo = "Наслов";	
var metaChapterInfo = "Поглавје";	
var videoLoadingInfo = "Се врши анализа...";	
var listLoadingInfo = "Се врши вчитување...";	
var pgInfo = "Законска оцена:";	
var fileNameText = "Име";	
var fileDateText = "Датум";	
var fileSizeText = "Големина";	
var fileDurationText = "Времетраење";	
var fileDirectorText = "Режисер";	
var fileCopyrightText = "Авторско право";	
var fileArtistText = "Уметник";	
var fileAlbumText = "Албум";	
var fileGenreText = "Жанр";	
var fileYearText = "Година";	
var fileGenreText = "Жанр";	
var mainListArray = ["Сите", "Слика", "Видео", "Музика"];	
var sortArray = ["Име", "Датум"];	
var parserArray = ["Нормално", "Рекурзивно"];	
var emptyTipsInfo = "Упс. Не е најдена поддржана датотека.";	
var emptyFolderInfo = "Упс. Не е најдена поддржана датотека.";	
var sortName = "Сортирајте според";	
var parserName = "Анализатор";	
var divx_str1 = "Регистрација на DivX(R)";	
var divx_str2 = "Дерегистрација на DivX(R)on";	
var infor_str = "Информации";	
var quickMenuEmptyText = "Нема достапни опции.";	
var musicSoundPresetArray = ["Стандардно", "Филм", "Музика", "Јасен глас", "Лично"];	
var musicInformationArray = ["Име", "Уметник", "Албум", "Жанр:", "Година:", "Времетраење:"];	
var playListName = "Име";	
var playTipsInfo = ["Ја репродуцирате првата датотека.", "Ја репродуцирате последната датотека."];	
var musicNameInfo = "Име";	
var musicArtistInfo = "Уметник";	
var musicAlbumInfo = "Информации";	
var optionSoundPresetInfo = "Претходно поставен звук";	
var optionBGMInfo = "Репродукција во заднина";	
var optionAudioOnlyInfo = "Само аудио-запис";	
var optionInfoText = "Информации";	
var remotePhoneConnecte = "XXXX се поврза со ТВ-уред!";	
var tvRemoteTitle = "TV Remote";	
var tvRemoteDeveloper = "Апликацијата е програмирана од TCL";	
var tvRemoteDeviceTitle = "Име на уред:";	
var remoteOption = ["Споделување медиуми","Далечински управувач","Помош","Во врска со","Smart Connect"];	
var remotebottom = "Преземете ја \"TV Remote\" на вашиот паметен телефон";	
var remoteStage = ["Андроид","iOS"];	
var sharingReminds = ["Споделување фотографии, видео-записи и музика со ТВ-уред преку телефон.","Чекори: \n   1. Кликнете \"TV Remote\" на телефонот. Поврзете телефон со ТВ-уред преку иста WiFi мрежа;\n   2. Кликнете \"Споделување медиуми\" за да прелистате медиумски датотеки;\n   3. Испратете медиум во ТВ-уред за репродукција (со една од следните опции)","а) Влечете и Испуштете папка во иконата на за ТВ-уред во горниот дел на екранот;\n      б) Завртете го телефонот кон ТВ-уредот за да ја стартувате првата датотека;\n      c) Репродуцирајте го медиумот и кликнете на иконата за споделување со ТВ-уред;","4. Додека вршите репродукција на ТВ-уредот, затресете го телефонот за да ја репродуцирате претходната или следната датотека."];	
var controlReminds = ["Употребете го телефонот како далечински управувач за да го контролирате ТВ-уредот."," ","Чекори: \n   1. Кликнете \"TV Remote\" на телефонот. Поврзете телефон со ТВ-уред преку иста WiFi мрежа;\n   2. Кликнете \"Далечински управувач\" за да го контролирате ТВ-уредот."];	
var helpDeviceWords = "Интеракција со повеќе екрани";	
var helpBottom = "Во ерата на технологијата во облак, паметните уреди, како телефоните и ТВ-уреди, се меѓусебно поврзани. Споделувајте медиуми со вашето семејство на повеќе екрани и контролирајте го ТВ-уредот преку телефон!";	
var helpReminds = ["Подготовки\n   1. Преземете ја и инсталирајте ја \"TV Remote\" од Google Play или Apple Store.\n   2. Поврзете го телефонот со ТВ-уредот преку иста WiFi мрежа."," ","Препорачани одлики на телефон\n   1. CPU: над 800MHz\n   2. Меморија: најмалку 80MB слободен простор"," ","Одрекување од одговорност\n   Ако \"TV Remote\" е недостапна на вашиот телефон, контактирајте со произведувачот на телефонот."];	
var helpButtons = ["Претходно","Следно"];	
var aboutReminds = ["TV Remote","Апликацијата е програмирана од TCL"];	
var aboutExit = "Излезете";	
var smartReminds = ["Брзо и паметно поврзување меѓу ТВ-уред и телефон."," ","Чекори \n   1. Поврзете го ТВ-уредот и паметниот телефон на иста LAN. Кликнете \"TV Remote\" на паметниот телефон.\n   2. Кликнете \"Smart Connect\" за скенирање на QR-кодот.\n   3. Кога ТВ-уредот се наоѓа во режим за приказ на емитување, притискајте го 4 секунди копчето INFO на далечинскиот управувач и QR-кодот ќе се појави на целиот екран.",];	
var smartQRReminds = ["Кликнете \"Smart Connect\" во \"TV Remote\" на вашиот телефон и скенирајте го QR-кодот за брзо поврзување на ТВ-уредот и телефонот.","QR-кодот содржи информации за LAN сметката. Чувајте го безбеден."];	
var consoleTipArray = ["Претходно","Следно","Конзола","Список за репродукција"];	
var optionInfoArray = ["Претходно поставена слика","Режим за репродукција","Времетраење","Ефект","Информации"];	
var playModeArray = ["Нормално","По случаен избор","Повторете"];	
var durationArray = ["Кратко (5с)", "Средно (10с)", "Долго (15с)"];	
var effectArray = ["Ниедно", "Ротирајте", "Лизгајте десно", "Лизгајте лево", "Лизгајте горе", "Лизгајте долу", "Спакувајте", "Отпакувајте", "Случајно"];	
var infoArray = ["Име:","Големина:","Датум:","Локација"];	
var picturePresetBarTitleInfo = "Претходно поставена слика";	
var picturePresetBarArray = ["Стандардно","Динамично","Студио","Филм","Лично"];	
var upTipsInfo = "Преместете слика";	
var consoleTipsArray = ["Конзола","Претходно","Следно","Список за репродукција","Параметри"];	
var pictureMoveTipsArray = ["Притиснете повторно ДЕСНО за прикажување на следната слика","Притиснете повторно ЛЕВО за прикажување на претходната слика","Притиснете повторно ДОЛУ за прикажување на списокот за репродукција"];	
var optionPvrListArray = ["Претходно поставена слика","Претходно поставен звук", "Режим на екран", "3Д режим", "Поднаслов", "Песна", "Информации"];	
var titleSpanFirstArray = ["Контрола и поврзување","Основни операции","АПЛИКАЦИИ","ТВ","Параметри","ЧПП"];	
var titleSpanSecondArray = [["Далечински управувач","Копчиња на панелот","Лесна навигација","Поврзување со ТВ-уред","Поврзување со ТВ-уред","Поврзување со ТВ-уред","Безжично"],["Стартер","Статусна лента","Извор"],["Апликации за репродукција","Медиуми","TV Remote"],["Приспособување на канал и јачина на звук","Список со канали","Електронски програмски водич (EPG)","Инсталација на канал","Омилени канали"],["Приспособување на слика","Приспособување на звук","Приспособување на канал","Ажурирање на софтвер","Јазик","Родителско заклучување"],["Често поставувани прашања","Често поставувани прашања","Решавање проблеми","Решавање проблеми","Услови и одредби"]];	
var contentSpan1_1Array = [["ВКЛУЧУВАЊЕ:","ИЗВОР:","ПАРАМЕТРИ:","ОПЦИЈА:","НАЗАД:","ПОЧЕТНА:","ДОМА:","ИЗЛЕЗ:","СПИСОК:"],    ["Вклучува напојување или префрла во режим на мирување",        "Изберете го влезниот извор",        "За прикажување на менито Параметри",        "За прикажување на менито Опции",        "Вратете се во претходното мени или излезете од тековната АПЛИКАЦИЈА",        "Прикажува информации за програма",        "За пристап во почетната страница на Smart TV",        "Вратете се во претходното мени или излезете од тековната АПЛИКАЦИЈА",        "Го прикажува списокот со канали"]];	
var contentSpan1_2Array = ["Претходен канал","Следен канал","Појачување на јачина на звук","Намалување на јачина на звук","Води на Почетна страница","Потврдете ја опцијата","Мирување/Вклучување"];	
var contentSpan1_3Array = ["ОК/Упатство","Канал нагоре","Канал надолу","Намалување на јачина на звук","Зголемување на јачина на звук","Достапно како копчиња со стрелки во некои функции."];	
var contentSpan1_4Array = ["LAN","HDMI (MHL)","HDMI","HDMI (ARC)","Адаптер за AV излез","LAN","Паметен телефон","PC/Сет-топ-бокс/ДВД","Аудио засилувач","Аудио засилувач/Монитор","Вашиот ТВ-уред може да не ги содржи сите приклучници."];	
var contentSpan1_5Array = ["USB 2.0","USB 3.0","Слушалки","Адаптер за AV влез","SPDIF","Адаптер за CMP AUDIO ВЛЕЗ","Адаптер за CMP ВЛЕЗ (YPbPr)","USB-уреди","USB-уреди","Слушалки","DVC/Конзола за игри/Сет-топ-бокс/ДВД","Аудио засилувач","DVC/Конзола за игри/Сет-топ-бокс/ДВД","Вашиот ТВ-уред може да не ги содржи сите приклучници."];	
var contentSpan1_6Array = ["Заеднички интерфејс","SD","VGA","SCART","Мини SCART","ВЛЕЗ ЗА АНТЕНА","CI  CAM","SD-картичка","Компјутер","Сет-топ-бокс/ДВД","Антена/Кабел/Сателит","Вашиот ТВ-уред може да не ги содржи сите приклучници."];	
var contentSpan1_7Array = ["Таблет","Компјутер","Рутер","Телефон","ТВ"];
var contentSpan1_8Array = ["Префрли функција/Напојување","Долго притиснете за тајмерот за мирување","Долу","Горе","Јачина на звук/Канал/Извор"];
var contentSpan2Array = [["Притиснете ги копчињата со стрелки за да ја прикажете Почетната страница.","Потоа, притиснете ОК за да гледате некоја од претставените програми или да влезете во апликацијата."],["Прикажете датуми, мрежа и уреди итн. во горниот десен агол на екранот."],["Изберете го влезниот извор од уредите поврзани со ТВ-уредот преку различни порти, како ТВ, AV, HDMI итн."]];	
var contentSpan3Array = ["Уживајте и прикажувајте ги вашите омилени апликации преку страницата Smart TV.","Прикажувајте фотографии, гледајте видео-записи и репродуцирајте музика од USB-мемориски уред.","Поврзете ги ТВ-уредот и паметниот телефон или таблетот на иста LAN.","Кликнете nScreen или TV Remote на паметниот телефон или таблетот.","Споделувајте со вашето семејство фотографии, видео-записи и музика на повеќекратните екрани и контролирајте го ТВ-уредот преку вашиот паметен телефон."];
var contentSpan4Array = [["Притиснете P+/P- за да менувате канали.","Притиснете V+/V- за да ја приспособите јачината на звук."],["Притиснете LIST на далечинскиот управувач за да ја видите листата со канали.","Притиснете ГОРЕ/ДОЛУ за да го изберете вашиот канал."],["EPG е електронски програмски водич на екран и го прикажува распоредот на ТВ-програми. Можете да вршите навигација, избор, приказ и да снимате програми."],["Пребарувајте и инсталирајте канали."],["Додадете ги или уредете ги вашите омилени канали во списокот со канали."]];	
var contentSpan5Array = ["Уживајте во вашите омилени програми преку видео апликациите."];	
var contentSpan6Array = [["Притиснете Опција, а потоа изберете Параметри за да ги прикажете опциите за поставување на системот.","Внесете параметри на слика за да ги приспособите вредностите."],["Притиснете Опција, а потоа изберете Параметри за да ги прикажете опциите за поставување на системот.","Внесете параметри на звук за да ги поставите опциите."],["Притиснете Опција, а потоа изберете Параметри за да ги прикажете опциите за поставување на системот.","Внесете параметри на канал за да ги поставите опциите."],["Ажурирајте го вашиот ТВ-уред кога има достапна нова верзија на софтвер."],["Можете да го изберете јазикот на мени што го претпочитате."],["Им овозможува на родителите да заклучуваат канали или програми што не се соодветни за деца."]];	
var contentSpan7_1Array = [["Нема слика, нема звук","Проверете дали осигурувачот или прекинувачот работат.","Вклучете друг електричен уред во приклучницата за да се осигурате дека работи или дека е вклучена.","Електричниот приклучок има лош контакт со приклучницата.","Проверете го изворот на сигнал."],["Нормална слика, нема звук","Притиснете го копчето V+ за да ја зголемите јачината на звук.","Параметарот на звук е грешен.","Грешка на сигнал од емитувањето."],["Нормален звук, нема слика","Приспособете ја осветленоста и контрастот.","Грешка на сигнал од емитувањето.","Проверете дали е само во аудио-режим."]];	
var contentSpan7_2Array = [["Електро-магнетни пречки","Овие пречки произведуваат движечки бранови или дијагонални линии, и во одредени случаи, се губи контрастот во сликата. Најдете го и отстранете го изворот на пречки."],["Нема боја","Приспособете ги параметрите на боја.","Пробајте друг канал. Може да се прими црно-бела програма."],["Далечинскиот управувач не работи","Заменете ги батериите.","Батериите не се добро поставени. Главното напојување на ТВ-уредот не е поврзано."]];	
var contentSpan7_3Array = [["Содржината на USB-уредот не се прикажува","Проверете дали USB меморискиот уред е компатибилен со ТВ-уредот.","Проверете дали ТВ-уредот ги поддржува форматите на аудио и видео-записи."],["Репродукција без звук","ТВ-плеерот не го поддржува аудио-форматот на видео-записот."],["Датотеките не се репродуцираат правилно","Преносната изведба на USB меморискиот уред може да ја ограничи брзината на пренос на податоци на ТВ-уредот."]];	
var contentSpan7_4Array = [["На што треба да внимавам кога вршам ажурирање на софтвер","Да нема прекини во напојувањето додека се врши ажурирање на софтвер.","Избегнувајте секакви дејства со вашиот далечински управувач кога вршите ажурирање на софтвер.","Бидете трпеливи бидејќи постапката за ажурирање на софтвер може да потрае."],["По ажурирањето на софтверот, на ТВ-уредот нема значајни промени на интерфејсот.","Во одредени услови, ажурирањето на софтвер може не само да ажурира или да додаде нови функции, туку и да ја подобри изведбата на ТВ-уредот без значајни промени на интерфејсот. Исто така, понекогаш ТВ-уредот може да остане неизменет."]];	
var termsTitle = "Услови и одредби";	
var termsConditions = ["Содржината и услугите (заеднички \"Лиценцираната апликација\") што ви е дадена на располагање преку овој ТВ-уред (\"Уредот\") се лиценцирани, а не продадени, само за ваша употреба според овие услови и одредби. Снабдувачите на Лиценцираната апликација (секој поодделно \"Снабдувач на апликација\") ги задржуваат сите права што не ви се изрично доделени. \n 1. Обем на Лиценцата \n Лиценцата што ви е доделена за Лиценцирана апликација од односниот Снабдувач на лиценца е ограничена на непренослива лиценца за користење на Лиценцираната апликација на Уредот што е во Ваша сопственост или контрола. Не смеете да ја дистрибуирате или да ја давате на располагање Апликацијата преку мрежа каде истовремено може да ја користат повеќе уреди. Не смеете да ја изнајмувате, давате под закуп, позајмувате, продавате, дистрибуирате повторно или подлиценцирате Лиценцираната апликација. \n Потврдувате и се согласувате дека сите Лиценцирани апликации и сите содржини вклучени во нив што се достапни преку овој Уред се сопственост на Снабдувачот на апликација и се заштитени со важечките закони за интелектуална сопственост. Не смеете да ја модифицирате, копирате, декомпилирате, преработувате, расклопувате, објавувате повторно, префрлате, објавувате, пренесувате, преведувате, да се обидувате да го изведете изворниот код, да создавате изведени работи, или на друг начин да ја користите која било Лиценцирана апликација, ажурирања или кои било нејзини делови. Доколку го прекршите ова ограничување, можно е да подлежите на судско гонење и отштети. Условите на лиценцата ќе бидат важечки за кои било надградби обезбедени од Снабдувачот на апликација што ја заменуваат и/или дополнуваат оригиналната Лиценцирана апликација, освен ако таквата надградба е придружена од одделна лиценца, и во тој случај важечки ќе бидат условите на таа лиценца. Вие ќе ја сносите целосната одговорност за некои или сите трошоци (доколку постојат) за надградба на Лиценцираната апликација. \n 2.Материјали на трети страни \n Лиценцираната апликација може да овозможи пристап во интернет-страници и услуги на Снабдувачот на лиценца и трети страни (заеднички \"Услугите\"). Разбирате дека користејќи која било од овие Услуги, можно е да сретнете содржина што може да се смета навредлива, непристојна или неприфатлива, кои може или не може да се смета дека имаат експлицитен јазик, и дека резултатите од кое било пребарување или внесување на одредена URL-адреса може автоматски или ненамерно да создадат врски или упатувања во навредлив материјал. Меѓутоа, се согласувате дека произведувачот на овој Уред (\"Произведувачот\") и Снабдувачот на апликација, нема да имаат каква било одговорност кон вас за содржините што можеби се сметаат за навредливи, непристојни или неприфатливи.\nСо користењето на Услугите, потврдувате и се согласувате дека Произведувачот не е одговорен за испитување или оценување на содржината, точноста, целосноста, навременоста, издржаноста, сообразноста со авторски права, законитоста, квалитетот или кој било друг аспект на таквите Услуги. Произведувачот не гарантира или одобрува и не презема никаква обврска или одговорност кон Вас или кон друго лице за која било од Услугите. \n Потврдувате и се согласувате дека Услугите може да содржат содржина, информации и материјал што се нечија сопственост (заеднички \"Материјали на трети страни\"), заштитени со важечките закони за интелектуална сопственост и други закони, и дека нема да користите такви Материјали на трети страни на никаков друг начин, освен како што е дозволено за Услугите. Се согласувате да не ги размножувате, модифицирате, изнајмувате, давате под закуп, позајмувате, продавате, дистрибуирате Материјалите на трети страни или да создавате изведени работи на кој било начин, и дека нема да ги користите Услугите на каков било недозволен начин. Понатаму, се согласувате да не ги користите Услугите на каков било начин за да вознемирувате, злоупотребувате, следите, се заканувате, клеветите или на друг начин да ги повредувате или прекршувате правата на која било друга страна, и дека Произведувачот не е одговорен за кое било такво користење од Вашата страна, ниту за емитување на вознемирувачки, заканувачки, навредливи или незаконски емитувања што може да ги добиете како резултат на користење на која било од Услугите. \n 3.Без гаранција \nПотврдувате и се согласувате дека користењето на Лиценцираната апликација и Услугите е единствено на ваша сопствена одговорност. Сите Лиценцирани апликации у Услуги се дадени \"како што се\" и \"како што се достапни\", без никаков вид гаранција, било директна или индиректна. Произведувачот изрично се одрекува од сите гаранции и услови во однос на Лиценцираната апликација и Услугите, директни или индиректни, вклучувајќи ги, но не одрекувајќи се на гаранции за трговска подобност, задоволителен квалитет, подобност за одредена намена, точност, тивко уживање и непочитување на правата на трети страни. Производителот не ја гарантира точноста, целосноста, навременоста, законитоста или целосноста на која било Лиценцирана апликација или Услуги дадени на располагање преку овој Уред и не гарантира дека Уредот, Лиценцираната апликација или Услугите ќе ги исполнат вашите барања, или дека работата на Лиценцираната апликација или Услугите ќе бидат непрекинати или без грешки, или дека дефектите во Лиценцираната апликација или Услуги ќе се отстранат. Доколку се испостави дека Лиценцираната апликација или Услугите се дефектни, вие ќе ги преземете вкупните трошоци за неопходното сервисирање, поправка или корекции.\nПотврдувате и се согласувате дека Лиценцираната апликација и Услугите може да се изменат, исклучат, отстранат или прекинат, или дека пристапот може да биде прекинат во секое време, без известување и Производителот не ветува или гарантира дека која било содржина или услуга вклучени во Лиценцираната апликација или Услуги ќе бидат достапни некој временски период. Таквата содржина и услуги се пренесуваат од трети страни преку мрежи и постројки за пренос кои Произведувачот не ги контролира. Без да се ограничува на општите правила во претходно наведеното, Произведувачот изрично се одрекува од каква било одговорност или обврска за било каква измена, прекин, исклучување, отстранување или прекин на услугата што ви е дадена на располагање преку овој уред. Снабдувачот со апликација и другите снабдувачи со Услуги го задржуваат правото да менуваат, исклучуваат, отстрануваат или прекинуваат пристап до која било Лиценцирана апликација или Услуги во секое време без известување. Произведувачот исто така може да наметне ограничувања врз користењето или пристапот во одредена Лиценцирана апликација или Услуги, во кој било случај и без известување или одговорност.\nПроизведувачот не е одговорен, ниту пак има обврска за услугите на клиенти поврзани со Лиценцираната апликација и Услугите. Сите прашања или барања за услуги поврзани со Лиценцираната апликација и Услугите треба да се упатуваат директно кај односниот снабдувач.\n 4.Собирање и користење на информации \nСе согласувате дека Произведувачот, Снабдувачите на апликации и снабдувачите со Услуги може да собираат и користат технички податоци и сродни информации, вклучувајќи, но не ограничувајќи се на технички информации за овој Уред, систем и софтвер на апликација и периферни уреди, за да го олеснат вашето снабдување со ажурирања на софтвер, да ви пружаат поддршка и други услуги (доколку пружаат) поврзани со Уредот и Лиценцираната апликација. Произведувачот, Снабдувачите на апликации и снабдувачите со Услуги може да користат такви информации, само ако се во облик што не ве идентификува лично, за да ги поправат своите производи или да ве снабдуваат со услуги или технологии. \n 5.Недостапност на одредени одлики \nЗаради ограничувања на Снабдувачот на апликации, одредени одлики, апликации и услуги може да бидат недостапни на овој Уред (вклучувајќи ги и неговите периферни уреди) или на сите територии. Некои одлики на овој Уред може исто така да бараат дополнителни периферни уреди или трошоци за членство што се продаваат одделно. \n 6.Ограничување од одговорност \nДо мера што не е забранета со применливиот закон, во ниеден случај, вклучувајќи небрежност, Произведувачот нема да биде одговорен, било во договор или прекршок, за какви било директни, индиректни, случајни, специјални или последични отштети, адвокатски награди, трошоци или какви било други отштети што произлегуваат, или се поврзани со кои било информации што се содржани, или се резултат од користењето на Уредот, која било Лиценцирана апликација или која било Услуга од вас или која било трета страна, дури и кога е советуван за можноста од такви отштети."];	
var noChannelListRemind = ["Не беа најдени канали. Списокот со канали е достапен откако ќе се изврши скенирање за канали.","Скенирање на канали"];	
var closeSubtitleRemind = "Функцијата ќе биде достапна кога поднасловот е исклучен. Сакате да поставите сега?";	
var estickerTitles = ["Високо реалистички слики","Бои што оживуваат","Прекрасно движење со природен изглед","Динамички квалитет на слика","Подобрување SR UHD","Доживејте 3Д свет","Побрза изведба","Идна содржина 4K","Уживајте во онлајн светот","Пристапете во екстра содржина","Интегрирани дигитални приемници","Поврзете ги сите уреди","Разни извори за 4K","USB-содржина","Ултра брза WIFI","Мобилна содржина на ТВ-уред","Содржина на мобилен уред","Локална содржина","Одобрено од DivX","Слика без споеви","Подготвен за канали","TDT Premium"];	
var estickerDescriptions = ["Неверојатно гледачко искуство благодарение на сликите со четири пати повеќе детали со екран Full HD на UHD","Широкиот опсег на бои 1 даваат на секоја сцена возбудливост со јасни црвени и смарагдно зелени нијанси","Вметната 4К рамка и заднинско светло што имаат за цел да ги намалат проблемите со замагленост на движење","Живоста на оригиналната слика е подобрена за да даде навистина динамичен израз со прекрасен контраст","Уживајте повеќе од кога и да било во ТВ-шоу и дискови Blu-Ray благодарение на технологијата Супер резолуција","Искусете 3D TV ready и гледајте разни 3Д содржини","Попријатно забавно искуство со Quad Core за непречена интеракција и подобрена изведба","HEVC (H.265) кодек поддршка за претстоечкиот стандард на видео-дистрибуција со 4K","Изобилство од онлајн апликации, услуги Видео на барање, ТВ за веќе емитувани програми и прелистување на интернет","Видете повеќе со дополнителните услуги и содржина од вашите омилени пренесувачи","Пристапете во ТВ-канали со висока дефиниција без дополнителна конверторска опрема","Лесно да поврзете повеќе дигитални извори што се достапни дома","ТВ-уред подготвен за иднината, со способност за репродукција на 4K 50/60Hz преку HDMI 2.0 со HDCP 2.2","Видео или фото-содржина директно од USB-меморија, HDD или камера на голем екран во резолуција 4K","Најновата генерација 2x2 MIMO и стандардот AC пружаат ненадминливо брз пристап на интернет","Уживајте во фотографии, видео-записи и апликации од мобилни уреди на голем екран благодарение на технологијата за отсликување на екран","Фотографиите, видео-записите и апликациите од паметниот телефон или таблетот може да се прикажуваат на големиот екран","Прикажувајте локална содржина на големиот екран, како на пример фотографии, видео-записи од уреди поврзани во локалната мрежа","Репродуцирајте изнајмени или сопствени филмови заштитени со DivX","Ултра тесна рамка и супер тенок дизајн","Тестиран и одобрен од Canal+","Тестиран и одобрен од TDT Premium"];	
var eManualTextArray = ["E-прирачник","Сите графики внатре се само за претставување."];	
var frontPanelRemind = "Предниот панел е заклучен.";	
var eRPRemind = "Режимот за продавница не ги исполнува условите за ERP. Дали сте сигурни дека сакате да го изберете?";	
var noRelatedChannel = "Нема поврзан канал";	
var option0624Name = ["BOP","BFS","Настан по настан","Добијте Корисничко ИД","BGM","Ресетирајте сѐ","Ресетирај продавница","NRM","DVB-T2 и избор на земја","Режим HbbTV"];	
var DVBT2AndChoice = ["Вклучено","Според земја","Исклучено"];	
var hbbtvServiceRemind = "Службата HbbTV доаѓа наскоро.";	
var insertWord = "Внесете";	
var viewDetail = "Прикажете детал";	
var remindOAD = "Ажурирање на софтвер. Ново препорачано ажурирање на софтвер можно е да постои на друг канал. Ако прифатите да го преземете, ТВ-уредот автоматски ќе се префрли на каналот. Сакате да го сторите тоа сега?";	
var LEDStatus = ["Трепкање", "Нормално","Исклучено"];	
var netFlixRemind = "Оваа функција ќе го прекине пристапот во услугите Netflix сѐ додека не се најавите повторно.";	
var ESNExplanation = "Електронски сериски број";	
var resetShopRemind = "Системот сега врши ресетирање, не исклучувајте го ТВ-уредот";	
var initialSelectOption = "Изберете една опција:";	
var databaseRemind = "Системот идентификува дека базата на податоци е оштетена од непозната причина и ја поправи автоматски, притиснете ОК за да продолжите";	
var Deactivation = "Деактивација";	
var oadFutureRemind = "Ажурирање на софтвер.\n Нов достапен софтвер ќе биде достапен на %s. Ажурирањето може да потрае и екранот може да се исклучи. Не исклучувајте го приемникот во текот на ажурирањето. Ако го прифатите ова ажурирање, оставете го приемникот вклучен во предвиденото време. Дали сакате да го примите ова ажурирање?";	
var bt_title = "Bluetooth";	
var bt_soundOutPutName = "Излез за звук";	
var bt_soundOutPutTV = "ТВ-звучници";	
var bt_soundOutPutBT = "Уред Bluetooth";	
var bt_soundOutPutBT_TV = "Bluetooth и ТВ-уред";	
var bt_refreshBarName = "Уреди";	
var bt_settingTips_On = "Вклучете ја функцијата Bluetooth и скенирајте уреди.";	
var bt_settingTips_Finding = "Наоѓање достапни уреди…";	
var bt_settingTips_NoDevice = "Нема достапни уреди.";	
var bt_deviceList_State_NoConnect = "Не е поврзан";	
var bt_deviceList_State_Connecting = "Се врши поврзување...";	
var bt_deviceList_State_Connected = "Поврзани";	
var bt_deviceList_State_Paired = "Споени";	
var bt_deviceList_Conncect_Failed_Tips1 = "Поврзувањето беше неуспешно.";	
var bt_deviceList_Conncect_Failed_Tips2 = "Потврдете дека функцијата XXX Bluetooth е вклучена";	
var bt_deviceList_Conncect_Success = "Поврзан со уред Bluetooth.";	
var bt_deviceList_Disconncect_Success = "Исклучен од уред Bluetooth.";	
var bt_deviceList_Disconnect = "Дали сте сигурни дека сакате да се исклучите од XXX?";	
var bt_tipsTitle = "Совет";	
var bt_bluetooth_Pairing_Title = "Спојување преку Bluetooth";	
var bt_bluetooth_Input_Pin = "Ве молиме внесете PIN-код:";	
var bt_bluetooth_Output_Pin_Tip = "Внесете PIN-код XXXX преку тастатура.";	
var bt_bluetooth_Pin_Wrong_Tip = "Грешен PIN-код";	
var bt_bluetooth_Remove_Pair_Title = "Прашање";	
var bt_bluetooth_Remove_Pair_Ask = "Сакате да го заборавите овој уред?";	
var audioDescriptionName = ["Аудио опис","Звучник","Јачина на звук на звучник","Слушалки","Јачина на звук на слушалки","AD јачина на звук","BT уред","Јачина на звук на BT уред","Засилувач","Звучник"];	
var audioDescriptionOptions = ["Исклучено","Нормално","Аудио опис"];	
var volumeOffRemind = "Поставете XXX \"Вклучено\" во менито Параметри.";	
var mEPSRemind = "Режимот за продавница не ги исполнува условите за MEPS. Дали сте сигурни дека сакате да го изберете?";	
var parentRatingAUOptions = ["Нема блокирање", "Блокирајте G и погоре (изборно)", "Блокирајте PG и погоре", "Блокирајте M и погоре", "Блокирајте MA и погоре", "Блокирајте AV и погоре",  "Блокирајте R и погоре", "Блокирајте сѐ"];	
var mEPSTips = ["Тековниот режим на слика не ги исполнува условите за MEPS\n, се препорачува стандарден режим.",    "Вашиот ТВ-уред е во режим на продавница.\nЗа домашен режим, погледнете го менито Параметри."];	
var switchSourceRemind = "се внесе. Сакате да се префрлите?";	
var footballModeName = "Спортски режим";	
var resetStadium = "Стадион";	
var atvSearchMenu = "ATV рачно пребарување";	
var dtvSearchMenu = "Dtv рачно пребарување";	
var settingNoticeSourceName = "Автоматски извор";	
var smartTVOptions = ["Портал на паметен ТВ-уред","HbbTV","Сподели & Види","WiFi приказ","Политика на паметен ТВ-уред",                            "Вмрежување во мирување","Ресетирајте паметен ТВ-уред"];	
var supportOptions = ["Далечинска дијагноза","Контактирајте со нас"];	
var tvDoctor = ["Далечинска дијагноза 2.0","Апликацијата е достапна само за да може вашиот паметен ТВ-уред да врши дијагностика и да го подобри искуството со производот. Податоците за работата на ТВ-уредот и информациите на модел што ќе се собираат од оваа апликација и ќе се префрлаат на сервер, ќе се користат за решавање на проблемот. Нема да се врши пристап во вашите лични информации. Осигурете се дека вашиот ТВ-уред е правилно поврзан со интернет.","Локална дијагноза","Следете ги упатствата на персоналот за поддршка штом почне дијагнозата.","Далечинска дијагноза","Осигурете се дека персоналот за поддршка е онлајн.","Сериски број:","&nbsp;&nbsp;&nbsp;&nbsp;Корисничко ИД:","Се врши поврзување...","Поврзан, продолжете со мрежното поврзување.","Пристапот на интернет не беше можен, \nВе молиме проверете ја мрежната врска.","Излезете"];	
var ClosedcaptionName = "Скриен титл";	
var sysCCOptions = ["Режим на СТ","Аналоген СТ","Дигитален СТ","Еден на друг","Скриен титл"];	
var sysCCmodeOption = ["Исклучено", "Вклучено", "Вклучен кога нема звук"];	
var sysanalogCCOption = ["Исклучено", "СТ1", "CТ2", "CТ3", "CТ4", "Текст1", "Текст2", "Текст3", "Текст4"];	
var sysdigitalCCOption = ["Исклучено", "Сервис 1", "Сервис 2", "Сервис 3", "Сервис 4", "Сервис 5", "Сервис 6", "Сервис 7", "Сервис 8"];	
var syssuperimposeOption = ["Исклучено", "Сервис 1", "Сервис 2", "Сервис 3", "Сервис 4", "Сервис 5", "Сервис 6", "Сервис 7", "Сервис 8"];	
var sysCCOPtionItems = ["*","*","*","*","*","*","*","*","*","*"];	
var sysCCOtionMode = ["Приспособено","*"];	
var sysCCOptionFontStyle = ["*","*","*","*","*","*","*","*"];	
var sysCCOptionFontSize = ["*","*","*","Нормално"];	
var sysCCOptionFontEdgeStyle = ["*","Ниедно","*","*","*","*"];	
var sysCCOptionFontColor = ["*","*","*","Црвено","Зелено","Сино","Жолта","Пурпурна","Тиркизна"];	
var sysCCOptionFontOpacity = ["*","*","Трепкање","*","*"];	
var contactUsOption = ["Контактирајте со нас",    "Ако имате проблеми со ракувањето со овој производ, ве молиме контактирајте со нас.",    "Контактирате со нас",    "Интернет-страница: Посетете ја",    "Број на Повикувачки центар:","Информации за производ","Име на модел:",    "Верзија на софтвер:","*","Корисничко ИД:","ИД на проект:",    "Тип на клиент:","Безжична MAC-адреса:","Физичка MAC-адреса:","ESN на Netflix:","Скенирајте ја информација на вашиот мобилен телефон.",    "потоа изберете ја вашата земја."];
var homePageWords = ["Историја", "Пребарајте"];	
var titlePageWords = ["Дом", "ВИДЕО-ЗАПИСИ","ТВ","АПЛИКАЦИИ"];	
var videosPageWords = ["Филм", "Спорт","Музика","Популарно","Игра","Образование","Новини"];	
var statusPageWords = ["USB","Параметри","WiFi","Жичен"];	
var searchPageWords = ["Пребарајте", "Популарни пребарувања:","Шоу, филмови, луѓе..."];	
var resultSearchPageWords = ["Резултати за"," ","Обидете се со други клучни зборови.","жалиме, не беше најден видео-запис за"," "];	
var historyPageWords = ["Историја", "Притиснете","да избрише историја","Избришете едно","Избришете сѐ","Вчера","Денес","Сѐ уште не сте гледале видео-запис.","Бришењето на историја на гледано беше успешно!"];	
var channelPageWords = ["Жалиме, сѐ уште нема видео-запис."];	
var virtualRemoteValues = ["1","2","3","4","5","6","7","8","9",                          "Зум-","0","Зум+",                          "Излезете","0","*",                          "Список","0","Текст",                          "Упатство","Влез","Излезете",                          "Мени","Поднаслов","Информации",                          "Прекинете",                          "Информации","Мени","Излезете",                          "Излезете"                          ];	
var sportsModeInitReminds = ["Овој волшебник се користи за поставување на USB-меморијата за спортски режим. Изберете го режимот за поставување.", 
							 "Изберете ја големината на датотека за спортски режим.", 
							 "Создавање на датотека за спортски режим", 
							 "USB-меморијата има многу мала брзина (< %f MB/sec) за функцијата спортски режим!", 
							 "USB-меморијата е подготвена за спортски режим. Но, препорачуваме да ја измените (на брзина >%f MB/sec) за подобра изведба.", 
							 "USB-меморијата е подготвена за спортски режим."];	
var sportsModeExtra = ["Сакате да го прекинете спортскиот режим и да смените канал?",
						"Сакате да го прекинете спортскиот режим и да го смените изворот во уред поврзан со SCART влез?",
						"Сакате да го прекинете спортскиот режим и да го смените изворот во уред поврзан HDMI влез?",
						"Спортскиот режим не е поддржан на кодиран канал.",
						"Сакате да го прекинете спортскиот режим и да влезете во Електронскиот водич низ програми (EPG)?",
						"Сакате да го прекинете спортскиот режим и да влезете во медиуми?",
						"Сакате да го прекинете спортскиот режим и да го измените влезниот извор?",
						"ТВ-уредот ќе го заврши тековниот спортски режим. Сакате да излезете?"];	
var remoteControlNote = "*";	


var textArray = ["Јачина на звук","Канал","Извор","Switch/Power","Упатство","seconds to Power OFF"];
var guideArray = ["VOL-","VOL+","CH-","CH+","Pre","Следно"];
var favChannelListRemind = ["Нема омилени канали. Одете до другите списоци и додавајте омилени канали со помош на „Зеленото копче“."];

var proxySetting = ["Параметри на прокси","Порта"];
var powerOffShop = ["Ви препорачуваме да го користите режимот на пазарење. Продолжете?"];
var tcastTextPageWords = ["Plenty of videos, rich applications","TV remote, right at your fingertips","Great contents, share on a large screen"];
var tcastOtherWords = ["Scan QR code and download T-Cast","Network connected to TV","TV name","T-Cast"];
var hbbtvWords = ["HbbTV Setting","HbbTV","Cookies","Thrid Party Cookies","Device ID","Tracking"];
var hbbtvTrackingWords = ["YES","NO","Don't care"];
var eStickerTipWords = ["Просторот за складирање е под 500 MБ, дали сакате да ги избришете видеата во демо-режим за да добиете повеќе простор?"];
var delEstickerVideoRemid = ["Видеото е успешно избришано"];
var selectSatRemind = "You can select no more than 20 satellites!";