
var all_country 	= ["Австралия","Австрия","Белгия","България","Хърватия","Република Чехия","Дания","Финландия","Франция","Германия",
						"Гърция","Унгария","Италия","Люксембург","Холандия","Норвегия","Полша","Португалия","Румъния","Русия",
						"Сърбия","Словения","Испания","Швеция","Швейцария","Обединено кралство","Нова Зеландия"," "/*Arab*/,"Естония"," "/*Hebrew*/,
						"Латвия","Словакия","Турция","Ирландия","Japan","Филипини","Thailand","Maldives","Uruguay","Peru",
    					"Argentina","Chile","Venezuela","Ecuador","Costa Rica","Paraguay","Bolivia","Belize","Nicaragua","Guatemala",
						"Китай","Taiwan","Brazil","Canada","Mexico","United States","South Korea","Romania","Vietnam"/*新添加的，底层结构体中没有*/,"Украйна"/*新添加的，底层结构体中没有*/,
    					"Iran","Iraq"," ","Kazakhstan","Uzbekistan"," ","Kyrgyzstan","Algeria","Egypt","Tunisia",
    					"Tanzania","Kenya","Pakistan","Indonesia","Kuwait","Saudi Arabia","Qatar","Israel","Lebanon","bahrain",
    					"Angola","Congo","India","Turkmenistan","Colombia","Mongolia","Bangladesh","Nepal","Sri Lanka","North Korea",
						"Молдова","Polynesia","EI Salvador"," ","Fiji","Liberia","Jordan","Myanmar","Ghana","Georgia",
    					"Armenia","Oman","yemen","Syria","Palestine","Afghanistan","Morocco","benin","IvoryCoast","Nigeria",
    					"Sudan","Ethiopia","Zambia"," ","South Africa","mozambique","Libya","Албания","Belarus","Iceland",
						"Литва","Mauritius","Dubai","UAE","Tajikistan","Bengal","Босна и Херцеговина","Кипър","Косово","Македония",
						"Малта","Монтенегро","Cameroun","Singapore","Malaysia","NewCaledonia","Suriname","Jamaica","Curacao","Aruba",
    					"Antigua & Barbuda","St Lucia","Barbados","St Vincent","St Kitts & Nevis","Grenada","Trinidad & Tobago","Guyana","Puerto Rico","Panama",
    					"Dominica","Cuba","Honduras","Haiti","Cambodia","Zimbabwe","Dominican Republic","Bonaire","Somalia","Azerbaijan",
    					"Uganda","Rwanda","Guinea","Burundi","Abkhazia","Andorra","Anguilla","Antarctica","American Samoa","Aland Island",
    					"Burkina-faso","Bermuda","Brunei","Caribbean Netherlands","Saint Barthélemy","Bahamas","Bhutan","Bouvet Island","Botswana","Cocos (Keeling) Islands",
    					"Central African Republic","Cape Verde","Djibouti","Eritrea","Western Sahara","Falkland Islands","Federated States of Micronesia","Faroe Islands","Gabon","Cook Islands",
    					"Gibraltar","Greenland","French Guiana","Guadeloupe","Equatorial Guinea","Guam","Guinea-Bissau","Heard Island and McDonald Islands","Isle of Man","British Indian Ocean Territory",
					/*20*/"Jersey","Kiribati","Comoros","Cayman Islands","Liechtenstein","Lesotho","Monaco","Saint Barthélemy","Madagascar","Mali",
    					"Macao","Martinique","Mauritania","Montserrat","Malawi","Namibia","Niger","Norfolk Island","Nauru","Papua New Guinea",
    					"Pitcairn Islands","Palau","Reunion Island","Solomon Islands","Seychelles","The Svalbard archipelago","Sierra Leone","San Marino","Senegal","South Sudan",
    					"Sao Tome & Principe","Swaziland","Turks & Caicos Islands","Togo","Chad","Tokelau","Timor-Leste (East Timor)","Tonga","Tuvalu","Vatican City State",
    					"British Virgin Islands","United States Virgin Islands","Wallis and Futuna","Samoa","Mayotte","Democratic Republic of the Congo","Guernsey","Gambia","Northern Mariana Islands","French Southern Territories",
					/*25*/"Niue","United States Minor Outlying Islands","Others"];
				
var all_language 	= ["Чешки","*","Датски","*","*","Немски","Английски","Френски","Гръцки","Испански",
						"Хърватски","*","Италиански","Унгарски","Нидерландски","Норвежки","Полски","Португалски","Руски","Румънски",
						"Словенски","Сръбски","Финландски","Шведски","Български","Словашки","Chinese","*","Ирландски","*",
						"Уелски","Арабски","Irlandés","Латвийски","*","Турски","Естонски","Нидерландски"/*Netherlands*/,"Корейски","*",
						"хинди","*","*","Мандарин","Кантон","маори","Волапюк"/*Qaa*/,"Неопределен"/*Undetermined*/,"*","Неидентифициран",
						"Неопределен","*","*","*","*","*","*","*","*","*",
						"*","*","*","Албански","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","Баски","*","*",
						"*","*","*","*","*","*","*","Босненски","*","*",
						"*","*","*","*","Bjeloruski","*","*","Каталонски","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Галицийски","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Исландски","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","японски","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Литовски",
						"*","*","*","*","*","*","*","Македонски","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Романтика","*","*","*","*",
						"*","*","*","Сами","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Телетекст",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","Украински","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","ChineseTraditional","*"];
var offOn			= ["Изкл.","Вкл."];
var okCancel		= ["ОК","Отказ"];
var yesNo			= ["ДА","НЕ"];
var level			= ["Изкл.","Нисък","Високо","Среден"];
var manualAuto		= ["Ръчно","Автоматично"];
var homeShop		= ["У дома","В магазин"];
var picPreset		= ["Cтандарт","Динамичният","Естествен","Кино","Лични данни"];
var picColorTemp	= ["Студен","Нормален","Топъл","Потребител"];
var pic3dNavig		= ["Ръчно","Автоматично","Полуавт."];
var _3dOptions		= ["3D режим","3D-към-2D","L-R бутон","Дълбочина на рязкост"];
var pic3DMode       = ["Изкл.","2D-към-3D","Един до друг","Горе и долу","Паралелна работа"];
var picEcoOptions	= ["Енергоспестяване","Светлинен сензор","Затъмнение на място","Смесено затъмняване"];
var picGeoOptions	= ["Геометрия","Хориз. позиц.","Вертикална позиция","Честота","Фаза"];//Geometry 无翻译
var picAdWhiteBal	= ["Рег. червено","Рег. зелено","Рег. синьо","Увел. червено","Увел. зелено ","Увел. синьо  "];
var souOptions		= ["Предварително зададен звук","Баланс","Закъснение на звука","SRS TSHD","Авт. сила на зв.",
						"SPDIF тип","Закъснение на SPDIF","Разполагане на телевизора","Език на звука","Звуков канал",
						"Звуково описание","Усилване на басите","Dolby Digital Plus"];
var souSpdifType	= ["Автоматично"/*Dolby*/,"PCM","Изкл."];
var colorSpace      = ["Автоматично","Местен","Потребител"];
var souPresetPara	= ["100Hz","500Hz","1.5KHz","5KHz","10KHz"];
var chOptions		= ["Сканиране на канали","Списък на каналите","EPG","Организатор на канали","Диагностика на каналите",
						"времеотместване","Субтитри","Телетекст","Тип на списъка с канали"];//Channel diagnostics 、Channel organizer 无翻译
var chDiagOptions	= ["Сила на сигнала","Качество на сигнала","Честота (KHz)","Ид. номер обслужване","Ид.код на мрежа","Име на мрежата"];
var chScanOptions	= ["Страна / Регион","Режим на тунер","Автоматично търсене","Автоматично актуализиране","Ръчно скан. аналог. ",
						["Ръчно сканиране на мрежа","Ръчно сканиране с антена","Ръчна настройка на сателит"],"Настройване на сателитна антена","Избор на предпочитана мрежа","Изтриване на списъка с каналите","LCN"];
var favNetDes		= "Моля изберете своята любима мрежа.";
var tuner			= ["Кабел","Aнтена","Сателит"];//Satelite 无翻译
var passError		= "Грешна парола.\nОпитайте отново!";
var chType			= ["Аналогови канали: ","Цифрови канали: "];
var chScanStatus	= ["Състояние: Сканиране","Състояние: Сканирането приключи","Състояние: Отмяна на сканирането","Състояние: Грешка при сканиране"];
var chScanPara		= ["Честота (KHz)","Модулация","Скорост:символи (Ksym/s)","Ид.код на мрежа","Система",
						"Фина настройка","Сила на сигнала","Качество на сигнала","Режим на сканиране","Идентификационен номер на каналите"];
var chScanParaMHZ      = ["Честота (MHz)"];
var chAtvManSys		= ["ЗАПАДНА ЕВРОПА","ИЗТОЧНА ЕВРОПА","Обединеното кралство","Франция"];
var modulation		= ["16QAM","32QAM","64QAM","128QAM","256QAM","Автоматично"];
var chCleanDes		= "Желаете ли да изчистите списъка с канали?";
var chDeletDes		= "Желаете ли да изтриете канала?";
var chOperator		= ["Ziggo","UPC","Други"];
var chScanType		= ["Цифрови & Аналогов","Цифрови","Аналогови"];
var chScanMode		= ["Пълно","Напред","Бърз"];
var bookingModes	= ["Запис","Напомняне"];
var dayName			= ["Нд","Пн","Вт","Ср","Чт","Пт","Сб"];
var monthName		= ["ян.", "февр.","март","апр.","май","юни","юли","авг.","септ.","окт.","ноем.","дек."];
var filter			= ["Филтър","Тип","Подвид"];
var chEpgFirstGenre	= ["Кино","Новини","Шоу","Спорт","За децата","Музика","Изкуство","Социални","Образование","Отдих","СПЕЦИАЛНИ"];
var chEpgSecondGenre= [["Драма","Криминални","Приключенски","Научна фантастика","Комедия","Сапунен сериал","Романтика","Сериозни","Филм за възрастни"," "," "," "],
						["Новини","Прогноза за времето","Новинарско предаване","Документален филм","Дискусия"," "," "," "," "," "," "," "],
						["Шоу","Игра","Естрадна програма","Беседа с гост"," "," "," "," "," "," "," "," "],
						["Спорт","Специални събития","Спортни предавания","Футбол","Тенис",
							"Отборни спортове","Атлетика","Моторни спортове","Водни спортове","Зимни спортове",
							"Конни спортове","Бойни изкуства"],
						["За децата","За деца в предучилищна възраст","Забавна програма за деца от 6 до 14","Забавна програма за деца от 10 до 16","Информационна програма","Анимация"," "," "," "," "," "," "," "],
						["Музика","Рок","Сериозни","Фолк","Джаз","Мюзикъл","Балет"," "," "," "," "," "],
						["Изкуство","Сценични изкуства","Изящни изкуства","Религия","Популярна култура",
							"Литература","Филм","Експериментални","Радиопредаване","Нови медии",
							"Предавания за изкуство","Мода"],
						["Социални","Магазинни предавания ","Икономика","Забележителни личности"," "," "," "," "," "," "," "," "],
						["Образование","Природа","Технология","Медицина","Чужди страни","Социални науки","Допълнително образование","Езици"," "," "," "," "],
						["Свободно време и хоби","Туризъм","Занаяти","Автомобилизъм","Фитнес и здраве","Готварство","Реклами","Градинарство"," "," "," "," "],
						["Оригинален език","Чернобял","Непубликувани","Излъчване на живо"," "," "," "," "," "," "," "," "]];
var chOrganizer		= ["Преск. канал","Сортиране канали","Редактиране канали","Закъснение канал","канал суап","канал вложка"];
var chEditPara 		= ["Име на мрежата","Номер на канала","Име на канала","Честота","Система за цветовете","Звукова система"];
var chSatTitles		= ["Тип на сателита","Настройване на сателитна антена","Избор на сателит"];
var chSatEidtOptions= ["Име на сателит","Позиция","LNB мощност","LNB честота (MHz)","Вход от DISEQC",
						"Тон 22KHz","пакетен тон","Честота (KHz)","Скорост:символи (Ksym/s)","Поляризация",
						"Сила на сигнала","Качество на сигнала","Състояние на сателита"];
var chSatAutoPromt	= [["Всички","Мрежа"],
						["Всички","Безплатен"]];
var chSatAutoScanOptions=["Избор на сателит","Режим на сканиране","Канали"];
var chSatPosition	= ["A","B"];
var chSatLNBFreq	= ["Универсален",];
var chSatDiSEqCInput= ["Деактивиране","A","B","C","D"];
var chSatTone22KHz	= ["Автоматично","Вкл.","Изкл."];
var chSatToneBurst	= ["Деактивиране","пакетен тон A","пакетен тон B"];
var chSatPolarization= ["Хоризонтала","Вертикала"];
var chSatSetupOptions=["Тип на антената","Тунер","Честота на лентата"];
var chSatAntennaType= ["Сигнален кабел","Универсален"];
var chSatUserBands	= ["Потр. лента 1","Потр. лента 2","Потр. лента 3","Потр. лента 4","Потр. лента 5","Потр. лента 6 ","Потр. лента 7","Потр. Лента 8"];
var chSatOthers		= ["Транспондер"];
var chSatSetupOthers= ["Дефиниран от потребителя"];
var pleaseSelectSat = "Моля първо изберете сателити.";
var subOptions		= ["Субтитри","Език на субтитрите","Език на субтитрите 2-ри","Вид субтитри"];
var ttxOptionsCon      = ["Декод. ез. на стр.","Език на телетекста"];
var subType			= ["Нормален","Хора с увр. слух"];
var netIntf     	= ["Ethernet","Безжични"];
var netConnDes		= ["ТВ тества мрежовата връзка.\nМоля, изчакайте",
						"Успешен тест на мрежова връзка",
						"Неуспешен тест на мрежовата връзка!"];
var netSsidError	= "Валидната дължина на SSID e от 1 до 32 символа. Моля проверете SSID.";
var netOthers		= ["PIN код "];
var netWlessAutoDes	= ["Преди да натиснете ОК се уверете, че следният PIN код е въведен в точката за достъп.",
						"Натиснете бутона на точката за достъп в рамките на 120 секунди преди да натиснете ОК."];
var netConnRemind	= ["Грешна парола!",
						"Свързване. Моля изчакайте.",
						"Успешно свързване и получаване на IP!",
						"Отказ на връзката",
						"ТВ сканира АР\nМоля, изчакайте",
						"Към TV няма свързано безжично устройство"];
var netWireIpOptions= ["Настройка на IP","Тип на адреса","IP адрес","Маска на подмрежата","Стандартен шлюз","Първичен DNS","Вторичен DNS"];
var netWireConnRemind= ["Въведете стойност между 0 и 255.",
						"Свързването премина успешно.",
						"Моля въведете валиден адрес.",
						"Свързването премина успешно.",
						"Неуспешно свързване!",
						"Свързване. Моля изчакайте.",
						"Моля въведете стойност между 1 и 223."];
var netFlixOptions	= ["Деактивиране","ESN","Версия на Netflix"];
var netFlixDes	 	= ["Сигурни ли сте, че желаете да деактивирате?"," "/*Are you sure that you want to ESN?*/];
var netUpdateTitle 	= "Актуализиране софтуер";
var netUpdateDialogTitle = "Актуализация на софтуера";
var netBGDownloadTitle 	= "Изтегляне";
var netUpdateLoadingPrompt= ["Търсене на надстройка, моля изчакайте.",
							"Софтуерът се изтегля... Моля изчакайте.",
							"Моля НЕ изключвайте ТВ по време на надграждане на софтуера!",
                            "Задължителната актуализация на софтуера е изтеглена автоматично във фонов режим."];
var netUpdatePrompt= ["Поздравления! Разполагате с най-новата софтуерна версия!",
						"Намерена е нова софтуерна версия XXXX. Искате ли да изтеглите сега? Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Неуспешно влизане!",
						"Данните не могат да бъдат получени. Моля опитайте по-късно.",
						"Отказ на актуализиране на обработващ XML!",
						"Отказ на връзката",
						"Успешно изтегляне на софтуера. Искате ли да започнете зареждане?",
						"Загуба на данни. Невъзможно изтегляне!",
						"Отказ за проверка на пакета, опитайте отново!",
						"Мрежата не работи правилно. Моля, проверете и се свържете отново…",
						"Отказ при актуализиране. Моля, рестартирайте ТВ!",
						"Неочаквано изтриване на файла за надграждане. Направете отново актуализиране от мрежата.",
						"Успешно изтегляне на софтуера във фонов режим.Желаете ли да надградите?"];
var netUpdateButtonText = ["Изтегляне", "Актуализиране", "По-късно", "Никога", "ОК","Продължение"];
var autoDetectPrompt = ["Намерена е нова софтуерна версия XXXX. Искате ли да изтеглите сега? Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Намерен е нов софтуер с версия XXXX. Желаете ли да се актуализирате сега?",
						"Процесът на актуализиране от мрежата е прекъснат последния път. Трябда ва актуализирате отново.",
                        "Изтеглянето на новата версия ХХХХ на софтуера не е завършено. Желаете ли да продължите сега?",
                        "Софтуерът беше изтеглен, желаете ли да изпълните актуализация сега?"];
var sysOptions		= ["Е-наръчник","Език екр. меню","Настройка на часа","Заключен","Входни настройки",
						"Актуализиране софтуер","Местоположение","Режим HbbTV","Бисквитки","Общ интерфейс",
						"Разширени настройки","Възстановяване фабрични настройки","Светлинен индикатор","Незабавно включване","Автоматичен режим на магазин","Area","Демонстрационен режим"];
var sysResetDes		= "Сигурни ли сте?";
var sysMenuLangOptions=["Език","Предпочитан език на звука","Предпочитан  2-ри език "];
var sysTimerOptions	= ["Часова зона","Име на регион","Честота","Таймер за заспиване","Автоготовност", "Country region"];

var sysTimeZone		= ["Радиопредавател","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00",
						"GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30",
						"GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00",
						"GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00",
						"GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00",
						"GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00",
						"GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];
var sysSleepTimer	= ["Изкл.","10 мин.","20 мин.","30 мин.","40 мин.","50 мин.","60 мин.","90 мин.","120 мин."];
var sysStandby		= ["Изкл.","4 часа","6 часа","8 часа"];
var sysRegionName	= ["Мадрид","Канарски острови"];
var sysClockOptions	= ["Авто синхрон","Дата","Време","Вкл. таймер","Настройка на часа",
						"Канал при включване","Изкл. таймер ","Настройка на часа"];
var sysTimer		= ["Изкл.","Ежедневно","Еднократно"];

var sysInputSet		= ["Няма етикет","DVD","Blu-ray диск","HDD","DVDR",
						"HD запис (HD rec.)","Игра","Видео","Персонален компютър","Цифров приемник",
						"HD цифров приемник","Камера","Записващо устройство","Друго"];
var sysAvVideoInput	= ["Автоматично","RGB_CVBS","RGB","CVBS","S-Video"];
var sysUpdate		= ["Чрез USB","Ид.код на мрежа","По канали"];
var sysUpdateDes	= [" ",
						" ",
						" ",
						"Не може да се намери нов софтуер в ефир!",
						"Намерен е нов софтуер с версия XXXX. Желаете ли да се актуализирате сега?",
						"Моля поставете USB устройство.",
						"Отказ за проверка на пакета, опитайте отново!",
						"НЕ изключвайте USB и телевизора по време на софтуерна актуализация!!",
						"Софтуерът беше актуализиран успешно.\nТелевизорът ще се рестартира автоматично.",
						"Намерена е нова софтуерна версия XXXX. Искате ли да изтеглите сега? Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Изтегляне",
						"Успешно изтегляне на софтуера. Искате ли да започнете зареждане?",
						"Неуспех актуал!",
						"Търсене на файлове за надграждане",
						"Успешно надграждане на софтуера.\nРестартирайте ТВ."];
var sysProductInfo	= ["Текуща версия","Име на продукт","Име на производителя","Име на шасито"];
var sysCiDes		= ["Няма CI карта."];
var sysAdOptions	= ["Регистриране на DivX(R)","Дерегистрация на DivX(R)","T-Link","Authorization Error","Потвърждение за отмяна на регистрирането",
						"Потвърждение за наемане","Изтичане срок наем"];
var sysRegistDes	= ["За да гледате защитено от DivX видео, е необходимо да регистрирате устройството.",
						"Регистрационен код:",
						"Регистрирайте на http://vod.divx.com"];
var sysDregistDes	= ["Код за дерегистриране:",
						"Можете да дерегистрирате на http://vod.divx.com",
						"Ще продължите ли с регистрацията?"];
var mediaAuthorization = ["Устройството няма пълномощия да възпроизведе този защитен от DivX(R) видеоклип."];
var deregistrationConfrimation = ["Устройството вече е регистрирано.","Сигурни ли сте, че желаете отмяна на регистрацията?"];
var rentalConfirmation = "Наемането на DivX(R) е използвало XXXX от YYYY прегледа. Продължение?";
var rentalExpired 	= "На DivX(R) rental са извършени ХХХХ от YYYY гледания. DivX rental е с изтекъл срок.";
var parentalRatingNA		= ["***","***","***","***","***","***","***","***"];
var parentalRatingOptionUS		= ["***","***","***"];
var sysTVRatingUS=["***","***","***","***","***"];
var sysMPAAUS=["***","***","***","***","***","***"];
var parentalRatingOptionCanada		= ["***","***","***"];
var sysCanadaEng=["***","***","***","***","***","***"];
var sysCanadaFre=["***","***","***","***","***",""];
var sysResetRRT=["***"];
						
var sysLockOptions	= ["Каналът е блокиран","Времеви интервал за закл.","Блокир. прогр.","Блокиран вх. сигнал","Заключване на преден панел","Инсталиране на заключване",
						"Пром. Парола","Максимална сила на звука","Изчистване на всички"];
var sysTimeIntervals= ["Тип заключване","Стартово време","Време на спиране"];
var sysRatingOptions= ["Няма","4","5","6","7","8","9","10","11","12",
						"13","14","15","16","17","18","Програма, подходяща единствено за възрастни (Испания)"];
var changePass		= ["Пром. Парола","Нова парола","Потв. Парола"];
var changePassDes	= ["Грешна парола.\nОпитайте отново!",
						"Паролата не е същата.\nМоля, опитайте отново!",
						"Успешно установяване парола!",
						"Този код е твърде елементарен, за да се зададе като парола.\nМоля, въведете отново!"];
var sysPowerOnChOptions= "Режим на избор";
var sysPowerOnCh	= ["Последно състояние","Избор от потребителя"];
var netWlessSecu    = ["Отвори","WEP","WPA/WPA2-PSK "];
var netWlessSecu2	= ["Няма","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK ","Не се поддържа"];
var netWlessSecu3	= ["Няма","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)","Не се поддържа"];
var netOptions		= ["Интернет връзка","интерфейс","Безжични настройки","IP настройки","информация",
						"Тест на връзката","DLNA","TV romote","Настройки за Netflix","Отчитане на WiFi",
						"Тип на адреса","IP адрес","Маска на подмрежата","Стандартен шлюз","Първичен DNS",
						"Вторичен DNS","SSID","BSSID","Въведете SSID:","Потребителско име"];
var chEditDes		= ["Дублиран номер на канал!","Натиснете червения бутон за изтриване на текущия знак.","Невалиден номер на канала."];
var chEpgNoProgram	= "В момента няма информация за програми, моля потърсете канали.";
var chEpgWords		= ["Напътствия за програми","Няма данни за програмата.","Каналът е заключен!","Няма подробности за програмата.","Програмата няма заглавие."];
var chEpgBooking	= ["График за информация", "Номер на канала","Начална дата","Стартово време","Време на спиране",
						"Тип на повторение","Тип на графиците","Добавяне","Заменяне","Промяна",
						"Добави/промени"];
var epgHotKey		= ["Предишния ден","Следващия ден","Филтър","Запланувани записи","Добавяне на план"];
var chEpgBookRemind	= ["Неправилно време за начало","Неправилно време за край","Дублиран график","Успешен запис","Изтриването беше успешно."];
var chSchePara		= ["Запланувани записи","Стартово време","Начална дата","Заглавие на програма","Име на канала",
						"Продължителност","Повторение","График","Редактиране","Изтриване"];
var dateTimer		= ["Еднократно","Ежедневно","Седмично"];
var scheduleDeleteReminds="Желаете ли да изтриете този график?";
var scheduleNoLists	= "Няма наличен списък с графици. Натиснете червения бутон, за да добавите такъв.";
var chListWords		= ["Списък на каналите","Списък за избор","Режим на тунер","Добави към предпочитани","Премахване",
						"Избран списък с канали","Изберете режим на настройка","Обмен"];
var chListType		= ["Всички","Цифрови","Аналогови","Радио","Безплатен","Предпочитани"];
var chAutoScanOptions=["Избор на оператор","канал тип","Автоматично търсене"];
var souSoundType	= ["Невалиден","Моно","Моно","Стерео","Стерео",
						"SAP","SAP","Dual1","Dual2","Dual2",
						"Nicam моно","Nicam стерео","Nicam двоен1","Nicam двоен2","Nicam двучестотно",
						"Моно","LL","RR","LR"];
var souPreset		= ["Музика","Кино","Ясен глас","Cтандарт","Лични данни"];
var picAdRgbMode	= ["Изкл.","Само червено","Само зелено","Само синьо"];
var picAdOptions	= ["Намаляване на шума","MPEG NR филтър","RGB mode","Динамичният контраст","LED яснота на движението",
						"Тон на кожата","Режим на филм ","Режим на игри","Цветова температура","баланс на бялото",
						"Замръзяване","Черно Stretch","Сканиране нагоре","Гама","Режим HDMI","10 позиции баланс на бялото","Обогатяване на цветовете",
						"Намаляване на размазването","Намаляване на трептенето","Цветово пространство","Яснота на движенията"];
var pic10Pwhite     = ["Интервал","Червено","Зелено","Синьо","Възстановяване","Цвят","Жълто","Циан","Магента"];
var picMotionClarity = ["Режим Движение","Интерполация на движението","LED яснота на движението","Намаляване на размазването","Намаляване на трептенето","Възстановяване"];
var picMotionMode   = ["Филм","Меко","Изтриване","Спорт","Клиентски"];
var picResetDes		= "Всички персонални настройки ще бъдат върнати към фабричния им вид. Сигурни ли сте, че искате да изпълните избраното действие?";
var pic10PReset     = "Сигурни ли сте, че искате да върнете белият 10Р баланс към фабрично зададената му стойност?";
var picMotionReset  = "Желаете ли да върнете яснотата на движение към фабрично зададената й стойност?";
var picColorSpaceReset    = "Сигурни ли сте, че искате да върнете цветовото пространство към фабрично зададения му вид?";
var picOptions		= ["Предв. настройка на образа",
						"Подсвека","Яркост","Контраст","Наситеност","Цветови тон","Острота","Цветова температура","Режим на екрана:","Автоматичен формат",
						"Подобряване на картината за спорт","3D","3D навигация","ECO Настройки","Геометрия",
						"Разширени настройки","Възстановяване на началните настройки на картината","Микро затъмняване"];
var picSize			= ["Формат 16:9", "формат 4:3", "Формат 14:9", "Bredbild",
						"16:9 zoom", "16:9 zooma upp","14:9 zoom","Utsträckt zoom","Bredzoom",
						"Zoom 2","Bredzoom 2","Автоматично нагласяне на размера на картината","Punkt för punkt","Оригинал","Панорама"];
var others			= ["Сила на звука","Излъчващ","Парола","Състояние","Запис","Заменяне","Стартиране","Изход","Търсене","Изтриване",
						"Няма","Автоматично","Сканиране","Защита","Свързване","Опресняване","Опитай пак","Cтоп","Настройки","Канали",
						"Редактиране","Постави","Cигнал!","Край","Стерео","Аудио","Източник","Няма звук","Съвети","Възстановяване",
						"Клиентски","Настройка","Запазване","Потребителски","Затваряне на клавиатурата","Режим за сигурност","Ежедневно","PVR списък"];
var direction		= ["Ляв","Десен","Нагоре","Надолу"];
var audioType 		= ["MPEG","DOLBY AUDIO"/*"AC3"*/,"MPEG4","AAC", "DOLBY AUDIO"/*"AC3P"*/,
						"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD",
						" "," "," "," "," ",
						" ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2",
						"HE-AAC_V4","Неидентифициран"];
var soundChannels   = ["Неидентифициран","Моно","Второстепенен","Двойно моно","Стерео","Стерео съб","Стерео Dolby съраунд","Surround 2CH","Surround звук","3.0Ch","4.0Ch","5.0Ch","Моно Lfe","Двучестотен моно Lfe","Стерео Lfe","Съраунд 2Ch Lfe","Съраунд Lfe","3.1Ch","4.1Ch","5.1CH","7.1CH","Обединено стерео","Fmrdo моно","Fmrdo стерео","Fm моно Nicam моно","Fm моно Nicam стерео","Fm моно Nicam двучестотно","Ляв","Десен","Други"];
var prompts			= ["Регулирайте настройките на картината, така че да отговаря най-добре на средата Ви на гледане.",
						"Регулиране на нивата на яркост. Колкото стойността е по-близка до 100, толкова по-ярка е картината.",
						"Регулиране на нивата на контраст. Колкото стойността е по-близка до 100, толкова по-големи са тъмно-светлите разлики.",
						"Регулиране на нивата на наситеност. Колкото стойността е по-близка до 100, толкова по-силни са цветовете.",
						"Регулиране на нивата на острота. Колкото стойността е по-близка до 100, толкова по-ясни са детайлите.",
						"Регулиране на нивата на фоново осветление. Колкото стойността е по-близка до 100, толкова по-ярък е екрана.",
						"Регулиране на нюансите. Тази настройка променя цветовите тонове.",
						"Изберете формат на картината, който отговаря най-добре на гледаната програма.",
						"Конфигурирайте настройки за енергоспестяване.",
						"Регулиране на настройките за размер на екрана при свързване с компютър.",
						"Изберете още разширени настройки за картина.",
						"Възстановяване на всички настройки на картината на стандартните.",
						"Изберете режим на звук, който подхожда най-добре на личните ви предпочитания.",
						"Регулирайте баланса на силата на звука между левия и десния канал.",
						"Системата за звуково извличане TruSurround HD Ви предлага богат, наситен и ясен звук във високите и ниските честоти.",
						"Формат за цифров интерфейс за свързване между изхода за цифров звук на телевизора и системата за домашно кино.",
						"Изберете език на аудио според предпочитанията си.",
						"Дава възможност на хората с увредено зрение да се наслаждават на телевизионни програми.",
						"Тест на картината, звука и сигнала на телевизора.",
						"Изберете тип на списъка с канали, който е най-подходящ за телевизионния сигнал.",
						"Избор на език за субтитрите на програмата, които се показват в долната част на екрана.",
						"Преглед на текста и снимките на текущия канал.",
						"Digital Living Network Alliance (DLNA). Наслаждавайте се на музика, снимки и видеоклипове от други устройства, като например компютър, чрез домашна мрежа.",
						"Показване на съдържание от смарт устройства на телевизионния екран. Използване на смартфон като дистанционно управление за телевизора.",
						"Показване на съдържание от Miracast-съвместими Android устройства на телевизионния екран.",
						"Заключете телевизора.",
						"Изберете име за устройството.",
						"Изберете зрителна среда.",
						"Възстановяване на всички системни настройки на стандартните.",
    					"Switch off sports mode for more options.",
    					"Подобряване на контраста с околната среда",
    					"Специален режим, за да се наслаждавате на спортни игри",
    					"Възползвайте се от още CEC функции."];
var initialTitle	= ["Добре дошли","Начални настройки"];
var initialPrompt	= ["Направете първоначалната си настройка сега, очаква Ви един Свят на вълнуващи преживявания!",
						"Моля изберете език:",
						"Изберете вашата страна/регион:",
						"Моля, изберете местоположението си:",
						"Изберете тип на свързване с мрежата:",
						"Изберете режим на свързване с кабелна мрежа:",
						"Свързването към xxxxxxxxx беше неуспешно! Моля свържете устройството съгласно следната диаграма или натиснете стрелка наляво за възстановяване на настройката до заводския й вид.",
						"Свързан към xxxxxxxxx! Моля изберете стрелка надясно, за да продължите.",
						"1) Вашият телевизор може да съдържа вграден безжичен адаптер\n 2)В случай че имате предоставен безжичен USB адаптер, свържете го към телевизора.  След това изберете режим за свързване към безжична мрежа:",
						"Сканиране. Моля изчакайте...",
						"Към TV няма свързано безжично устройство",
						"Моля, преди да натиснете бутона \"Напред\", се уверете, че е инсталиран следния PIN код",
						"Моля натиснете бутона на АР в рамките на 120 секунди, преди да натиснете стрелка надясно.",
						"WPS (Настройка на защитен Wi-Fi )",
						"PIN (персонален идентификационен номер)",
						"PBC (конфигурация Push Button)",
						"Следното съдържание може да бъде достъпно единствено при наличие на мрежова връзка. Желаете ли да прескочите настройката на мрежата?",
						"Има налични нови актуализации на софтуера, които можете да изтеглите. Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Актуализирането на софтуера на телевизора позволява да се възползвате от последните функции и услуги.",
						"Няма да можете да се насладите на най-новите функции и услуги. Желаете ли да прескочите актуализация на софтуера?",
						"Натиснете Десен бутон, за да продължите.",
						"Не изключвайте захранването по време на актуализирането. Възможно е това да причини повреда в телевизора.",
						"Моля натиснете NO, в случай че не желаете да изпълните актуализация.",
						"Актуализиране, моля изчакайте.",
						"Можете да актуализирате софтуера в СИСТЕМНО МЕНЮ / АКТУАЛИЗАЦИЯ НА СОФТУЕРА.",
						"Избраната страна изисква задаване на парола.\nМоля, задайте код за ТВ и го потвърдете.",
						"This code is too simple.\nPlease use different digits.",
						"Поздравления! Първоначалната настройка беше завършена. Можете да промените конфигурацията си чрез главното меню и свързаните с него подменюта.",
						"Изберете режима на защита:",
						"Моля изберете режим за свързване към безжична мрежа:",
						"Мрежа"];
var initNetCabAndDonRe = ["Няма свързан мрежов кабел. Моля свържете такъв!","Няма вграден безжичен адаптер или безжичен USB адаптер."];
var initChPrompt = ["Инсталиране на телевизионни канали","Моля изберете антенно сканиране.","Обработка на автоматичното настройване...","Бяха открити следните антенни канали:","Изберете тип на кабелно сканиране.","Моля изберете оператор от следния списък:","Конфигурирайте информацията за сканиране","Намерени са следните кабелни канали:","Изберете един оператор от следващия списък","Изберете сателити за сканиране или редактиране на избрани сателити","Задайте параметрите на сателитите","Бяха открити следните канали. Сканирането за канали може да бъде изпълнено отново в Канал/Сканиране за канали."];
var initClockPrompt = ["Използване на дата и час, предоставени от мрежата.",
						"Моля задайте дата и час:"];
var initialOptions	= ["Среда","Мрежова настройка","Актуализиране софтуер","Инсталиране на канал","Честота"];
var initialHotkeys	= ["Назад","Избор","Следващ","Приемам"];
var initLocations	= ["У дома","В магазин","Магазин с демо"];
var initNets		= ["Кабелна","Безжични","Нямам мрежова връзка"];
var initWireManuals	= ["IP адрес","Маска на подмрежата","Стандартен шлюз","Първичен DNS","Вторичен DNS"];
var initSoftUpdates = ["Актуализирай сега","Актуализирай по-късно"];
var initChannelIns	= ["Продължение","Не желая да инсталирам канали."];
var initChScanTypes	= ["Цифрови & Аналогов","Цифрови","Аналогови","Не желая да сканирам"];
var initChDvbts		= ["Аналогови антенни канали:","Цифрови антенни канали:"];
var initChDvbcs		= ["Кабелни ATV канали:","Кабелни DTV канали:"];
var initChDvbss		= ["Сателитни канали:"];
var initChDvbSOther	= ["Не желая да сканирам сателити"];
var initEndConnectedStatus= ["Връзката е прекъсната","Свързано към безжична мрежа","Свързано към кабелна мрежа"];
var initEndInstallations= "XXXX канали бяха инсталирани";
var initEndUpdate	= ["Актуализирано"];

var audioScenes 	= ["Монтаж на плот","Монтаж на стена"];			
var screenSavers	= ["Няма канали. Натиснете бутона ОК и сканирайте!",
						"Няма сигнал!",
						"Кодиран",
						"Само данни",
						"Аудио програма",
						"Няма звук и видео",
						"Няма",
						"Няма телетекст",
						"Няма данни за програмата.",
						"Програмата е заключена!",
						"Програмата е заключена!\nНатиснете OK и въведете код.",
						"Няма подробности за програмата.",
						"Програма, неподходяща за деца.\nНатиснете OK и въведете своя код.",
						"Каналът е заключен!",
						"Каналът е заключен!\nНатиснете OK и въведете код.",
						"Входът е заключен!\nНатиснете OK и въведете код.",
						"Не се поддържа!",
						"Тази услуга не е достъпна",
						"Блок въвеждане!",
						"Програмата няма заглавие.",
						"Няма функция",
						"Няма Субтитри"
						];
var channelNumberOverPromt = ["The number of search programs has exceeded,you can delete some programs and then retry!"];
var chBookingPromt	= ["В графика на текущия канал има зададен запис. Телевизорът ще започне да записва.",
						"Намерен е планира запис.\n Превключете на XXXX за запис",
						"За настоящия канал има напомняне.",
						"Намерено е планирано напомняне.\n Превключете на XXXX"];
var timeUnit		= ["Сек.","мин."];
var ciPromt			= ["Данните на мрежата са променени. Изпълнете сканиране за актуализации, за да актуализирате софтуера. ",];
var othersPromt		= ["Моля, изчакайте...",];
var menuOptions		= ["Видео","Звук","Kанал","Smart TV","Мрежа","Система","Поддръжка"];
var optionOptions	= ["Предв. настройка на образа","Предварително зададен звук","Замръзяване","T-Link","времеотместване","PVR","Запланувани записи","Настройки","*"];
var optionTLinkPromt= [["Автоматично включване","Автоготовност","Меню напътствия"],
						["Включване","Готовност","Сила на звука на усилвателя"]];
var powerPromt		= ["Телевизорът скоро ще се изключи! Натиснете произволен бутон за отказ."];
var ttxLanguage		= ["ЗАПАДНА ЕВРОПА","ИЗТОЧНА ЕВРОПА","Руски","Арабски/Иврит","Фарси","Арабски","Bjeloruski","Гръцки","Турски"];
var ttxOptions		= ["Показване","Превключване между подстраници","Език","Предупредителен текст","Кратки новини"];
var weekday         = ["неделя","понеделник","вторник","сряда","четвъртък","петък","събота"];
var lcnConfflict	= "Проблем при приемане на тази програма. Има друга версия на канал %d.";
var inShopMode		= "Вашият телевизор е в режим магазин. За да включите домашен режим, изберете системното меню и променете местоположението в него.";
var nitRefresh		= "Променени данни за мрежата. Искате ли да извършите сканиране за актуализация?";
var picHDMIMode     = ["Автоматично","Графичен","Видео"];

var glassRemind    	= ["Моля сдвоете 3D очилата си с телевизора\n(задръжте бутон POWER на 3D очилата).","3D очилата Ви са свързани към телевизора. ",""];
var pvrRemind 		= ["Не изваждайте USB устройството и не прекъсвайте захранването."];
var pvrConName   	= ["PVR","Информация за програмата:",["Note: If you record the HD channel, please to select  the  disk(of speed >5.0MB/sec), and to select the disk (of speed >3.0MB/sec) when you want to record the SD channel.","Записаното видео е запазено в папка \"PVR\"."],"Cтоп","Запис","час","Минута","Продължителност","Съвети","Използвайте стрелките, за да зададете продължителността на записване."];
var pvrDisRemind 	= "Поставете USB памет за запис.";
var pvrRemindWords  = ["Желаете ли да излезете?",
							"Желаете ли да спрете да записвате и да видите записаните файлове?",
							"Изваден диск",
							"Няма достатъчно свободно място.",
							"Няма записани файлове. Стартиране на запис.",
							"PVR не може да стартира в кодиран канал.",
							"Функцията не се предлага",
							"Успешен запис",
							"Желаете ли да спрете записа и да смените източника на въвеждане?",
							"Телевизорът ще преустанови текущия запис. Желаете ли да излезете?",
							"За записването на PVR е необходим добър телевизионен сигнал, моля проверете сигнала си."];
var pvrChangeCh 	= ["Желаете ли да превключите канала?",
							"Желаете ли да спрете процеса на запис и да въведете ММР?"];
var pvrChangeToPIN8	= ["Желаете ли да замените източника с устройство, свързано към вход SCART?",
				    		"Желаете ли да преустановите процеса на запис и да замените източника с устройство, свързано към вход SCART?"];
var pvrChangeToCEC  = ["Желаете ли да замените източника с устройство, свързано към вход HDMI?",
				  			 "Желаете ли да преустановите процеса на запис и да замените източника с устройство, свързано към вход HDMI?"];
var pvrGuideJump    = ["Желаете ли да влезете в Електронния програмен справочник (EPG)?",
							"Желаете ли да спрете процеса на запис и да въведете ЕPG?"];
var pvrMediaJump    = ["Желаете ли да поставите носител?",
							"Желаете ли да спрете процеса на запис и да въведете Media?"];
var timeshiftExtra	= ["Да спре ли последващия запис и да се смени режима да се смени ли канала?",
						"Желаете ли да прекратите изместването на времето и да замените източника с устройство, свързано към вход SCART?",
						"Желаете ли да прекратите изместването на времето и да замените източника с устройство, свързано към вход HDMI?",
						"Отлагането не може да старитра в кодиран канал.",
						"Желаете ли да прекратите изместването на времето и да влезете в EPG?",
						"Да спре ли последващия запис и да се смени режима от TV на USB ?",
						"Да спре ли последващия запис и да се смени режима да се смени ли входящия източник?",
						"Поставете USB памет за запис.",
						"Дисковото пространство е недостатъчно.",
						"Телевизорът ще преустанови текущото изместване на времето. Желаете ли да излезете?"];
var timeshiftStatus	= ["Бързо превъртане назад","Cтоп","Начало","Пауза","Бързо превъртане напред"];
var pvrPowerOffRemind= ["Готовност за запис","Готовност","В момента телевизорът записва. Желаете ли записът да продължи и при режим на готовност?"];
var timeshiftInitTitle= "Настройка на диска";
var timeshiftInitReminds= ["Менюто се използва за настройка на USB диска за последващ запис. Моля, изберете режим на настройка.",
						 "За по-добро изпълнение препоръчваме форматиране на диска. Това ще изтрие всички данни.",
						 "Моля, изберете размера на файла за запис.",
						 "форматиране",
						 "Няма достатъчно свободно място.",
						 "Създаване на файл за последващ запис",
						 "Тест на скоростта",
						 "Дискът е твърде бавен (< %f MB/sec), за да позволи функцията последващ запис!",
						 "Дискът е готов за последващ запис. Но предлагаме да се смени с диск (със скорост > %f MB/sec) за по-добро изпълнение.",
						 "Дискът е готов за последващ запис. "];
var timeshiftInitButtons= ["Формат","Пропусни","Отказ","ОК","Край","Изход"];
var timeshiftInitOther=["Скорост:","МБ/сек"];

var selectChoice	= "Сигурни ли сте?";
var chAtvStore		= "Съхрани като ХХХХ";
var chEpgFirstGenreUK= ["Кино","Новини и факти","РАЗВЛЕЧЕНИЕ","Спорт","За децата","Образование","Стил на живот","Драма"];
var homePageTitleList = ["ПРИЛОЖЕНИЯ","TV","ВИДЕОКЛИПОВЕ","Начална страница"];
var homePageFavAndAllName  = ["Любими приложения","Всички приложения"];
var homePageBackUp = ["Е-наръчник","GuideOn"];
var homePageRemind   = ["Всички функции са достъпни единствено след свързване към мрежата.","Във Вашия телевизор все още няма запаметени канали. Програмите ще бъдат достъпни след сканиране на каналите.","Няма програма","Търсене на канали сега?"];
var homePageHistory = ["Хронология"];
var miracastTitle = ["Отчитане на WiFi","TCL устройство"];
var miracastRemind=["WiFi TV позволява да споделяте екран и звук от устройства, като смартфон или таблет, безжично на телевизора (т.е. без кабели). Това дава възможност да гледате на телевизора онова, което показва смартфона или таблета. Например можете да стартирате видеоклип на смартфона и да го показвате едновременно на телевизора или да използвате таблета като гейм контролер, а съдържанието да се отразява на големия телевизионен екран.","WiFi TV връзката на телевизора е в готовност. Стартирайте, за да споделите екрана на устройството с телевизора.","Свързване. Моля изчакайте.","Неуспешно свързване!","Свързването беше неуспешно. Моля проверете."];
var homePageLittleWin = ["Настройки","Медия","Любими канали","Smart TV","EPG"];

var hbbtvStopRemind  = ["Желаете ли да прекратите възпроизвеждането?"];
var colorSystem = ["Автоматично","PAL","SECAM","NTSC"];
var deviceTitleTipsText = "За повече информация натиснете ≡.";
var emptyListInfo = "Към ТВ няма свързано устройство!";
var optionVideoListArray_1 = ["Предв. настройка на образа", "Предварително зададен звук", "Режим на възпроизвеждане", "Режим на екрана:", "3D режим", 
							  "L-R бутон", "Дълбочина на рязкост", "Субтитри", "Саундтрак", "Заглавие", "Глава", "Инфо"];
var optionVideoListArray_2 = ["Предв. настройка на образа", "Предварително зададен звук", "Режим на възпроизвеждане", "Режим на екрана:", 
							  "Субтитри", "Саундтрак", "Заглавие", "Глава", "Инфо"];
var bottomTipsText = ["Възпр./пауза", "Бързо превъртане назад", "Бързо превъртане напред", "Плейлиста", "Настройки"];
var picturePresetArray = ["Cтандарт", "Динамичният", "Естествен", "Кино", "Лични данни"];
var videoPlayModeArray = ["Повтори всички", "Повтори веднъж", "Нормален"];
var screenModeHDArray = ["16:9", "4:3", "Bredbild", "Bredzoom", "Zoom 2", "Bredzoom 2", "Utsträckt zoom", "Автоматично"];
var screenModeSDArray = ["16:9", "4:3", "Bredbild", "14:9 zoom", "16:9 zoom", "16:9 zooma upp", "Автоматично"];
var Mode3DArray = ["Изкл.", "2D-към-3D", "Един до друг", "Горе и долу", "Паралелна работа"];
var videoOptionListArray = ["Изкл.", "Писта", "Субтитри", "Заглавие", "Глава"];
var subMenuTitleText = "Субтитри";
var langMenuTitleText = "Език на звука";
var titleMenuTitleText = "Заглавие";
var mode3DMenuTitleText = "3D режим";
var langInfoText = "Писта";
var STOP_RESUME_INFO = "Стоп-възстан.";
var playListName = "име";
var eb_tips = "Съвети";
var ok_button = "ОК";
var eb_info = ["Грешка при аудио декодиране.", "Грешка при видео декодиране.", "Аудио форматът не се поддържа.", 
			   "Видео формат не се поддържа.", "Файлът не може да бъде отворен.", "Грешка във възпроизвеждането, моля опитайте отново.",
			   "Форматът на файла не се поддържа.", "Момент! Плеърът прекрати възпроизвеждането.",
			   "Пътят към файла не съществува или е невалиден.\n Поставете наново устройството за съхранение и опитайте още веднъж.",
			   "Да продължи ли възпроизвеждането от предишния му\n статус?"];
var picturePlayErrorTips = ["Неуспех при зареждане!!!","Снимката е твърде голяма!!!","Мрежова грешка!!!","Грешка в нишката!!!","Грешка в параметър!!!","Неизвестна грешка!!!"];
var frameTitleText = "Ново устройство";
var eb_quit_info = "Сигурни ли сте, че искате да излезете?";
var eb_yes = "ДА";
var eb_no = "НЕ";
var offinfo = "Изкл.";
var naInfo = "нула";
var consoleInfoArray = ["Бързо превъртане назад", "Бързо превъртане напред", "Възпр./пауза", "Плейлиста"];
var cantOperateText = ["Функцията не се поддържа."];
var chapterChangeInfo = "Достъпни са единствено сериите от 1 до ХХХХ.";
var metaDataArray = ["Метаданни на заглавие/издание: ", "Метаданни на серия: ", "Метаданни на аудио: ", "Метаданни на субтитри: "];
var metaTitleInfo = "Заглавие";
var metaChapterInfo = "Глава";
var videoLoadingInfo = "Анализиране...";
var listLoadingInfo = "Зареждане...";
var pgInfo = "Законово право: ";
var fileNameText = "име";
var fileDateText = "Дата";
var fileSizeText = "Размер";
var fileDurationText = "Продължителност";
var fileDirectorText = "Режисьор";
var fileCopyrightText = "Авторско право";
var fileArtistText = "Изпълнител";
var fileAlbumText = "Албум";
var fileGenreText = "Жанр";
var fileYearText = "Година";
var fileGenreText = "Жанр";
var mainListArray = ["Всички", "Видео", "Видео", "Музика"];
var sortArray = ["име", "Дата"];
var parserArray = ["Нормален", "Рекурсивно  "];
var emptyTipsInfo = "Момент! Не е открит поддържан файл.";
var emptyFolderInfo = "Момент! Не е открит поддържан файл.";
var sortName = "Сортиране по";
var parserName = "Парсер";
var divx_str1 = "Регистриране на DivX(R)";
var divx_str2 = "Дерегистрация на DivX(R)";
var infor_str = "Инфо";
var quickMenuEmptyText = "Няма налични опции.";

var musicSoundPresetArray = ["Cтандарт", "Кино", "Музика", "Ясен глас", "Лични данни"];
var musicInformationArray = ["име", "Изпълнител", "Албум", "Жанр:", "Година:", "Продължителност:"];
var playListName = "име";
var playTipsInfo = ["Възпроизвеждате първия файл.", "Възпроизвеждате последния файл."]
var musicNameInfo = "Name";
var musicArtistInfo = "Изпълнител";
var musicAlbumInfo = "Инфо";
var optionSoundPresetInfo = "Предварително зададен звук";
var optionBGMInfo = "Възпроизвеждане във фонов режим";
var optionAudioOnlyInfo = "Само звук";
var optionInfoText = "Инфо";

var remotePhoneConnecte = "XXXX е свързан към телевизора.";
var tvRemoteTitle		= "TV romote";
var tvRemoteDeveloper	= "Приложението е разработено от TCL";
var tvRemoteDeviceTitle	= "Наименование на устройството";
var remoteOption		= ["Медийно споделяне","Дистанционно управление","Помощ","Относно","Smart Connect"];
var remotebottom		= " Моля изтеглете \"TV Remote\" на смартфона си. ";
var remoteStage			= ["Android","IOS"];
var sharingReminds		= ["Споделяне на снимки, видеоклипове и музика с телевизора през телефона.",
							"Стъпки: \n   1. Щракнете върху \"TV Remote\" на телефона. Свържете телефона с телевизора посредством същата WiFi мрежа;\n   2. Щракнете върху \"Media Sharing\", за да преглеждате мултимедийни файлове;\n   3. Изпращане на сигнал от носител към телевизора с цел възпроизвеждане (с една от следните опции)",
							"       a) Плъзнете и поставете папката/файла в иконата на телевизора в горната част на екрана;\n      б) Насочете телефона към телевизора, за да стартирате първия файл;\n      в) Възпроизведете медията на телефона и щракнете върху иконата за споделяне с телевизора;",
							"   4. По време на възпроизвеждането на телевизора разклатете телефона, за да възпроизведете предишен или следващ файл."];
var controlReminds		= ["Използвайте телефона като дистанционно управление за работа с телевизора.",
							" ",
							"Стъпки: \n   1. Щракнете върху \"TV Remote\" на телефона. Свържете телефона с телевизора посредством същата WiFi мрежа;\n   2. Щракнете върху \"Remote Control\" за да управлявате телевизора."];
var helpDeviceWords		= "Взаимодействие с мулти-екрани";
var helpBottom			= " В ерата на технологията за интернет съхранение интелигентните устройства, като телефони и телевизори, са взаимосвързани. Споделяйте медии на много екрани със семейството и управлявайте телевизора с телефон! ";
var helpReminds			= ["Подготвителни действия\n   1. Изтеглете и инсталирайте \"TV Remote\" от Google Play или Apple Store.\n   2. Свържете телефона с телевизора посредством същата WiFi мрежа.",
							" ",
							"Препоръчвани телефони\n   1. CPU: kdo 800MHz\n   2. Съхранение: поне 80MB свободно дисково пространство",
							" ",
							"Отказ от отговорност\n   В случай че \"TV Remote\" не е достъпна за Вашия телефон, моля свържете се с производителя на телефона. "];
var helpButtons			= ["Предишен","Следващ"];
var aboutReminds		= ["TV romote","Приложението е разработено от TCL"];
var aboutExit			= "Изход";
var smartReminds		= ["Бърза и интелигентна връзка между телевизора и телефона.",
							" ",
							"Стъпки \n   1. Свържете телефона и телевизора към една и съща локална мрежа. Щракнете върху \"TV Remote\" на смартфона.\n   2. Щракнете върху \"Smart Connect\" за сканиране на QR кода.\n   3. Когато телевизорът е в режим на гледане на излъчвани програми, натиснете клавиш INFO върху дистанционното управление и го задръжте за 4 секунди. QR кодът ще се появи върху целия екран.",];
var smartQRReminds		= ["След това щракнете върху \"Smart Connect\" в TV Remote на Вашия телефон и сканирайте QR кода за незабавно свързване на телевизора с телефона.",
							"QR кодът съдържа информация за локалната мрежа. Пазете го старателно!"];
							

var consoleTipArray = ["Предишен","Следващ","Конзола","Плейлиста"];							
var optionInfoArray = ["Предв. настройка на образа","Режим на възпроизвеждане","Продължителност","Ефект","Инфо"];

var playModeArray = ["Нормален","Случаен избор","Повторение"];
var durationArray = ["Къса (5 сек)", "Средна (10 сек)", "Дълга (15 сек)"];
var effectArray = ["Няма", "Въртене", "Изтриване надясно", "Изтриване наляво", "Изтриване нагоре", "Изтриване надолу", "В каре", "Извън каре", "Произволен"];
var infoArray = ["Име:","Размер:","Дата:","Местоположение"];

var picturePresetBarTitleInfo = "Предв. настройка на образа";
var picturePresetBarArray = ["Cтандарт","Динамичният","Студио","Кино","Лични данни"];
var upTipsInfo = "Преместване на картината"; //add yums 2014-10-10
var consoleTipsArray = ["Конзола","Предишен","Следващ","Плейлиста","Настройки"];  //add yums 2014-10-10
var pictureMoveTipsArray = ["Натиснете отново ДЯСНА стрелка за показване на следващата снимка","Натиснете отново ЛЯВА стрелка за показване на предишната снимка","Натиснете отново стрелка НАДОЛУ за показване на плейлиста"]; //add yums 2014-10-10

var optionPvrListArray = ["Предв. настройка на образа","Предварително зададен звук", "Режим на екрана:", "3D режим", "Субтитри", "Саундтрак", "Инфо"];							
	
var titleSpanFirstArray = ["Управление и свързване","Основни правила при употреба","ПРИЛОЖЕНИЯ","TV","Настройки","Често задавани въпроси"];
var titleSpanSecondArray = [["Дистанционно управление","Бутони на панела","Лесно управление","Телевизионна връзка","Телевизионна връзка","Телевизионна връзка","Безжични"],["Стартираща програма","Лента на състоянието","Източник"],["Възпроизвеждане на приложения","Медия","TV romote"],["Настройка на канала и силата на звука","Списък на каналите","EPG","Канали","Любими канали"],["Регулиране на картината","Регулиране на звука","Регулиране на канала","Актуализиране софтуер","Език","Родителски контрол"],["Често задавани въпроси","Често задавани въпроси","Отстраняване на неизправности","Отстраняване на неизправности","Правила и условия"]];
var contentSpan1_1Array =[["ЗАХРАНВАНЕ:","ИЗТОЧНИК:","НАСТРОЙКИ:","ОПЦИЯ:","НАЗАД:","INFO:","НАЧАЛО:","ИЗХОД:","СПИСЪК:"],
    ["Включва захранването или превключва в режим на готовност",
        "Избор на входен източник",
        "За да покажете менюто за настройки",
        "За да покажете менюто за опции",
        "Преминете към предишното меню или излезте от приложението",
        "Показва информация за програмата",
        "За достъп до началната страница на SmartTV",
        "Преминете към предишното меню или излезте от приложението",
        "Показва списък с канали"]];
var contentSpan1_2Array = ["Предишен канал","Следващ канал","Увеличаване на силата на звука","Намаляване на силата на звука","Прехвърля Ви на началната страница","Потвърждаване на избраната опция","Режим на готовност / Включване"];
var contentSpan1_3Array = ["OK/Справочник","Канал нагоре","Канал надолу","Намаляване на звука","Увеличаване на звука","В някои функции под формата на бутони-стрелки."];
var contentSpan1_4Array = ["Локална мрежа","HDMI ( MHL )","HDMI","HDMI ( ARC )","AV OUT адаптер","Локална мрежа","Смартфон","PC / цифрова приставка / DVD","Аудио усилвател","Аудио усилвател / монитор","Възможно е телевизорът Ви да не съдържа всички гнезда"];
var contentSpan1_5Array = ["USB 2.0","USB 3.0","Слушалки","AV IN адаптер","SPDIF","CMP AUDIO IN адаптер","CMP IN (YPbPr) адаптер","USB устройства","USB устройства","Слушалки","DVC / конзола за игри / цифрова приставка / DVD","Аудио усилвател","DVC / конзола за игри / цифрова приставка / DVD","Възможно е телевизорът Ви да не съдържа всички гнезда"];
var contentSpan1_6Array = ["Общ интерфейс","SD","VGA","SCART","Мини SCART","ANTENNA IN","Карта PCMCIA","SD карта","Персонален компютър","Цифрова приставка / DVD","Антена / Кабел / Сателит","Възможно е телевизорът Ви да не съдържа всички гнезда"];
var contentSpan1_7Array = ["Таблет","Персонален компютър","Маршрутизатор","Телефон","TV"];
var contentSpan1_8Array = ["Превключване на функция/Захранване","Натиснете и задръжте за отваряне на таймер за заспиване","Надолу","Нагоре","Сила на звука/Канал/Източник"];

var contentSpan2Array = [["Натиснете стрелките, за да видите началната страница.","След това натиснете OK, за да гледате някоя от програмите или да влезете в приложението."],["Показване на дата, мрежи, устройства и т.н. в горния десен ъгъл на екрана."],["Изберете входящия сигнал от устройствата, свързани към телевизора посредством различни портове, като TV, AV, HDMI и т.н."]];

var contentSpan3Array = ["Вижте и се наслаждавайте на любимите си приложения чрез страница Смарт телевизор","Разглеждайте снимки и слушайте музика от USB устройство за съхранение.","Свържете телевизора със смартфон или таблет към една и съща локална мрежа","Щракнете върху nScreen или TV Remote на смартфона или таблета си","Споделяйте снимки, видеоклипове и музика със семейството си върху мулти-екрани. Управлявайте своя телевизор със смартфона си."];

var contentSpan4Array = [["За превключване на каналите, натиснете стрелка НАГОРЕ / НАДОЛУ","За регулиране нивото на звука, натиснете стрелка НАЛЯВО / НАДЯСНО"],["За да разгледате каналите, натиснете LIST върху дистанционното управление","За да изберете желания канал, натиснете стрелка НАГОРЕ / НАДОЛУ"],["EPG представлява екранно ръководство, показващо програмата на цифровите телевизионни канали. Можете да управлявате, избирате, разглеждате и записвате програми."],["Търсене и инсталиране на канали"],["Добавяне или редактиране на любими канали в списъка с канали"]];

var contentSpan5Array = ["Наслаждавайте се на любимите си програми чрез видео приложения"];

var contentSpan6Array = [["Натиснете Опция за показване на опциите за настройка на системата","Влезте в настройките на картината, за да регулирате стойностите"],["Натиснете Опция за показване на опциите за настройка на системата","Влезте в настройките на звука, за да зададете опциите"],["Натиснете Опция за показване на опциите за настройка на системата","Влезте в настройките на каналите, за да зададете опциите"],["Изпълнете актуализация на своя телевизор при наличие на нова версия на софтуера"],["Можете да изберете предпочитания от Вас език за менюто"],["Позволява на родителите да блокират канали или програми, които не са подходящи за деца"]];

var contentSpan7_1Array = [["Липсват изображение и звук","Проверете предпазителя и прекъсвача.","Включете друг електрически уред в същия контакт, за да проверите дали работи, и дали е бил включен.","Съприкосновението на захранващия щепсел с електрическия контакт е лошо","Проверете източника на сигнала."],["Картината е нормална, липсва звук","Натиснете бутона за увеличаване на силата на звука.","Настройката на звука е неправилна.","Грешка при излъчването на сигнала."],["Звукът е нормален, липсва картина","Регулирайте настройките за яркост и контраст.","Грешка при излъчването на сигнала.","Проверете дали не е включен режим само аудио."]];
var contentSpan7_2Array = [["Радиосмущения","Причиняват движещи се вълни или диагонални ивици, а в някои случаи и загуба на контраст в картината. Намерете и премахнете източника на радиосмущенията."],["Липсва цвят","Регулирайте настройките на цветовете.","Проверете другите канали. Възможно е да се приема черно-бяла програма."],["Дистанционното управление не работи","Заменете батериите.","Батериите не са поставени правилно. Основното захранване на телевизора не е свързано."]];
var contentSpan7_3Array = [["Съдържанието на USB устройството не се показва","Проверете дали USB устройството за съхранение на данни е съвместимо с телевизора.","Уверете се, че форматите за аудио и видео се поддържат от телевизора."],["Възпроизвеждане без звук","Аудиоформатът на видеоклипа не се поддържа от телевизионния плеър."],["Файловете не се възпроизвеждат плавно","Ефективността на прехвърляне на USB устройството за съхранение може да ограничи скоростта на прехвърляне на данни към телевизора."]];
var contentSpan7_4Array = [["На какво трябва да се обърне внимание при актуализиране на софтуера","Захранването не бива да бъде прекъсвано по време на актуализацията на софтуера.","Избягвайте всякакви действия с дистанционно управление по време на актуализацията на софтуера.","Проявете търпение, процесът на актуализация може да отнеме известно време."],["След приключване на актуализацията на софтуера няма явни промени в интерфейса на телевизора.","При определени условия, актуализацията на софтуера може да доведе не само до обновяване или добавяне на нови функции, но също и до подобряване на работата на телевизора, без явни промени в интерфейса. Освен това, понякога интерфейсът на телевизора може да остане незасегнат."]];
var termsTitle = "Правила и условия";
var termsConditions = ["Правна декларация на TCL, производител на този телевизор. ","Поради различните възможности на продукта във връзка с услугите за Smart TV, както и ограниченията в предлаганото съдържание, някои функции, приложения и услуги е възможно да не бъдат достъпни на всички устройства и на всички места. Някои функции на Smart TV е възможно да изискват допълнителни периферни устройства или членски такси, които се предлагат отделно. Вижте нашия уебсайт за повече информация относно конкретните устройства и предлагано съдържание. Услугата и съдържанието предлагано чрез Smart TV могат да бъдат променяни без предварително предизвестие. \n   Цялото съдържание и услуги, предлагани през това устройство, принадлежат на трети страни и са защитени от авторски права, патенти, търговски марки и/или други закони за интелектуална собственост. Подобно съдържание и услуги се предлагат само за лично ползване, а не за търговски цели. Не се разрешава използване на съдържание или услуги по начин, който не е разрешен от собственика на съдържанието или доставчика на услугите. Без ограничения на казаното по-горе, освен с изричното упълномощаване от съответния собственик на съдържанието или доставчик на услугата, не се разрешава промяна, копиране, повторно публикуване, зареждане, публикуване, предаване, превод, продажба, създаване на производни работи, експлоатиране или разпространение по какъвто и да е начин на съдържание или услуги, предлагани през това устройство. \n   С НАСТОЯЩОТО ИЗРИЧНО ПРИЕМАТЕ, ЧЕ ИЗПОЛЗВАНЕТО НА УСТРОЙСТВОТО Е НА ВАШ СОБСТВЕН РИСК И ЧЕ ЦЕЛИЯТ РИСК ПО ОТНОШЕНИЕ НА УДОВЛЕТВОРЕНИЕТО ОТ КАЧЕСТВОТО, РАБОТАТА И ТОЧНОСТТА НА УСТРОЙСТВОТО Е ИЗЦЯЛО ВАШ. УСТРОЙСТВОТО, КАКТО И ЦЯЛОТО СЪДЪРЖАНИЕ И ВСИЧКИ УСЛУГИ НА ТРЕТИ СТРАНИ СЕ ПРЕДЛАГАТ \"КАКТО СА\", БЕЗ КАКВИТО И ДА Е ГАРАНЦИИ - ПРЕКИ ИЛИ КОСВЕНИ. TCL ИЗРИЧНО ОТМЕНЯ ОТГОВОРНОСТТА И ВСИЧКИ ГАРАНЦИИ И УСЛОВИЯ ПО ОТНОШЕНИЕ НА УСТРОЙСТВОТО И ВСЯКО СЪДЪРЖАНИЕ И УСЛУГИ, ПРЕКИ ИЛИ КОСВЕНИ, ВКЛЮЧИТЕЛНО, НО НЕ САМО, ГАРАНЦИИ ЗА ПРОДАВАЕМОСТ ИЛИ ЗАДОВОЛИТЕЛНО КАЧЕСТВО, ПРИГОДНОСТ ЗА ДАДЕНА ЦЕЛ ИЛИ ТОЧНОСТ, ИЛИ ЗА СВОБОДНО И БЕЗПРЕПЯТСТВЕНО ПОЛЗВАНЕ, И НЕНАРУШАВАНЕ НА ПРАВАТА НА ТРЕТИ СТРАНИ. TCL НЕ ГАРАНТИРА ТОЧНОСТТА, ВАЛИДНОСТТА, НАВРЕМЕННОСТТА, ЗАКОННОСТТА ИЛИ ЗАВЪРШЕНОСТТА НА СЪДЪРЖАНИЕТО ИЛИ УСЛУГИТЕ, ПРЕДЛАГАНИ ПРЕЗ ТОВА УСТРОЙСТВО И НЕ ГАРАНТИРА, ЧЕ УСТРОЙСТВОТО, СЪДЪРЖАНИЕТО ИЛИ УСЛУГИТЕ ЩЕ УДОВЛЕТВОРЯТ ВАШИТЕ ИЗИСКВАНИЯ, ИЛИ ЧЕ РАБОТАТА НА УСТРОЙСТВОТО ИЛИ УСЛУГИТЕ ЩЕ БЪДАТ НЕПРЕКЪСНАТИ И БЕЗ НЕИЗПРАВНОСТИ. TLC НЕ НОСИ ОТГОВОРНОСТ, ПРИ НИКАКВИ ОБСТОЯТЕЛСТВА, ВКЛЮЧИТЕЛНО И ПОРАДИ НЕБРЕЖНОСТ, НЕЗАВИСИМО ДАЛИ ПО СИЛАТА НА ДОГОВОР ИЛИ ЗАКОНОНАРУШЕНИЕ, ЗА КАКВИТО ДА Е ДИРЕКТНИ, ИНДИРЕКТНИ, СЛУЧАЙНИ, ПРЕКИ ИЛИ КОСВЕНИ ЩЕТИ, ПРАВНИ РАЗНОСКИ, РАЗХОДИ ИЛИ ДРУГИ ЩЕТИ, ПРОИЗТИЧАЩИ ОТ ИЛИ ВЪВ ВРЪЗКА С ИНФОРМАЦИЯ СЪДЪРЖАЩА СЕ ИЛИ ПРОИЗТИЧАЩА ОТ ИЗПОЛЗВАНЕТО НА УСТРОЙСТВОТО, ИЛИ НА СЪДЪРЖАНИЕ ИЛИ УСЛУГА, ДО КОЯТО ВИЕ ИЛИ ТРЕТА СТРАНА Е ИМАЛА ДОСТЪП, ДОРИ АКО СТЕ БИЛИ ПРЕДУПРЕДЕНИ ЗА ВЪЗМОЖНОСТТА ОТ ПОДОБНИ ЩЕТИ. \n   Услугите на трети страни могат да се променят, прекъсват, отстраняват, преустановяват или спират, или достъпът до тях да бъде деактивиран по всяко време и без предупреждение, и TCL (производител на телевизорите с марка Thomson) не поема отговорност или не гарантира, че каквито и да е съдържание или услуги ще останат достъпни за какъвто и да е период от време. Съдържанието и услугите се разпространяват от трети страни с помощта на мрежи и съоръжения за излъчване, над които TCL няма контрол. Без да ограничава общия характер на настоящия отказ от отговорност, TCL изрично отказва всякаква отговорност за промени, прекъсвания, деактивирания, отстранявания или спирания на съдържание или услуги, които се предлагат чрез това устройство. TCL може да наложи ограничения за достъпа до определени услуги или съдържание по всякакви причини и без предварително предизвестие или отговорност. TCL не носи отговорност за обслужване на клиентите, свързано със съдържанието и услугите. Всички въпроси или заявки за обслужване по отношение на съдържанието и услугите трябва да се отправят директно към съответните доставчици на съдържание и услуги."];

var noChannelListRemind        = ["Няма намерени канали. Списъкът с канали е наличен след сканиране за канали.","Сканиране на канали"];
var closeSubtitleRemind   = "Функцията ще бъде достъпна при изключване на субтитрите. Желаете ли да зададете сега?";

var estickerTitles = ["Високо реалистични изображения","Живи цветове","Реализъм на движенията","Динамично качество на картината","SR UHD мащабиране","Истински 3D свят","По-бързо функциониране","Бъдещо 4К съдържание","Наслаждавайте се на света на интернет","Достъп до допълнително съдържание","Вградени цифрови тунери","Свързване на всички устройства","Различни 4К източници","USB съдържание","Ултра-бърз безжичен интернет","Мобилно съдържание в телевизора","Съдържание на мобилни устройства","Местно съдържание","Одобрено от DivX","Безупречна картина","Canal Ready","TDT Premium"];

var estickerDescriptions = ["Невероятно изживяване при гледане, благодарение на четири пъти по-детайлни Full HD изображения върху UHD екран","Широката цветова гама поражда вълнение във всяка сцена с ярки червени и изумрудени зелени цветове","4K интерполацията на кадрите и фоновото осветление се справят ефективно с размазването на движенията","Яркостта на оригиналното изображение се подсилва за истинска динамична експресия с блестящ контраст","Наслаждавайте се на по-отчетливи телевизионни предавания и Blu-Ray дискове, благодарение на технологията Супер резолюция","Изпитайте удоволствието от 3D TV Ready и гледайте разнообразно 3D съдържание","Приятни изживявания с Quad Core за плавно взаимодействие и подобрена ефективност","HEVC (H.265) кодек поддръжка за бъдещия стандарт за видео разпространение 4K","Изобилие от онлайн приложения, услуги тип видео-при-поискване, телевизионно и интернет сърфиране","Вижте повече допълнителни услуги и съдържание от любимите си телевизионни оператори","Достъп до телевизионни канали с висока разделителна способност, без допълнителна цифрова приставка","Лесен за свързване с различните цифрови източници в дома Ви","Телевизор готов за бъдещето, способен да възпроизвежда 4K 50/60Hz чрез HDMI 2.0 с HDCP 2.2","Изобразяване на видеоклипове или снимки на голям екран директно от USB устройство, твърд диск или камера в резолюция 4К","Последно поколение 2x2 MIMO и AC стандарти предоставят несравнима скорост за интернет достъп","Наслаждавайте се на снимки, видеоклипове, приложения от мобилни устройства върху голям екран, благодарение на технологията за симетрично отразяване","Снимки, видеоклипове, приложения от смартфон или таблет могат да бъдат показвани върху голям екран ","Показване на местно съдържание (като снимки и видеоклипове от устройства, свързани към локална мрежа) върху голям екран","Възпроизвеждане на собствени или наети филми, защитени от DivX","Изключително тесен панел и супер тънък дизайн","Изпробван и одобрен от Canal +","Изпробван и одобрен от TDT Premium"];							

var eManualTextArray = ["Е-наръчник","Всички графики служат единствено за цветово представяне."];
var frontPanelRemind = "Блокиран преден панел";
var eRPRemind		 = "Режим \"Магазин\" не може да отговори на изискванията за ПСЕ. Сигурни ли сте?";	
var noRelatedChannel = "Няма сходен канал";
var option0624Name          = ["BOP","BFS","Събитие по събитие","GetUserID","BGM","Reset all","Възстановяване фабрични настройки","NRM","Избор на DVB-T2 и държава","Режим HbbTV"];
var DVBT2AndChoice = ["Вкл.","Избор на държава:","Изкл."];
var hbbtvServiceRemind = "Скоро услуга HbbTV.";
var insertWord = "Постави";
var viewDetail = "Детайлен изглед";			

var remindOAD  = "Актуализиращ софтуера. Може да има нов препоръчителен софтуер за актуализация на друг канал. Ако изберете да го заредите, може да превключи автоматично на този канал. Искате ли да го направите сега?";

var LEDStatus = ["Примигване", "Нормален","Изкл."];
var netFlixRemind = "Тази функция прекратява достъпа до услугите на Netflix до следващото ви влизане.";
var ESNExplanation = "Електронен сериен номер";
var resetShopRemind = "Системата се връща в начално състояние. Не изключвайте телевизора";
var initialSelectOption = "Изберете опция:";
var databaseRemind   = "Системата разпознава базата данни като повредна поради неизвестна причина и я реизгражда автоматично. Натиснете Ок, за да продължите.";
var Deactivation = "Деактивиране";
var oadFutureRemind = "Актуализиране на софтуера.\n На %s ще предложим препоръчвана софтуерна актуализация. Актуализирането може да отнеме известно време и екранът да стане черен. Не изключвайте приемника по време на актуализиране. Ако приемете актуализирането, оставете приемника на планираното време. Желаете ли да приемете актуализацията?";														
							
var bt_title = "Bluetooth";
var bt_soundOutPutName = "Звуков изход";
var bt_soundOutPutTV = "Телевизионни говорители";
var bt_soundOutPutBT = "Bluetooth устройство";
var bt_soundOutPutBT_TV = "Bluetooth и ТВ";
var bt_refreshBarName = "Устройства";
var bt_settingTips_On = "Включване на функцията Bluetooth и сканиране за устройства.";
var bt_settingTips_Finding = "Откриване на налични устройства...";
var bt_settingTips_NoDevice = "Няма налични устройства.";
var bt_deviceList_State_NoConnect = "Няма връзка";
var bt_deviceList_State_Connecting = "Свързване...";
var bt_deviceList_State_Connected = "Свързани";
var bt_deviceList_State_Paired = "Сдвоени";
var bt_deviceList_Conncect_Failed_Tips1 = "Връзката се разпадна.";
var bt_deviceList_Conncect_Failed_Tips2 = "Моля потвърдете, че Bluetooth функцията на ХХХ е включена.";
var bt_deviceList_Conncect_Success = "Свързано към Bluetooth устройство.";
var bt_deviceList_Disconncect_Success = "Връзката с Bluetooth устройството е прекъсната.";
var bt_deviceList_Disconnect = "Сигурни ли сте, че искате да прекъснете връзката с ХХХ?";
var bt_tipsTitle = "Пояснение";
var bt_bluetooth_Pairing_Title = "Bluetooth сдвояване";
var bt_bluetooth_Input_Pin = "Моля въведете PIN код:";
var bt_bluetooth_Output_Pin_Tip = "Въведете PIN код XXXX посредством клавиатурата.";
var bt_bluetooth_Pin_Wrong_Tip = "Грешен PIN код";
var bt_bluetooth_Remove_Pair_Title = "Заявка";
var bt_bluetooth_Remove_Pair_Ask = "Забравяне на устройството?";							

var audioDescriptionName = ["Звуково описание","Говориел","Сила звук говорител","Слушалка","Сила звук слушалка","Сила звук AD","BT устройство","Сила на звука на BT устройство","Усилвател","Говориел"];
var audioDescriptionOptions = ["Изкл.","Нормален","Звуково описание"];
var volumeOffRemind = 'Задайте настройка "Вкл." (On) на XXX в Меню за настройки.';	
var switchSourceRemind   = " поставени. Искате ли да включите сега?";
var footballModeName = "Режим на спорт";
var resetStadium = "Стадион";							

var atvSearchMenu = "ATV manual search";
var dtvSearchMenu = "DTV manual search";
var settingNoticeSourceName ="Автоматичен източник";

var smartTVOptions		= ["Портал за SmartTV","HbbTV","Споделяне и гледане","Отчитане на WiFi","Условия за употреба",
    "Мрежова готовност","Възстановяване настройките на smart TV","Cookie policy","Политика на поверителност","Изтриване на данните"];
var ClosedcaptionName ="Closed caption";
var sysCCOptions	= ["CC mode","Analog CC","Digital CC","Superimpose","Closed caption"];							
var sysCCmodeOption = ["Off", "On", "On When Mute"];
var sysanalogCCOption = ["Off", "CC1", "CC2", "CC3", "CC4", "Text1", "Text2", "Text3", "Text4"];
var sysdigitalCCOption = ["Off", "Service 1", "Service 2", "Service 3", "Service 4", "Service 5", "Service 6", "Service 7", "Service 8"];
var syssuperimposeOption = ["Off", "Service 1", "Service 2", "Service 3", "Service 4", "Service 5", "Service 6", "Service 7", "Service 8"];
var sysCCOPtionItems = ["CC Option","Mode","Font Style","Font Size","Font Edge Style","Font Edge Color","FG Color","BG Color","FG Opacity","BG Opacity"];
var sysCCOtionMode = ["Custom","Default"];
var sysCCOptionFontStyle = ["Default","Font1","Font2","Font3","Font4","Font5","Font6","Font7"];
var sysCCOptionFontSize = ["Default","Large","Small","Normal"];
var sysCCOptionFontEdgeStyle = ["Default","None","Raised","Depressed","Left Shadow","Right Shadow"];
var sysCCOptionFontColor = ["Default","Black","White","Red","Green","Blue","Yellow","Magenta","Cyan"];
var sysCCOptionFontOpacity = ["Default","Solid","Flashing","Translucent","Transparent"];
var supportOptions		= ["Дистанционна диагностика","Връзка с нас"];
var tvDoctor=["Дистанционна диагностика 2.0",
"Приложението е предназначено само за SmartTVс цел извършване на диагностика и подобряване на взаимодействието с продукта. Приложението събира данни за работата и модела на телевизора, които се записват на сървъра и се използват за разрешаване на проблеми с телевизора. То няма достъп до вашата лична информация. Уверете се, че телевизорът е правилно свързан с Интернет.",
"Локална диагностика",
"Когато диагностиката започне, следвайте инструкциите на инженера по поддръжката.",
"Дистанционна диагностика",
"Преди да използвате опцията се уверете, че нашият инженер по поддръжката е на линия.",
"Сериен номер:",
"&nbsp;&nbsp;&nbsp;&nbsp;Потребителско име:",
"Свързване…",
"Извършва се диагностика.Поддържайте стабилна връзка с мрежата.",
"Няма достъп до Интернет. \nПроверете връзката с мрежата.",
"Изход"
];
var contactUsOption = ["Връзка с нас",
    "Свържете се с нас, ако имате проблеми при работата с устройството.",
    "Свържете се с нас",
    "Уебсайт:Вижте",
    "Номер на кол център:","Информация за продукта","Модел Име:",
    "Софтуерна версия:","","Потребителско име:","Идентификацинен номер на проекта:",
    "Тип на клиента:","Безжичен МАС адре:","Кабелен МАС адрес:","ESN на Netflix:","Сканиране на информацията на клетъчния телефон.",
    " и изберете страната си."];
							


//本地launcher的翻译，与服务器无关，只用于本地launcher
var homePageWords = ["Хронология", "Търсе"];//home页的翻译
var titlePageWords = ["У дома", "Видеоклипове","TV","Приложения"];//index的标题翻译
var videosPageWords = ["Кино", "Sport","Музика","Популярни","Игри","Образование","Новини"];//videos页的内容翻译

//同时应用于本地和服务器
var statusPageWords = ["USB","Настройки","WiFi","Кабелна"];//状态栏的翻译

//二级页面的翻译
var searchPageWords = ["Търсе", "Популярни търсения:","Програми, филми, хора..."];
var resultSearchPageWords = ["Резултати относно"," ","Опитайте с други ключови думи.","За съжаление все още не са намерени видеоклипове относно "," "];
var historyPageWords = ["Хронология", 'Натиснете','за да изтриете хронологията',"Изтриване на един","Изтриване на всички","Вчера","Днес"," Все още не сте гледали видеоклипове.","Успешно изтриване на хровологията на прегледите!"];
var channelPageWords = ["За съжаление все още няма видео."];

//以下数组是虚拟遥控器的html中所有span的文字，要一一对应

var virtualRemoteValues	= ["1","2","3","4","5","6","7","8","9",
                       	   "Zoom-","0","Zoom+",
                       	   "Изход","0","",
                       	   "Списък","0","Текст",
                       	   "Напътствия","Вход","Изход",
                       	   "Меню","Субтитри","Информация",
                       	   "Стоп",
                       	   "Информация","Меню","Изход",
                       	   "Изход"
                       	   ];	

//added for LA sports mode
var sportsModeInitReminds= ["Тези съвети се използват за настройване на USB устройство за спортен режим. Изберете режим на настройка.",
						 "Изберете размера на файла за спортен режим.",
						 "Създаване на файлове в спортен режим",
						 "Твърде малка скорост на USB устройството (< %f MB/sec) за функциите в спортен режим!",
						 "USB устройството е готово за спортен режим. Препоръчваме обаче да го промените (на скорост > %f MB/sec) за по-добра работа.",
						 "USB устройството е готово за спортен режим."];

var sportsModeExtra	= ["Искате ли да спрете спортния режим и да промените канала?",
						"Искате ли да спрете спортния режим и да промените източника на свързаното устройство на SCART вход?",
						"Искате ли да спрете спортния режим и да промените източника на свързаното устройство на HDMI вход?",
						"Спортният режим не се поддържа на шифровани канали.",
						"Искате ли да спрете спортния режим и да влезете в друг EPG?",
						"Искате ли да спрете спортния режим и да влезете в друга медия?",
						"Искате ли да спрете спортния режим и да промените входния източник?",
						"ТВ ще прекрати настоящия спортен режим. Искате ли да излезете?"];
var remoteControlNote = "- Предлаганото дистанционно управление може да се различава в зависимост от модела на продукта";


var textArray = ["Volume","Channel","Source","Switch/Power","Guide","seconds to Power OFF"];
var guideArray = ["VOL-","VOL+","CH-","CH+","Pre","Next"];
var favChannelListRemind = ['Няма любими канали. Отворете други списъци и използвайте "Зеления бутон", за да добавите любими канали.'];

var proxySetting = ["Прокси настройки","Порт"];
var powerOffShop = ["Препоръчваме да използвате режим на магазин, ще го направите ли?"];
var tcastTextPageWords = ["Изобилие от видеоклипове и приложения","Всичко само чрез дистанционното на ТВ","Страхотно съдържание на голям екран"];
var tcastOtherWords = ["Сканиране на QR код и изтегляне на T-Cast","ТВ е свързан към мрежата","Име на ТВ","T-Cast"];
var hbbtvWords = ["Настройка Hbbtv","HbbTV","Бисквитки","Бисквитки на трети страни","ID устройство","проследяване"];
var hbbtvTrackingWords = ["YES","NO","Няма значение"];
var eStickerTipWords = ["Мястото за съхранение е по-малко от 400M, искате ли да изтриете видеоклипове в режим Демо, за да освободите повече място?"];
var delEstickerVideoRemid = ["Видеото е изтрито успешно"];
var selectSatRemind = "Можете да изберете не повече от 20 сателита!";
var cookiePolicyTitle = "Cookie Policy – Online Smart TV Services";
var cookiePolicyConditions = ["Company respects your privacy when using Smart TVs manufactured and Services provided by Company. Cookies are used by many websites and other Internet services and your Smart TV will accept, store and transmit cookies to ensure that these websites and services operate properly. Company also uses cookies when providing you Services. In this Cookie Policy Company describes which cookies are set on your Smart TV and how you can manage them.\nPlease note that all personal data that Company collects and/or processes through or with the help of cookies is subject to the Privacy Policy and you should read the Cookie Policy together with the Privacy Policy.\n1. What is a cookie?\nCookies are small text files that may be placed on your Smart TV. When a website or the red-button service of a TV station is accessed, the website or service may store a cookie in the Smart TV. During subsequent accesses, a cookie that is placed on your Smart TV will send information to the party that has placed the cookie. Cookies are extremely common and used on a number of websites and services. Each cookie will typically contain the name of the domain from which the cookie has come, the \"lifetime\" of the cookie, and a value (usually a unique number). For a more thorough explanation of what cookies are and how they operate, please visit www.allaboutcookies.org.\nCookies can be categorized into functional cookies and non-functional cookies. Functional cookies are cookies that are strictly required for the purpose of providing you the Smart TV services and for websites and other services to provide the right content to the Smart TV. Non-functional cookies are all other cookies.\nThis Cookie Policy relates to cookies that are placed by us, as well as advertising cookies that may be placed by third parties through our services on your Smart TV. This Cookie Policy does not relate to cookies that may be placed when you use the Smart TV services to access third party websites, services or applications. For these cookies we refer you to the respective cookie policies of such third parties. However, this Cookie Policy describes how to delete such cookies (see section 4 below).\n2. Which non-functional cookies do we use?\nAdvertising: In-video and display advertisements may be served to your Smart TV when using Smart TV services. These advertisements can be served by us or by third parties via, or as coordinated by, our advertising server, which performs a central coordinating role in relation to the serving of such advertisements. Our advertising server or a third party advertising server will set a cookie on your Smart TV. By means of this cookie an advertising server will register whether an advertisement has been served to your Smart TV or whether someone using your Smart TV has clicked on an advertisement. We use the information saved in such advertising cookie to remember which advertisements have been served on your Smart TV so we can make sure that not too many of the same advertisements are served on any particular Smart TV, and that we are able to settle our commercial arrangements with our advertising partners. We shall not use this information to serve targeted advertisements. Furthermore, third parties may use our advertising system to serve advertisements to your Smart TV and place cookies on your Smart TV when such advertisements are served. \nThese cookies contain, among others, information about the served advertisements, information on in which application or domain such advertisements are served, and your IP address. This is done to remember how often a particular advertisement is shown, and in order to prevent the same advertisement being shown too often. External third party advertisers that may place advertisements may also use cookies to track your activity over multiple websites, and to provide advertisements that correspond to your personal preferences.\n3. Third party websites\nWhen you visit websites or services of third parties via the Smart TV services of your Smart TV, it is possible that such websites or services place cookies on your Smart TV, and that such websites track and store your interactions on such websites. We do not request or encourage such activities and will not use such information. Please refer to the respective cookie and privacy policies of such websites and services for more information about such parties’ use of such cookies.\n4. Cookie deletion\nYour user interface of your Smart TV allows you to delete all cookies and other local browser storage from the Smart TV. It is highly advisable to remove all cookies and locally stored settings prior to selling or giving away your Smart TV.\n5. Contacting us\nIf you have any questions or comments regarding our Cookie Policy or our practice of using cookies you can send us an e-mail via FRsupport@tcl.com.\nVersion: 1.0\n"];
var privacyPolicyTitle = "Privacy Policy – Online Smart TV Services";
var privacyPolicyConditions = ["We respect your privacy when handling your personal data. This Privacy Policy describes the entity responsible for the collection, processing and use of personal data we collect from you in connection with the use of our Smart TV services (\"Services\"), what types of personal data we collect about you, what we do with it, and your rights in relation to our use of the personal data. \n1. Data controller\nThe collection, processing and use of the personal data collected from you when using the Services is conducted by Shenzhen TCL New Technology Co., Ltd., No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, China (\"Company\"). Please note, however, that we are not responsible for all data processing activities set out below. We have nevertheless included a description of the respective activities in our Privacy Policy because this processing is connected with your use of the Smart TV.\n2. Data processing consent\nSome of the collection, processing and/or use of your personal data require your consent. \nIf you have consented to the use of your personal data for the purpose of improving the Services, your consent had the following wording:\n\"I consent to the collection, processing and use of my device start time, DTV channel list, favorite channels list, visit time, and viewed channels for the purposes of analyzing user habits to improve the Services and/or to analyze how many online users Company has per day/month/year and to the sharing of this information with TV stations.\"\nIf you have consented to the use of your personal data for advertisements that are tailored to your interests, your consent had the following wording:\n\"I consent to the collection, processing and use of my client type and country for the purpose of receiving appropriate advertisements.\"\nConsent is voluntary and you will still be able to use the Services if you do not consent. However, you may see advertisements and other content that is not tailored to your preferences. Irrespective of your consent Company reserves the right to collect, process and/or use the above data to the extent permitted by applicable law.\nYou may withdraw your consent to any of the above with effect for the future at any time. You may object to a use of your personal data for marketing, market or opinion research and to the tailoring of the Services to your needs. In order to withdraw your consent and/or to object, please change the privacy settings of your Smart TV accordingly.\n3. Personal data collected\nIrrespective of your consent, Company collects, processes, stores and uses the following data categories:\nDevice-ID: Your Smart TV stores a fixed unique number that enables us to identify and authenticate the Smart TV when you use the Services. This number is called the Device-ID. The Device-ID will be provided to our service partner to provide you the Services. We also provide the Device-ID to selected content partners for authentication purposes. These content partners use the Device-ID to authenticate your Smart TV for access to services provided by a content partner.\nIP address and MAC address: Your Smart TV will be assigned an IP address when accessing the Internet. This IP address will be transmitted to us and processed by us each time the Smart TV requests information or data from the Services. If your Smart TV is behind a router (e.g. in a local home network or local WLAN), we may collect and process the IP address of such router. The MAC address is a unique number assigned to each network interface of your Smart TV. The MAC address will also be collected and processed by us when the Smart TV requests information or data from the Services.\nService request data: Whenever you connect your Smart TV to the Internet and turn on the Smart TV, it will automatically connect to the Services, which are managed by our service partner. Your Smart TV will then be authenticated as being certified for access to the Services. For authentication purposes, the Services store one or more unique numeric identifiers related to your Smart TV. When connecting to the Service, the Smart TV will transmit the IP address it has been assigned and will transmit device specific information (Smart TV model, software version) to look whether software updates are available.\nService settings: As part of the regular functionality of the Services you can manually arrange the order in which apps are displayed by the Services. Our service partner will store your arrangement and other preferences you may set during using the Services. This information will be linked to the Device-ID.\nDevice specific information: The Smart TV stores several information about itself and its configuration. This information includes the Smart TV type, the version of the operation system of the Smart TV, its panel resolution, the project ID (i.e. information regarding configuration files), the user agent, browser name, browser version, and the language and country that have been configured in the Smart TV. This information will be used by us and will be provided to our service partner and content partners.\nAdvertising: The Services may serve advertisements. These advertisements are served by us, or by third parties using advertising inventory assigned by us. All advertisements are served by means of, or via, our advertising server, which fulfills a coordinating role for the serving of advertisements. Our advertising server or the third party advertising server may set a cookie on the Smart TV. Please refer to our Cookie Policy for more information about these cookies.\nService and Content Partner traffic: When you use the Services your Smart TV will request data from the Services via the Internet. As part of these requests your IP address as described above and the language and country that has been configured in your Smart TV will be transmitted to our service partner. Our service partner will process the respective data in accordance with its privacy policy.\nSecond screen usage: If you use our second screen application, the controls you activate on the application and the country and language settings, DTV channel list, favorite channels lists, schedule lists, Device-ID, current channel, protocol version and IP address of your Smart TV will be collected and processed by us on our servers. Our servers will then control your Smart TV as directed by you in the second screen app.\nHbbTV - \"Red Button\": TV stations (\"Stations\") may send additional information with their TV signal. If the Smart TV receives specific instructions in such additional information and if it is connected to the Internet, the Smart TV will download a picture or small page from the Station's website and display it together with the information to press the \"Red Button\" on your remote control if you want to use additional services provided by the Station. This happens each time you zap. Downloading the picture from the Station's website the Smart TV will transmit some personal data, i.e. the DTV channel list, current channel, event information table, TV time, IP address of your Smart TV and cookies stored on the Smart TV (if any). The Station is responsible for the collection, processing and/or use of this data. Moreover, if you use additional services offered by a Station through the Red Button, the Station may collect other personal data about you (e.g. which on-demand videos you watch, the news you read, etc.).\n4. Purposes for which we process and/or use your personal data\nWe process collected data for the following purposes:\n• Providing the Services: We use the IP address and MAC address, Device-ID, the version of the operation system of the Smart TV, client type of your Smart TV and its panel resolution, the project ID (i.e. information regarding configuration files), your DTV channel list, viewed channels, time zone, country and language settings to provide your Smart TV with access to the Services and services provided by content partners. Purposes include (but are not limited to) authentication, providing location based services to you (e.g. weather forecasts); abuse handling, management of security incidents, monitoring of availability of the Services, and providing backup services of user preferences.\n• Authentication: We use the Device-ID and MAC address for authentication purposes.\n• Software updates: Each time your Smart TV is powered on, it will provide us with the IP address, Device-ID, software version, client type of your Smart TV, project ID (i.e. configuration files), user ID, serial number to offer you and provide you with appropriate software updates. \n• Improving the Services: We use aggregated and anonymized usage data (i.e. data about your interaction with the Services) to improve the user experience of the Services.\n• Serving advertisements: We use the information in advertising cookies to allow the system to log which advertisements have been shown on your Smart TV in order to make sure that you do not receive too many similar advertisements, and we are able to settle our commercial arrangements with our advertising partners. External advertisers that serve advertisements on the Services or the content partner websites after coordination by our advertising server, may also use cookies to track you over multiple websites, and to serve advertisements that reflect your personal preferences.\n• Optimizing advertisements: We use data related to advertising views and clicks on advertisements to optimize the advertising experience of consumers in the Service.\n• Discounts: We provide the Device-ID to selected content partners to enable these partners to identify to what extent they can provide you with free access to Video on Demand titles in their collection.\n• Law enforcement: We may be required to provide data to competent law enforcement authorities or courts of justice. If we do so, we will only do so subject to a binding legal instrument like a warrant or a judicial order, which requires us to cooperate with the relevant authorities.\nUse of the Services is possible by using pseudonyms, unless specific services require that you provide your name and/or email address.\n5. Categories of recipients\nCompany shares your personal data collected during your use of the Services only with the following third parties:\n• With third party providers of Smart TV services if you request such services (e.g. if you start the Netflix application on your Smart TV we may share your IP address, MAC address, software version and TV model name with Netflix).\n• With third party content partners if you request certain content provided by such content partners (e.g. in order to provide you with the GoLive IP TV service, we may share your TV client type, IP address and language settings with the legal entity providing the GoLive service).\n• To the extent you have consented to the sharing of specific personal data with third parties above, Company will share your personal data with such third parties.\n• With outsourcing service providers as data processors assisting Company with providing the Services.\nCompany shares your personal data with other third parties only if Company is obligated to do so on the basis of legal requirements (e.g. to courts or criminal prosecution authorities), you have consented to the respective sharing or the sharing is otherwise lawful under applicable law.\n6. Countries in which your data will be processed\nCompany and/or some of the recipients of your personal data listed above may be located outside of the European Economic Area (i.e. in the following countries: Peoples Republic of China, United States of America). Therefore, your personal data may be processed in countries which are not recognized as providing an adequate level of protection of personal data in accordance with Directive 95/46/EC of the European Parliament and of the Council of 24 October 1995 on the protection of individuals with regard to the processing of personal data and on the free movement of such data.\n7. Your rights\nYou may contact Company in order to receive information about your personal data processed by Company and/or to exercise your statutory rights regarding access, rectification, deletion and blocking of your personal data; and/or to object the processing of your personal data for purposes of marketing and/or market or opinion research.\n8. Changes to the Privacy Policy\nTo improve our Services we may require amendments to this Privacy Policy – e.g. by the implementation of new technologies or the introduction of new services. We reserve the right to change or supplement this Privacy Policy at any time.\n9. Contact information\nIf you have any questions about the Privacy Policy or would like to complain about our handling of your personal data, please contact us by using one of the following contact details:\nEmail: FRsupport@tcl.com\nVersion: 1.0\n"];
var privacyPolicyTerms = [
    "Активиране на услугата Smart TV",
    "Приемам събирането, обработването и използването на времето за стартиране на устройството ми, списъка с DTV вканали, списъка с предпочитани канали, времето за посещение и преглежданите канали за целите на анализиране на навиците на потребителя за подобряване на услугата и/или за анализиране колко потребителя на TCL има онлайн за ден/месец/година и споделянето на тази информация в телевизионните станции.",
    "Активиране на услугата за препоръки",
    "Активирайте прилагане на втори екран за мобилни устройства.",
    "Активирайте автоматично актуализиране на софтуера.",
    "Активирайте услугата FreeviewPlay"
];
var privacyPolicyTips = [
    "Всички услуги Smart TV ще бъдат деактивирани.",
    "Услугата HbbTV, която се осигурява от ТВ канали, ще бъде деактивирана при използване на вграден тунер.",
    "Услугата за препоръчване на съдържание и ТВ програми ще бъде деактивирана.",
    "Услугата за втори екран ще бъде деактивирана.",
    "ТВ няма да проверява автоматично за софтуерни актуализации и нови функции.",
    "Съдържанието от FreeviewPlay ще бъде деактивирано."
];
var privacyPolicyRemind = "Поставете отметка в съответното поле за отметка в Настройки.";
var set = "задаване";
var copyShopDemoTips = ["Има свързано USB устройство. Искате ли да копирате видеоклипа на паметта?","Копиране на видеоклипа на паметта","Видеоклипът е копиран успешно!","Грешка при копиране на видеоклипа!"];
var dataDeletionWords = ["Изтриване на данните от услугата Smart TV от сървърите за окончателна обработка на данните.","Забележки: Свързаните с вашия потребител на Smart TV данни ще бъдат изтрити в рамките на един месец след избора на този елемент. Обърнете внимание, че изтриването не оказва влияние върху съхранените на телевизора данни.","Спиране на докладването на данните на сървъра на Smart TV.","Забележки:  Данните ви във връзка с използването на услугите Smart TV вече няма да бъдат прехвърляни на сървърите след избора на този елемент. Вашият телевизор вече няма да получава препоръчвани услуги.","Ако искате да научите повече, вижте нашия уебсайт www.tcl.eu"];
var miracastWords = ["Свързване на безжична мрежа","Огледално изобразяване на телефон с Android на ТВ","Кликнете за свързване","Тази функция е достъпна само на телефони с Android"];
var miracastTips = ["Стъпки за свързване","Отваряне на системните настройки","Още начини на свързване \n / Други безжични връзки","Избор на безжичен дисплей","Кликнете за свързване \n изчакване за намиране"];
var termsAndConditions = ["\nThe contents and services (collectively the \"Licensed Application\") made available to you through this TV set (this \"Device\") are licensed, not sold, to you for use only under these terms and conditions. The providers of the Licensed Application (each an \"Application Provider\") reserve all rights not expressly granted to you.\n\n1.Scope of License\n\nThe license granted to you for a Licensed Application by the relevant Application Provider is limited to a non-transferable license to use the Licensed Application on the Device that you own or control. You may not distribute or make the Licensed Application available over a network where it could be used by multiple devices at the same time. You may not rent, lease, lend, sell, redistribute or sublicense the Licensed Application. \n\nAll Licensed Applications and all contents included therein that are accessible through this Device belong to the Application Provider and are protected by applicable intellectual property laws. Unless otherwise permitted by applicable law, you may not modify, copy, decompile, reverse engineer, disassemble, republish, upload, post, transmit, translate, attempt to derive the source code of, create derivative works of, or otherwise exploit any Licensed Application or any updates or any part thereof. If you breach this restriction, you may be subject to prosecution and damage claims. The terms of the license will govern any upgrades provided by the Application Provider that replace and/or supplement the original Licensed Application, unless such upgrade is accompanied by a separate license in which case the terms of that license will govern. You shall be solely responsible for any and all costs (if any) for the upgrading of the Licensed Application.\n\n2.Third-party Materials\n\nThe Licensed Application may enable access to Application Provider’s and third party services and web sites (collectively the \"Services\"). By using any of the Services, you may encounter contents that may be deemed offensive, indecent, or objectionable, which contents may or may not be identified as having explicit language, and that the results of any search or entering of a particular URL may automatically and unintentionally generate links or references to objectionable material. Nevertheless, the manufacturer of this Device (the \"Manufacturer\") and the Application Provider shall not have any liability to you for contents that may be found to be offensive, indecent, or objectionable. \n\nThe Manufacturer shall not be responsible for examining or evaluating the content, accuracy, completeness, timeliness, validity, copyright compliance, legality, quality or any other aspect of such Services. The Manufacturer does not warrant or endorse and shall not assume and shall not have any liability or responsibility to you or any other person for any of the Services. \n\nThe Services may contain proprietary content, information and material (collectively \"Third-party Materials\") that are protected by applicable intellectual property and other laws, and you shall not use such Third-party Materials in any way whatsoever except for permitted use of the Services. Unless otherwise permitted by applicable law, you shall not reproduce, modify, rent, lease, loan, sell, distribute the Third-party Materials or create derivative works thereof in any manner, and you shall not exploit the Services in any unauthorized way whatsoever. You shall not use the Services in any manner to harass, abuse, stalk, threaten, defame or otherwise infringe or violate the rights of any other party, and the Manufacturer shall not in any way be responsible for any such use by you, nor for any harassing, threatening, defamatory, offensive or illegal messages or transmissions that you may receive as a result of using any of the Services. \n\n3.No Warranty\n\nAll Licensed Applications and Services are provided \"as is\" and \"as available\" without warranty of any kind, either express or implied. The Manufacturer expressly disclaims all warranties and conditions with respect to the Licensed Applications and the Services, either express or implied, including but not limited to, warranties of merchantability, of satisfactory quality, of fitness for a particular purpose, of accuracy, of quiet enjoyment, and of non-infringement of third party rights. The Manufacturer does not guarantee the accuracy, validity, timeliness, legality, or completeness of any Licensed Application or Service made available through this Device and does not warrant that the Device, the Licensed Applications or the Services will meet your requirements, or that operation of the Licensed Applications or the Services will be uninterrupted or error-free, or that defects in the Licensed Application or Services will be corrected. Should the Licensed Application or Services prove to be defective, you shall assume the entire cost of all necessary servicing, repair or correction.\n\nThe Licensed Applications and Services may be changed, suspended, removed, terminated or interrupted, or access may be disabled at any time, without notice, and the Manufacturer makes no representation or warranty that any content or service included in the Licensed Applications and Services will remain available for any period of time. Such contents and services are transmitted by third parties by means of networks and transmission facilities over which the Manufacturer has no control. Without limiting the generality of the foregoing, the Manufacturer expressly disclaims any responsibility or liability for any change, interruption, disabling, removal of or suspension of any content or service made available through this Device. The Application Provider and other providers of the Services reserve the right to change, suspend, remove, or disable access to any Licensed Application or Services at any time without notice. The Manufacturer may also impose limits on the use of or access to certain Licensed Applications or Services, in any case and without notice or liability.\n\nThe Manufacturer does not provide customer service related to the Licensed Applications and the Services. Any question or request for service relating to the Licensed Applications and the Services should be made directly to the respective provider.\n\n4.Collection and Use of Information\n\nThe Manufacturer, the Application Providers and the providers of the Services may collect and use technical data and related information, including but not limited to technical information about this Device, system and application software, and peripherals, to facilitate the provision of software updates, product support and other services to you (if any) related to the Device and the Licensed Application. The Manufacturer, the Application Providers and the providers of the Services may use such information, as long as it is in a form that does not personally identify you, to improve its products or to provide services or technologies to you. For more information on the collection and use of information, please visit our privacy policy: http://www.tcl.eu/en/.\n\n5.Unavailability of Certain Features\n\nDue to restrictions of Application Provider, certain features, applications, and services may not be available on this Device (including its peripheral devices) or in all territories. Some features on this Device may also require additional peripheral devices or membership fees that are sold separately.\n\n6.Limitation of Liabilities\n\nTo the extent not prohibited by applicable law, under no circumstances, including negligence, shall the Manufacturer be liable, whether in contract or tort, for any direct, indirect, incidental, special or consequential damages, attorney fees, expenses, or any other damages arising out of, or in connection with, any information contained in, or as a result of the use of the Device, any Licensed Application or any Service by you or any third party, even if advised of the possibility of such damages.\n\nThe Manufacturer shall only be liable for intent and gross negligence."];
var privacyNotice = ["\nWe respect your privacy when handling your personal data. This Privacy Notice describes the entity responsible for the processing of personal data we collect from you in connection with the use of our Smart TV services (\"Services\"), what types of personal data we collect about you, what we do with it, and your rights in relation to our use of the personal data. \n\n1.Data controller and representative in the European Union\n\nThe collection, processing and use of the personal data collected from you when using the Services is conducted by Shenzhen TCL New Technology Co., Ltd., No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, China (\"Company\"). Our contact details as well as the contact details of our representative in the European Union are provided under Section 12 below. Please note, however, that we are not responsible for all data processing activities set out below. We have nevertheless included a description of the respective activities in our Privacy Notice because this processing is connected with your use of the Smart TV.\n\n2.Data processing consent\n\nSome of the data processing activities that we conduct require your consent, e.g. the use of your personal data for the purpose of improving the Services.\n\nConsent is voluntary and you will still be able to use the Services if you do not consent. However, you may see content that is not tailored to your preferences. Irrespective of your consent we reserve the right to process your personal data to the extent permitted by applicable law.\n\nYou may withdraw your consent at any time. The withdrawal of consent shall not affect the lawfulness of processing based on consent before its withdrawal. In order to withdraw your consent and/or to object (c.f. Section 10 and Appendix Your Rights below for your rights to object), please change the privacy settings of your Smart TV accordingly.\n\n3.Specific categories of personal data\n\nWe process in particular the following data categories:\n\nDevice-ID: Your Smart TV stores a fixed unique number that enables us to identify and authenticate the Smart TV when you use the Services. This number is called the Device-ID. \n\nIP address and MAC address: Your Smart TV will be assigned an IP address when accessing the Internet. If your Smart TV is behind a router (e.g. in a local home network or local WLAN), we may process the IP address of such router. The MAC address is a unique number assigned to each network interface of your Smart TV. \n\nDevice specific information: The Smart TV stores several information about itself and its configuration. This information includes the Smart TV type, the version of the operation system of the Smart TV, its panel resolution, the project ID (i.e. information regarding configuration files), the user agent, browser name, browser version, and the language and country that have been configured in the Smart TV. \n\nThese information will be used by us and will be provided to our service partner and content partners for the purposes described below.\n\n4.Purposes for which we process and/or use your personal data and legal bases\n\nThe purposes for which we process your personal data and the respective legal bases are described below. To the extent that contractual purposes are mentioned below as legal basis, we cannot provide you with the Services if you do not provide us with the respective data. To the extent that your consent is mentioned as legal basis, you are free to provide or withhold your consent. If you do not provide your consent, we will not process your personal data for the respective purpose.\n\n•Providing the Services: We use the IP address and MAC address, Device-ID, the version of the operation system of the Smart TV, client type of your Smart TV and its panel resolution, the project ID (i.e. information regarding configuration files), your DTV channel list, viewed channels, time zone, country and language settings to provide your Smart TV with access to the Services and services provided by content partners. Purposes include (but are not limited to) providing location based services to you (e.g. weather forecasts); abuse handling, management of security incidents, monitoring of availability of the Services, and providing backup services of user preferences.\n\nWhen you use the Services your Smart TV will request data from the Services via the Internet. As part of these requests your IP address as described above and the language and country that has been configured in your Smart TV will be transmitted to our service partner. Our service partner will process the respective data in accordance with its privacy notice.\n\nThe legal basis for the respective processing of your personal data are contractual purposes pursuant to Article 6 (1) b) General Data Protection Regulation (“GDPR”).\n\n•Service Settings: As part of the regular functionality of the Services you can manually arrange the order in which apps are displayed by the Services. Our service partner will store your arrangement and other preferences you may set during use of the Services. This information will be linked to the Device-ID.\n\nThe legal basis for the respective processing of your personal data are contractual purposes pursuant to Article 6 (1) b) GDPR.\n\n•Authentication: Whenever you connect your Smart TV to the Internet and turn on the Smart TV, it will automatically connect to the Services, which are managed by our service partner. Your Smart TV will then be authenticated as being certified for access to the Services. For authentication purposes, the Services store one or more unique numeric identifiers related to your Smart TV. We use the Device-ID and MAC address for authentication purposes. We also provide the Device-ID to selected content partners for authentication purposes. These content partners use the Device-ID to authenticate your Smart TV for access to services provided by a content partner.\n\nThe legal basis for the respective processing of your personal data are contractual purposes pursuant to Article 6 (1) b) GDPR.\n\n•Remote diagnostics: As part of the Services, we provide you with remote diagnostic services. Therefore, we process the Device-ID, device number, serial number, MAC address, and error logs, error codes and error descriptions which are provided by the faulty module (application, middleware system).\n\nThe legal basis for the respective processing of your personal data are contractual purposes pursuant to Article 6 (1) b) GDPR.\n\n•After-sales service: Pursuant to applicable law you may have warranty or similar rights to obtain after-sales services. TCL Europe, 9-15 rue Rouget de L'Isle- 92130 Issy- Les-Moulineaux, France is responsible for handling warranty claims and other requests for after-sales services and the processing of your personal data associated therewith. I.e., for the purposes of after sales services, TCL Europe acts as data controller and we are not responsible for the respective processing of your personal data.\n\nWhen you ask for our after-sales related service, your name, e-mail address, phone number, service request and postal address included in the invoice may be required for the purpose of providing you with the after-sales service. The information may also be collected through the after-sales partners of our resellers or authorized service providers if you call them for service. You can contact TCL Europe under the contact details stated in Section 12 below for more information about the protection of personal data in connection with after-sales services.\n\nThe legal basis for the respective processing is the obligation to comply with legal obligations pursuant to Article 6 (1) c) GDPR.\n\n•T-Launcher: T-Launcher is the main page for the use of the Smart TV on Linux operating system (please see below for the use of the android operating system) and allows you to select certain content.\n\nThe legal basis for the processing of your personal data that is necessary for your use of the T-Launcher are contractual purposes pursuant to Article 6 (1) b) GDPR.\n\nSubject to your prior consent, we will also monitor the use of the T-Launcher, i.e.:\n\n-	When you start to use T-Launcher, we will record the time of entering and exiting T-Launcher.\n-	When you start to play a video of T-Launcher, we will record the name and the duration time of the video (not applicable to Netflix, YouTube or any other service provided by a third party).\n-	When you enter or exit a page, we will record the staying time on the page.\n-	When you move your cursor from one location to another, or enter an application, we will record this event.\n-	When you install, remove or update applications, we will record these events, including the name of applications.\n\nWe collect these information mainly for big data analysis to improve products and to provide better content services to users.\n\nThe legal basis for the processing of your personal data in connection with the monitoring of your use of the T-Launcher is your consent pursuant to Article 6 (1) a) GDPR.\n\nIf you have bought an Android TV and use Google’s android operating system, your personal data will be processed by Google and we are not responsible for such processing. Please refer to Google’s privacy notice for information about the related processing of your data and your respective rights.\n\n•T-Cast: T-Cast allows you to control your TV using your phone and to share videos, music and pictures stored in your smart phone on the TV. T-Cast also allows you to mirror your smartphone on your TV.\n\nThe download and use of the app is voluntary. If you download and use the app, we will process the MAC address to calculate how many T–Cast versions have been used in the market. This is required to be able to offer you this service. If you use our second screen functionality, the controls you activate on the application and the country and language settings, DTV channel list, favorite channels lists, schedule lists, Device-ID, current channel, protocol version and IP address of your Smart TV will be collected and processed by us on our servers. Our servers will then control your Smart TV as directed by you in the app.\n\nThe legal basis for the respective processing of your personal data are contractual purposes pursuant to Article 6 (1) b) GDPR.\n\n•Software updates: Software updates are part of the Services. Thus, each time your Smart TV is powered on, it will provide us with the IP address, Device-ID, device number, software version, client type of your Smart TV, project ID (i.e. configuration files), user ID, and serial number to look whether software updates are available and to offer you and provide you with appropriate software updates.\n\nThe legal basis for the respective processing of your personal data are contractual purposes pursuant to Article 6 (1) b) GDPR.\n\n•Law enforcement: We may be required to provide data to competent law enforcement authorities or courts of justice. If we do so, we will only do so subject to a binding legal instrument like a warrant or a judicial order, which requires us to cooperate with the relevant authorities.\n\nThe legal basis for the respective processing is our obligation to comply with legal obligations pursuant to Article 6 (1) c) GDPR.\n\nUse of the Services is possible by using pseudonyms, unless specific services require that you provide your name and/or email address.\n\n5.Privacy and safety of children under 16\n\nWe understand the importance of taking extra precautions to protect the privacy and safety of children using our Services. Children under the age of 16, or equivalent minimum age in the relevant jurisdiction, are not permitted to provide their personal information via the TV set or when they call for after-sales service, unless their parent provided verifiable consent.\n\nAs we never collect birth dates of users, we can't identify the age of users. But if we learn that we have collected the personal information of a child under 16, or equivalent minimum age depending on the jurisdiction, outside of the above circumstances we will take steps to delete the information as soon as possible.\n\n6.Third party apps\n\nYour Smart TV allows the use of apps provided by third parties, such as Netflix, YouTube or HbbTV (red button service provided by TV broadcasters). You may download the apps from the app store or activate third party apps that are already pre-installed on your device. Third party apps that are pre-installed on your device do not collect personal data without your prior authorization. E.g. Netflix is already pre-installed on the device but only collects data when you log into your Netflix account. HbbTV only collects data when you consent to the collection by pressing the designated button on your remote control.\n\nIf you enable a third party app, personal data about you may be processed by the app provider. We are not responsible for such processing; please refer to the privacy notice of the third party app for information about the related processing of your data and your respective rights.\n\n7.Categories of recipients\n\nWe share your personal data collected during your use of the Services only with third party content partners if you request certain content provided by such content partners or with service providers as data processors assisting us with the provision of the Services.\n\nWe share your personal data with other third parties only if we are obligated to do so on the basis of legal requirements (e.g. to courts or criminal prosecution authorities), if you have consented to the respective sharing or if the sharing is otherwise lawful under applicable law.\n\n8.Countries in which your data will be processed\n\nWe and/or some of the recipients of your personal data listed above may be located outside of the European Economic Area (e.g. in the Peoples Republic of China, or United States of America). Therefore, your personal data may be processed in countries where the data protection laws may provide a different level of protection compared to the laws in your jurisdiction and which are not recognized as providing an adequate level of protection of personal data in accordance with the GDPR. The countries which provide an adequate level of data protection from a European data protection law perspective include Andorra, Argentina, Canada, Switzerland, Faeroe Islands, Guernsey, the State of Israel, Isle of Man, Jersey, New Zealand and the Eastern Republic of Uruguay. Recipients in the USA may partially be certified under the EU-U.S. Privacy Shield and thereby recognized as providing an adequate level of data protection from an European data protection law perspective. \n\nWhere required, we will implement appropriate safeguards with regard to data transfers to recipients outside of the European Union that do not provide an adequate level of data protection. A copy of the respective measure may be requested by contacting us as stated under Section 12. below.\n\n9.Storage Period\n\nYour personal data will be retained as long as necessary to provide you with the Services. For most data this generally means that we will retain your data for one month. For the purpose of remote diagnostics and after-sales services we may retain your data up to ten years. When we no longer need to use your personal data to comply with contractual or statutory obligations, we will remove it from our systems and records and/or take steps to properly anonymize it so that you can no longer be identified from it.\n\n10.Your rights\n\nPursuant to applicable data protection law you may have the right to: request access to your personal data, request rectification of your personal data; request erasure of your personal data, request restriction of processing of your personal data; request data portability, and object to the processing of your personal data. Please note that these aforementioned rights might be limited under the applicable national data protection law. For further information on these rights please refer to the Appendix Your Rights below.\n\nYou also have the right to lodge a complaint with the competent data protection supervisory authority.\n\nTo exercise your rights please contact us as stated in Section 12 below.\n\n11.Changes to the Privacy Notice\n\nTo improve our Services we may require amendments to this Privacy Notice – e.g. by the implementation of new technologies or the introduction of new services. We reserve the right to change or supplement this Privacy Notice at any time.\n\n12.Contact information and representative in the European Union\n\nIf you have any questions about the Privacy Notice or would like to complain about our handling of your personal data, please contact us by using the following contact details:\n\nContact form: www.tcl.eu/privacy/support\n\nOur representative in the European Union is: TCL Europe having offices at 9-15 rue Rouget de L'Isle- 92130 Issy- Les-Moulineaux, France. You may contact TCL Europe via the contact form stated above.\n\nVersion: 2.0\n\nAppendix Your Rights\n\na.Right of access: You may have the right to obtain from us confirmation as to whether or not personal data concerning you is processed, and, where that is the case, to request access to the personal data. The access information includes - inter alia - the purposes of the processing, the categories of personal data concerned, and the recipients or categories of recipients to whom the personal data have been or will be disclosed. However, this is not an absolute right and the interests of other individuals may restrict your right of access.\n\nYou may have the right to obtain a copy of the personal data undergoing processing. For further copies requested by you, we may charge a reasonable fee based on administrative costs. \n\nb.Right to rectification: You may have the right to obtain from us the rectification of inaccurate personal data concerning you. Depending on the purposes of the processing, you may have the right to have incomplete personal data completed, including by means of providing a supplementary statement.\n\nc.Right to erasure (\"right to be forgotten\"): Under certain circumstances, you may have the right to obtain from us the erasure of personal data concerning you and we may be obligated to erase such personal data. \n\nd.Right to restriction of processing: Under certain circumstances, you may have the right to require the restriction of processing of personal data concerning you. In this case, the respective data will be marked and may only be processed by us for certain purposes.\n\ne.Right to data portability: Under certain circumstances, you may have the right to receive the personal data concerning you, which you have provided to us, in a structured, commonly used and machine-readable format and you may have the right to transmit those data to another entity without hindrance from us.\n\nf.Right to object:\n\nUnder certain circumstances, you may have the right to object, on grounds relating to your particular situation, or where personal data are processed for direct marketing purposes at any time to the processing of your personal data by us and we can be required to no longer process your personal data.\n\nMoreover, if your personal data is processed for direct marketing purposes, you have the right to object at any time to the processing of personal data concerning you for such marketing, which includes profiling to the extent that it is related to such direct marketing. In this case your personal data will no longer be processed for such purposes by us."];
var cookieNotice = ["\nWe respect your privacy when using Smart TVs manufactured and Services provided by us. Cookies are used by many websites and other internet services and your Smart TV will accept, store and transmit cookies to ensure that these websites and services operate properly. \n\nWe do not use cookies when providing the Services to you. However, third parties (e.g. third party app providers) may use cookies when you use the Smart TV to access their services. This Cookie Notice can only provide limited information concerning cookies that may be placed by third parties. For information on the actual cookies used by third parties and their functionalities we refer you to the respective cookie notices of such third parties. However, in this Cookie Notice we provide a general description which cookies can be set on your Smart TV and how you can manage them.\n\n1.What is a cookie?\n\nCookies are small text files that may be placed on your Smart TV. When a website or the red-button service of a TV station is accessed, the website or service may store a cookie in the Smart TV. During subsequent accesses, a cookie that is placed on your Smart TV will send information to the party that has placed the cookie. Cookies are extremely common and used on a number of websites and services. Each cookie will typically contain the name of the domain from which the cookie has come, the \"lifetime\" of the cookie, and a value (usually a unique number). For a more thorough explanation of what cookies are and how they operate, please visit www.allaboutcookies.org.\n\nCookies can be categorized into functional cookies and non-functional cookies. Functional cookies are cookies that are strictly required for the purpose of providing you services. Non-functional cookies are all other cookies.\n\n2.Third party websites\n\nWhen you visit websites or services of third parties via the Services of your Smart TV, it is possible that such websites or services place cookies on your Smart TV, and that such websites track and store your interactions on such websites. We do not request or encourage such activities and will not use such information. Please refer to the respective cookie and privacy notices of such websites and services for more information about such parties’ use of such cookies.\n\n3.Cookie deletion\n\nYour user interface of your Smart TV allows you to delete all cookies and other local browser storage from the Smart TV. It is highly advisable to remove all cookies and locally stored settings prior to selling or giving away your Smart TV.\n\nVersion: 2.0"];
var privacyPolicy = ["Поставете отметки по-долу, ако искате да използвате нашите услуги за Smart TV и свързаните с тях услуги. Използването на тези услуги изисква обработка на Вашите лични данни, както е описано в нашата Декларация за поверителност: http://www.tcl.eu/en/","Активиране на услуга за Smart TV, съхраняване на настройките за услугата и автоматично удостоверяване на Smart TV. Ако премахнете тази отметка, ще ползвате само стандартна телевизия и HDMI.","Активиране на автоматично актуализиране на софтуера. Поставете тази отметка, за да получавате последни актуализации на софтуера и най-добри резултати.","(Актуализациите на софтуера са важни за правилното функциониране на телевизора, тъй като осигуряват нови функции, стабилност и сигурност. Затова препоръчваме да поставите тази отметка.)","Поставете следващата отметка, ако сте съгласни да обработваме Вашите лични данни за изброените по-долу цели. За допълнителна информация относно начина, по който обработваме Вашите лични данни, вижте нашата Декларация за поверителност: http://www.tcl.eu/en/","Давам съгласието си за обработка на моите лични данни (напр. час на влизане и излизане от T-Launcher) с цел усъвършенстване на продуктите на TCL и подобряване на услугите за предоставяне на съдържание за Smart TV."];
var termsFirTitle = ["Общи условия","Забележка за поверителността","Забележка за бисквитки"];
var termsSecTitle = ["Прочетете условията за употреба и ги приемете.","Прочетете забележката за поверителността и я приемете.","Прочетете забележката за бисквитки и я приемете."];
var tickall = "Поставяне на отметка на всички";
var tickremindWords = "Поставете отметка на съответните полета или няма да можете да се наслаждавате на услуги за Smart TV.";