
var all_country 	= ["Австралія","Австрія","Бельгія","Болгарія","Хорватія","Чеська республіка","Данія","Фінляндія","Франція","Німеччина",
						"Греція","Угорщина","Італія","Люксембург","Нідерланди","Норвегія","Польща","Португалія","Румунія","Росія",
						"Сербія","Словенія","Іспанія","Швеція","Швейцарія","Велика Британія","Нова Зеландія"," "/*Arab*/,"Естонія"," "/*Hebrew*/,
						"Латвія","Словаччина","Туреччина","Ірландія","Japan","Філіппіни","Thailand","Maldives","Uruguay","Peru",
    					"Argentina","Chile","Venezuela","Ecuador","Costa Rica","Paraguay","Bolivia","Belize","Nicaragua","Guatemala",
						"Китай","Taiwan","Brazil","Canada","Mexico","United States","South Korea","Румунія","Vietnam"/*新添加的，底层结构体中没有*/,"Україна"/*新添加的，底层结构体中没有*/,
    					"Iran","Iraq"," ","Kazakhstan","Uzbekistan"," ","Kyrgyzstan","Algeria","Egypt","Tunisia",
    					"Tanzania","Kenya","Pakistan","Indonesia","Kuwait","Saudi Arabia","Qatar","Israel","Lebanon","bahrain",
    					"Angola","Congo","India","Turkmenistan","Colombia","Mongolia","Bangladesh","Nepal","Sri Lanka","North Korea",
						"Молдова","Polynesia","EI Salvador"," ","Fiji","Liberia","Jordan","Myanmar","Ghana","Georgia",
    					"Armenia","Oman","yemen","Syria","Palestine","Afghanistan","Morocco","benin","IvoryCoast","Nigeria",
    					"Sudan","Ethiopia","Zambia"," ","South Africa","mozambique","Libya","Албанія","Belarus","Iceland",
						"Литва","Mauritius","Dubai","UAE","Tajikistan","Bengal","Боснія і Герцеговина","Кіпр","Косово","Македонія",
						"Мальта","Чорногорія","Cameroun","Singapore","Malaysia","NewCaledonia","Suriname","Jamaica","Curacao","Aruba",
    					"Antigua & Barbuda","St Lucia","Barbados","St Vincent","St Kitts & Nevis","Grenada","Trinidad & Tobago","Guyana","Puerto Rico","Panama",
	/*15*/ 				"Dominica","Cuba","Honduras","Haiti","Cambodia","Zimbabwe","Dominican Republic","Bonaire","Somalia","Azerbaijan",
    					"Uganda","Rwanda","Guinea","Burundi","Abkhazia","Andorra","Anguilla","Antarctica","American Samoa","Aland Island",
    					"Burkina-faso","Bermuda","Brunei","Caribbean Netherlands","Saint Barthélemy","Bahamas","Bhutan","Bouvet Island","Botswana","Cocos (Keeling) Islands",
    					"Central African Republic","Cape Verde","Djibouti","Eritrea","Western Sahara","Falkland Islands","Federated States of Micronesia","Faroe Islands","Gabon","Cook Islands",
    					"Gibraltar","Greenland","French Guiana","Guadeloupe","Equatorial Guinea","Guam","Guinea-Bissau","Heard Island and McDonald Islands","Isle of Man","British Indian Ocean Territory",
				/*20*/"Jersey","Kiribati","Comoros","Cayman Islands","Liechtenstein","Lesotho","Monaco","Saint Barthélemy","Madagascar","Mali",
    					"Macao","Martinique","Mauritania","Montserrat","Malawi","Namibia","Niger","Norfolk Island","Nauru","Papua New Guinea",
    					"Pitcairn Islands","Palau","Reunion Island","Solomon Islands","Seychelles","The Svalbard archipelago","Sierra Leone","San Marino","Senegal","South Sudan",
    					"Sao Tome & Principe","Swaziland","Turks & Caicos Islands","Togo","Chad","Tokelau","Timor-Leste (East Timor)","Tonga","Tuvalu","Vatican City State",
    					"British Virgin Islands","United States Virgin Islands","Wallis and Futuna","Samoa","Mayotte","Democratic Republic of the Congo","Guernsey","Gambia","Northern Mariana Islands","French Southern Territories",
					/*25*/"Niue","United States Minor Outlying Islands","Others"];
				
var all_language 	= ["Чеська","*","Датська","*","*","Німецька","Англійська","Іспанська","Грецька","Французька",
						"Хорватська","*","Італійська","Угорська","Голландська","Норвезька","Польська","Португальська","Російська","Румунська",
						"Словенська","Сербська","Фінська","Шведська","Болгарська","Словацька","Chinese","*","Гальска","*",
						"Уельська","Арабська","Ірландія","Латвійська","*","Турецька","Естонська","Голландська"/*Netherlands*/,"Корея","*",
						"Hindi","*","*","Mandarin","Cantonese","Maori","V.O."/*Qaa*/,"Не визначено"/*Undetermined*/,"*","Невідомий",
						"Не визначено","*","*","*","*","*","*","*","*","*",
						"*","*","*","Албанська","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","Баскська","*","*",
						"*","*","*","*","*","*","*","Боснійська","*","*",
						"*","*","*","*","Білоруська","*","*","Каталонська","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Галісійська","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Ісландська","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","Japanese","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Литовська",
						"*","*","*","*","*","*","*","Македонська","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Романтика","*","*","*","*",
						"*","*","*","Sami","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Телетекст",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","Українська","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","ChineseTraditional","*"];
var offOn			= ["Вимкнути","Увімкнути"];
var okCancel		= ["ОК","Скасувати"];
var yesNo			= ["ТАК","НІ"];
var level			= ["Вимкнути","Низький рівень","Високий","Середній рівень"];
var manualAuto		= ["Ручний","Авто"];
var homeShop		= ["Дім","Крамниця"];
var picPreset		= ["Стандарт","динамічна","Природний","Кіно","Особистий"];
var picColorTemp	= ["Прохолодний","Нормальний","Теплий","Користувацький режим"];
var pic3dNavig		= ["Ручний","Авто","Напівавто"];
var _3dOptions		= ["Режим 3D","3D-у-2D","Перемикач L-R","Глибина різкості"];
var pic3DMode       = ["Вимкнути","2D-у-3D","Пліч-о-пліч","Верх і низ","Чергування стрічок"];
var picEcoOptions	= ["Енергозбереження","Датчик освітленості","Часткове затемнення","Змішане затемнення"];
var picGeoOptions	= ["Геометрія","Горизонтальне положення","Вертикальне положення","Годинник","Етап"];//Geometry 无翻译
var picAdWhiteBal	= ["Рівень червоного","Рівень зеленого","Рівень синього","Зсув червоного","Зсув зеленого","Зсув синього"];
var souOptions		= ["Попередня настройка звуку","Баланс","Затримка аудіо","SRS TSHD","Автоматичний контроль гучності",
						"Цифровий інтерфейс типу SPDIF","Затримка SPDIF","Розташування телевізора","Мова аудіо","Тип звуку",
						"Опис аудіо","Підсилення нижніх частот","Dolby Digital Plus"];
var souSpdifType	= ["Авто"/*Dolby*/,"PCM","Вимкнути"];
var colorSpace      = ["Авто","Рідний","Користувацький режим"];
var souPresetPara	= ["100Hz","500Hz","1.5KHz","5KHz","10KHz"];
var chOptions		= ["Пошук каналів","Список каналів","EPG","Упорядковувач каналів","Діагностика каналів",
						"зсув у часі","Субтитри","Телетекст","Тип списку каналів"];//Channel diagnostics 、Channel organizer 无翻译
var chDiagOptions	= ["Потужність сигналу","Якість сигналу","Частота (кГц)","Служб. ідентифік.","ID мережі","Мережне ім'я"];
var chScanOptions	= ["Країна/регіон","Режим тюнера","Автоматичний пошук","Автоматичне оновлення","Пошук вручну аналогових каналів",
						["Ручний пошук кабелю","Ручний пошук антени","Ручне налаштування супутника"],"Налаштування супутникової антени","Вибір улюбленої мережі","Очистити список каналів","LCN"];
var favNetDes		= "Виберіть уподобану мережу";
var tuner			= ["Кабель","Aнтена","Супутник"];//Satelite 无翻译
var passError		= "Пароль невірний.\nБудьласка, введіть знову!";
var chType			= ["Аналогові канали: ","Цифрові канали: "];
var chScanStatus	= ["Стан:  Сканування","Стан:  Пошук завершено","Стан:  Пошук скасовано","Стан:  Помилка пошуку"];
var chScanPara		= ["Частота (кГц)","Модуляція","Шв. перед. (тис.симв./с)","ID мережі","Система",
						"Точна настройка","Потужність сигналу","Якість сигналу","Режим сканування","Ідентифікатор каналу"];
var chScanParaMHZ      = ["Частота (MHz)"];
var chAtvManSys		= ["Західна Європа","Східна Європа","Великобританiя","Франція"];
var modulation		= ["Модуляція 16QAM","Модуляція 32QAM","Модуляція 64QAM","Модуляці. 128QAM","Модуляці. 256QAM","Авто"];
var chCleanDes		= "Бажаєте очистити список каналів?";
var chDeletDes		= "Бажаєте видалити канали?";
var chOperator		= ["Ziggo","UPC","Інше"];
var chScanType		= ["Цифровий & Аналоговий","Цифровий","Аналоговий"];
var chScanMode		= ["Повний","Вперед","Швидко"];
var bookingModes	= ["Запис","Нагадування"];
var dayName			= ["Hеділя","Понеділок","Вівторком","Cереда","четвер","п'ятниця","Субота"];
var monthName		= ["Січ.", "Лют.","Бер.","Квіт.","Травень","Черв.","Лип.","Серп.","Вер.","Жов.","Лист.","Груд."];
var filter			= ["Фільтр","Тип","Підтип"];
var chEpgFirstGenre	= ["Кіно","Новини","Шоу","Спорт","Дитячі","Музика","Мистецтво","Соціальні","Освіта","Дозвілля","SPECIAAL"];
var chEpgSecondGenre= [["Драма","Детектив","Пригоди","Наукова фантастика","Комедія","Мелодрама","Романтика","Серйозні","Фільми для дорослих"," "," "," "],
						["Поточні події","Прогноз погоди","Інформаційно-аналітичні програми","Документальні програми","Дискусії"," "," "," "," "," "," "," "],
						["Шоу","Ігрові шоу","Естрадно-розважальні шоу","Ток-шоу"," "," "," "," "," "," "," "," "],
						["Спорт","Особливі події","Спортивні журнали","Футбол","Теніс",
							"Командні види спорту","Атлетика","Мотоспорт","Водні види спорту","Зимові види спорту",
							"Кінний спорт","Єдиноборства"],
						["Дитячі","Для дошкільнят","Розважальні програми для дітей від 6 до 14 років","Розважальні програми для дітей від 10 до 16 років","Інформаційні","Мультфільми"," "," "," "," "," "," "," "],
						["Музика","Rock","Серйозні","Фольк","Джаз","Мелодійна","Балет"," "," "," "," "," "],
						["Мистецтво","Виконавче мистецтво","Образотворче мистецтво","Релігія","Поп-культура",
							"Література","Кіно","Експериментальні програми","Трансляция телепередач","Нові медіа-технології",
							"Журнали про мистецтво","Мода"],
						["Соціальні","Журнали","Економіка","Знаменитості"," "," "," "," "," "," "," "," "],
						["Освіта","Природа","Технологія","Медицина","Зарубіжні країни","Суспільні науки","Подальша освіта","Мови"," "," "," "," "],
						["Хоббі та дозвілля","Туризм","Рукоділля","Автоспорт","Фітнес та здоров’я","Кулінарія","Реклама","Садівництво"," "," "," "," "],
						["Мова оригіналу","Чорно-білий","Неопублікований","Пряма трансляція"," "," "," "," "," "," "," "," "]];
var chOrganizer		= ["Пропустити канал","Сортування каналів","Редвгування каналів","Видалити канал","канал підкачки","каналу вста"];
var chEditPara 		= ["Мережне ім'я","Номер каналу","Назва каналу","Частота","Система кольорів ","Система звуку"];
var chSatTitles		= ["Тип супутника","Налаштування супутникової антени","Вибрати супутник"];
var chSatEidtOptions= ["Ім'я супутника","Положення","LNB влада","Частота LNB (МГц)","Вхід DiSEqC",
						"Сигнал 22 КГц","тональна посилка","Частота (кГц)","Шв. перед. (тис.симв./с)","Поляризація",
						"Потужність сигналу","Якість сигналу","Стан супутника"];
var chSatAutoPromt	= [["Всі","Мережа"],
						["Всі","Безкоштовно"]];
var chSatAutoScanOptions=["Вибрати супутник","Режим сканування","Канали"];
var chSatPosition	= ["A","B"];
var chSatLNBFreq	= ["Універсальний",];
var chSatDiSEqCInput= ["Вимкнути","A","B","C","D"];
var chSatTone22KHz	= ["Авто","Увімкнути","Вимкнути"];
var chSatToneBurst	= ["Вимкнути","тональна посилка A","тональна посилка B"];
var chSatPolarization= ["Горизонтально","Вертикально"];
var chSatSetupOptions=["Тип антени","Тюнер","Частотний діапазон"];
var chSatAntennaType= ["Один кабель","Універсальний"];
var chSatUserBands	= ["Діапазон корист. 1","Діапазон корист. 2","Діапазон корист. 3","Діапазон корист. 4","Діапазон корист. 5","Діапазон корист. 6","Діапазон корист. 7","Діапазон корист. 8"];
var chSatOthers		= ["Ретранслятор"];
var chSatSetupOthers= ["Визначений користувачем"];
var pleaseSelectSat = "Спочатку виберіть супутники!";
var subOptions		= ["Субтитри","Мова субт. цифр. Мовлення","Мова субт. цифр. мовлення 2","Тип субтитрів"];
var ttxOptionsCon      = ["Мова сторінки декодування","Мова цифрового телетексту"];
var subType			= ["Нормальний","Для осіб з вадами слуху"];
var netIntf     	= ["Етернет","Бездротовий"];
var netConnDes		= ["Виконується перевірка мережного зв'язку.\nЗачекайте",
						"Перевірка з'єднання з мережею пройшла успішно.",
						"Помилка перевірки з'єднання з мережею."];
var netSsidError	= "Припустима довжина ідентифікатора SSID становить від 1 до 32 символів. Перевірте ідентифікатор SSID.";
var netOthers		= ["PIN-код "];
var netWlessAutoDes	= ["Перед тим, як клацнути ОК, упевніться, що наступний ПІН-код встановлений в точку доступу.",
						"Натисніть кнопку на точці доступу упродовж 120 секунд перед тим, як клацнути ОК."];
var netConnRemind	= ["Пароль невірний!",
						"Підключення. Зачекайте!",
						"Зв'язок встановлено, ІР отримано!",
						"Помилка каналу",
						"Сканування ТД\nЗачекайте…",
						"До ТВ не підключено жодного бездротового пристрою!"];
var netWireIpOptions= ["Налаштування ІР","Тип адреси","ІР-адреса","Маска підмережі","Шлюз за замовчуванням","Основний DNS","Допоміжний DNS"];
var netWireConnRemind= ["Введіть значення від 0 до 255.",
						"Успішне підключення!",
						"Введіть припустиму адресу",
						"Успішне підключення!",
						"Підключення не виконано!",
						"Підключення. Зачекайте!",
						"Введіть значення від 1 до 223."];
var netFlixOptions	= ["Вимкнути","ESN","Версія Netflix"];
var netFlixDes	 	= ["Вимкнути цю функцію?"," "/*Are you sure that you want to ESN?*/];
var netUpdateTitle 	= "Онов-ня пр. забез-ня";
var netUpdateDialogTitle = "Оновлення програмного забезпечення";
var netBGDownloadTitle 	= "Завантаження";
var netUpdateLoadingPrompt= ["Триває пошук оновлення. Зачекайте!",
							"Завантаження програмного забезпечення... Зачекайте!",
							"НЕ вимикайте телевізор під час оновлення ПЗ!",
                            "Обов’язкове оновлення програмного забезпечення завантажується автоматично у фоновому режимі!"];
var netUpdatePrompt= ["Вітаємо! У вас найновіша версія ПО!",
						"Знайдено нову версію ПО XXXX. Бажаєте завантажити зараз? Це може зайняти певний час залежно від стану вашої мережі.",
						"Помилка входу!",
						"Не вдалося отримати дані. Повторіть спробу пізніше!",
						"Помилка XML аналізу оновлення!",
						"Помилка каналу",
						" Завантажити програмне забезпечення. Бажаєте запустити мигання?",
						"Дані втрачені! Помилка завантаження!",
						"Помилка перевірки пакета, повторіть спробу!",
						"Помилка мережі. Перевірте та повторіть з'єднання...",
						"Помилка оновлення. Вимкніть та увімкніть ТВ!",
						"Файл оновлення несподівано видалено. Повторіть оновлення через мережу.",
						"Програмне забезпечення успішно завантажено у фоновому режимі. Виконати оновлення?"];
var netUpdateButtonText = ["Завантажити", "Оновити", "Потім", "Ніколи", "ОК","Продовжити"];
var autoDetectPrompt = ["Знайдено нову версію ПО XXXX. Бажаєте завантажити зараз? Це може зайняти певний час залежно від стану вашої мережі.",
						"Знайдено нову версію ПО XXXX. Бажаєте оновити зараз?",
						"Останнього разу процес оновлення через мережу було перервано. Оновлення треба повторити.",
                        "Завантаження нової версії програмного забезпечення XXXX ще не завершено. Продовжити завантаження?",
                        "Програмне забезпечення завантажено. Оновити зараз?"];
var sysOptions		= ["Електронний посібник","Мова меню","Таймер","Заблокувати","Налаштування входу",
						"Онов-ня пр. забез-ня","Розташування","Режим HbbTV","Файли cookie","Загальний інтерфейс ",
						"додаткові налаштування","Відновити попередні налаштування","Світлодіодний індикатор","Швидке увімкнення","Режим автоматичного магазину","Area","Режим Демо"];
var sysResetDes		= "Ви впевнені?";
var sysMenuLangOptions=["Мова","Обрана мова звучання","Переважна друга мова аудіо"];
var sysTimerOptions	= ["Часовий пояс","Назва регіону","Годинник","Таймер переходу до сплячого режиму","Автом. очікування", "Country region"];

var sysTimeZone		= ["Як у телекомпанії","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00",
						"GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30",
						"GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00",
						"GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00",
						"GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00",
						"GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00",
						"GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];
var sysSleepTimer	= ["Вимкнути","10 хв","20 хв","30 хв","40 хв","50 хв","60 хв","90 хв","120 хв"];
var sysStandby		= ["Вимкнути","4 години","6 години","8 години"];
var sysRegionName	= ["Мадрид ","Канарські острови"];
var sysClockOptions	= ["Автоматична синхронізація","Дата","Час","Таймер включення","Таймер",
						"Увімкнути канал","Таймер вимкнення","Таймер"];
var sysTimer		= ["Вимкнути","Щодня","Один раз"];

var sysInputSet		= ["Без позначки ","DVD","Blu-ray","HDD","DVDR",
						"Запис HD відео","Гра","VCR","ПК","Цифровий декодер STB",
						"HD dig STB","Камера","Пристрій записування","Інше"];
var sysAvVideoInput	= ["Авто","RGB_CVBS","RGB","CVBS","S-Відео "];
var sysUpdate		= ["Через USB","Через мережі","За каналом"];
var sysUpdateDes	= [" ",
						" ",
						" ",
						"Відсутнє нове ПО для завантаження!",
						"Знайдено нову версію ПО XXXX. Бажаєте оновити зараз?",
						"Вставте USB-носій.",
						"Помилка перевірки пакета, повторіть спробу!",
						"Будь ласка, НЕ відключайте USB пристрій та не вимикайте телебачення під час оновлення мікропрограми!!",
						"Завантаження програмного забезпечення успішно завершено.\nТелевізор буде автоматично перезапущений!",
						"Знайдено нову версію ПО XXXX. Бажаєте завантажити зараз? Це може зайняти певний час залежно від стану вашої мережі.",
						"Завантаження",
						" Завантажити програмне забезпечення. Бажаєте запустити мигання?",
						"Помилка",
						"Пошук файлів оновлення",
						"ПЗ успішно оновлене.\nПерезапустіть телевізор."];
var sysProductInfo	= ["Поточна версія","Назва виробу","Ім'я виробника","Назва шасі"];
var sysCiDes		= ["Не пред’явлена картка CI."];
var sysAdOptions	= ["Реєстрація DivX®","Скасування реєстрації DivX(R)","T-Link","Authorization Error","Підтвердження дереєстрації",
						"Підтвердження аренди","Оренда завершилась"];
var sysRegistDes	= ["Для відтворення захищеного відео DivX необхідно зареєструвати ваш пристрій",
						"Код реєстрації:",
						"Реєстрація на http://vod.divx.com"];
var sysDregistDes	= ["Код скасування реєстрації:",
						"Скасуйте реєстрацію за адресою http://vod.divx.com",
						"Продовжити реєстрацію?"];
var mediaAuthorization = ["Ваш пристрій не має дозволу на відтворення цього захищеного відео DivX(R)."];
var deregistrationConfrimation = ["Ваш пристрій вже зареєстровано.","Дійсно скасувати реєстрацію?"];
var rentalConfirmation = "DivX(R) rental здійснено XXXX переглядів із YYYY. Продовжити?";
var rentalExpired 	= "Використано XXXX з YYYY переглядів DivX(R)-файлів. Термін дії підписки на перегляд DivX-файлів минув.";

var parentalRatingNA		= ["***","***","***","***","***","***","***","***"];
var parentalRatingOptionUS		= ["***","***","***"];
var sysTVRatingUS=["***","***","***","***","***"];
var sysMPAAUS=["***","***","***","***","***","***"];
var parentalRatingOptionCanada		= ["***","***","***"];
var sysCanadaEng=["***","***","***","***","***","***"];
var sysCanadaFre=["***","***","***","***","***",""];
var sysResetRRT=["***"];
						
var sysLockOptions	= ["Блокувати канал","Блокування час. інтервалу","Батьківська оцінка","Блок вводу","Блокування передньої панелi","Встановлення блокування",
						"Змінити пароль","Максимальна гучність","Видалити всі "];
var sysTimeIntervals= ["Тип блокування","Час початку","Час завершення"];
var sysRatingOptions= ["Жодний","4","5","6","7","8","9","10","11","12",
						"13","14","15","16","17","18","Тільки для дорослих (Іспанія)"];
var changePass		= ["Змінити пароль","Новий пароль","Підтвердити пароль"];
var changePassDes	= ["Пароль невірний.\nБудьласка, введіть знову!",
						"Пароль-підтвердження не співпадає з паролем.\n Будь ласка, введіть знову!",
						"Успішне встановлення паролю!",
						"Введений код занадто простий\nПовторіть ще раз!"];
var sysPowerOnChOptions= "Режим вибору";
var sysPowerOnCh	= ["Останній статус","Вибір користувача"];
var netWlessSecu    = ["Відкрити","WEP","WPA/WPA2-PSK "];
var netWlessSecu2	= ["Жодний","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK ",""];
var netWlessSecu3	= ["Жодний","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)",""];
var netOptions		= ["Інтернет-з'єднання","Інтерфейс","Налаштування безпроводової мережі","Налаштування IP","Інформація",
						"Перевірка з'єднання","DLNA","Пульт ДК","Налаштування Netflix ","Дисплей WiFi",
						"Тип адреси","ІР-адреса","Маска підмережі","Шлюз за замовчуванням","Основний DNS",
						"Допоміжний DNS","SSID","BSSID","Введіть SSID:","Ідентифікатор користувача"];
var chEditDes		= ["Дубльований номер каналу!","Натисніть червону кнопку, щоб видалити поточний символ!","Неприпустимі номери каналів"];
var chEpgNoProgram	= "Відсутня інформація про програму. Спочатку знайдіть канали!";
var chEpgWords		= ["Програма передач","Дані про передачі відсутні.","Канал заблоковано!","Докладна інформація про передачі відсутня.","Назви передач відсутні."];
var chEpgBooking	= ["Розклад інформація", "Номер каналу","Дата початку","Час початку","Час завершення",
						"Повторити","Графік","Додати","Замінити","Змінити",
						"Додати/модифікувати"];
var epgHotKey		= ["Попер. день","Наст. день","Фільтр","Запис за графіком","Додати графік"];
var chEpgBookRemind	= ["Неправильний час початку","Неправильний час закінчення","Дубльований розклад","Успішне збереження.","Успішно видалено."];
var chSchePara		= ["Запис за графіком","Час початку","Дата початку","Назва передачі","Назва каналу",
						"Тривалість","Повторити","Розклад","Редагувати","Видалити"];
var dateTimer		= ["Один раз","Щодня","Щотижня"];
var scheduleDeleteReminds="Бажаєте видалити цей розклад?";
var scheduleNoLists	= "Записи за графіком відсутні. Щоб додати, натисніть червону кнопку.";
var chListWords		= ["Список каналів","Вибрати список","Режим тюнера","Додати до вибраного","Видалити",
						"Виберіть список каналів","Виберіть режим тюнера","Замінити"];
var chListType		= ["Всі","Цифровий","Аналоговий","Радіо","Безкоштовно","Вибране"];
var chAutoScanOptions=["Виберіть оператора","Тип каналу","Автоматичний пошук"];
var souSoundType	= ["Недійсний","Моно","Моно","Стерео ","Стерео ",
						"SAP","SAP ","подвійний 1","подвійний 2","подвійний 2",
						"Nicam mono","Nicam stereo","Nicam dual1","Nicam dual2","NICAM Dual",
						"Моно","LL","RR","LR"];
var souPreset		= ["Музика","Кіно","Функція Clear Voice","Стандарт","Особистий"];
var picAdRgbMode	= ["Вимкнути","Тільки червоний","Тільки зелений","Тільки синій"];
var picAdOptions	= ["Зменшення шуму","Заглушення шумів MPEG NR","RGB mode","динамічна контрастність","Функція LED Motion Clarity",
						"Тілесний колір","режим кіно","Режим гри","Температура кольору","баланс білого",
						"Закріпити","Black Stretch","Режим перерозгортки","Гама","Режим HDMI","Баланс білого 10Р","Розширювач кольорового діапазону",
						"Зменшення розмитості","Зменшення тремтіння зображення","Кольоровий простір","Функція Motion Clarity"];
var pic10Pwhite     = ["Інтервал","Червоний","Зелений","Синій","Скинути","Колір","Жовтий","Блакитний","Пурпурний"];
var picMotionClarity = ["Режим руху","Інтерполяція руху","Функція LED Motion Clarity","Зменшення розмитості","Зменшення тремтіння зображення","Скинути"];
var picMotionMode   = ["Кіно","Згладження","Очистити ","Спорт","Клієнт"];
var picResetDes		= "Усі особисті налаштування будуть відновлені. Виконати вибрану дію?";
var pic10PReset     = "Відновити заводські налаштування балансу білого 10Р?";
var picMotionReset  = "Відновити заводські налаштування функції Motion Clarity?";
var picColorSpaceReset    = "Відновити заводські налаштування кольорового простору?";
var picOptions		= ["Визначені налаштування з..",
						"Підсвічування","Яскравість","Контрастність","Насиченість","Відтінок","Різкість","Температура кольору","Режим екрану","Автоформат",
						"Покращення «Спорт»","3D","3D-навігація","ECO Установки","Геометрія",
						"додаткові налаштування","Скинути зображення","мікрозатемнення"];
var picSize			= ["Формат 16:9", "Формат 4:3", "Формат екрана 14:9", "Синерама ",
						"Зміна масштабу 16:9", "Збільшення масштабу 16:9","Зміна масштабу 14:9","Розтягнення зображення ","Широкий зум",
						"Зміна масштабу 2","Широкий зум 2","Власна роздільна здатність екрана","По елементах","Оригінальний","Панорама"];
var others			= ["Гучність","Мовлення","Пароль","Стан","Зберегти","Замінити","Розпочати","Вихід","Пошук","Видалити",
						"Жодний","Автоматично","Пошук","Безпека","Під'єднайте","Оновити","Спробувати ще раз","СТОП","Установки","Канали",
						"Редагувати","Вставити","Cигналу!","Завершити","Стерео ","Аудіо","Джерело","Немає звуку","Поради","Скинути",
						"Клієнт","Настроювання ","Зберегти","Користувач","Закрити клавіатуру","Режим захисту","Щоденно","Список PVR"];
var direction		= ["Лівий","Правий","Вгору","Вниз"];
var audioType 		= ["MPEG","DOLBY AUDIO"/*"AC3"*/,"MPEG4","AAC", "DOLBY AUDIO"/*"AC3P"*/,
						"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD",
						" "," "," "," "," ",
						" ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2",
						"HE-AAC_V4","Невідомий"];
var soundChannels   = ["Невідомий","Моно","Sub","Подвійний моно","Стерео ","Стерео сабвуфер","Stereo Dolby Surround","Об’ємний звук 2CH","Об’ємний звук","Конфігурація каналів 3.0","Конфігурація каналів 4.0","Конфігурація каналів 5.0","Mono LFE","Dual Mono LFE","Stereo LFE","Surround 2Ch LFE","Surround LFE","Конфігурація каналів 3.1","Конфігурація каналів 4.1","5.1CH","7.1CH","Joint Stereo","FMRDO Mono","FMRDO Stereo","FM Mono NICAM Mono","FM Mono NICAM Stereo","FM Mono NICAM Dual","Лівий","Правий","Інше"];
var prompts			= ["Встановіть налаштування зображення, які найкраще підходять до ваших умов перегляду.",
						"Встановіть рівень яскравості. Чим ближче до значення 100 — тим яскравіше зображення.",
						"Встановіть рівень контрастності. Чим ближче до значення 100 — тим більшою буде різниця у темно-яскравих частинах зображення.",
						"Встановіть рівень насиченості. Чим ближче до значення 100 — тим різкіший колір.",
						"Встановіть рівень чіткості. Чим ближче до значення 100 — тим чіткіше відображаються деталі.",
						"Встановіть рівень підсвічування. Чим ближче до значення 100 — тим яскравіший екран.",
						"Встановіть рівень відтінку. Ця установка змінює відтінки кольору.",
						"Виберіть формат зображення, що найкраще підходить до передачі, яку ви переглядаєте.",
						"Налаштуйте опції енергозбереження.",
						"Встановіть налаштування геометрії екрана при під’єднанні ПК.",
						"Виберіть розширені налаштування зображення.",
						"Відновлення усіх налаштувань зображення до початкових значень.",
						"Виберіть режим звуку відповідно до ваших вподобань.",
						"Налаштуйте баланс гучності між лівим та правим каналами.",
						"Функція Sound Retrieval System TruSurround HD забезпечує відтворення глибокого звуку та чіткість звучання нижніх і верхніх частот.",
						"Digital Interface Format дозволяє під’єднати вихід цифрового звуку на телевізорі до аудіообладнання домашнього кінотеатру.",
						"Виберіть мову звучання відповідно до ваших вподобань.",
						"Увімкніть функцію для людей з вадами зору, у випадку поганого зору.",
						"Перевірте зображення, звук та сигнал телевізора.",
						"Виберіть тип списку каналів, що відповідає вашому ТВ-сигналу.",
						"Виберіть мову субтитрів передачі, що відображаються внизу екрана.",
						"Перегляд тексту та зображень поточного каналу.",
						"Стандарт Digital Living Network Alliance. Насолоджуйтеся музикою, фотографіями та відеозаписами в домашній мережі з інших пристроїв, наприклад комп’ютера.",
						"Відображайте вміст вашого смартфону на екрані телевізора та використовуйте смартфон як пульт дистанційного керування для вашого телевізора.",
						"Відображайте вміст із Miracast-сумісного Android-пристрою на екрані вашого телевізора.",
						"Заблокуйте ваш телевізор.",
						"Виберіть ім'я для вашого пристрою.",
						"Виберіть ваші умови перегляду.",
						"Відновлення усіх системних налаштувань до початкових значень.",
    					"Switch off sports mode for more options.",
    					"Збільшити контраст довкілля",
    					"Спеціальний режим для насолоджування спортивними іграми",
    					"Насолоджуйтесь додатковими функціями CEC."];
var initialTitle	= ["Вітаємо","Початкове установлення"];
var initialPrompt	= ["Виконайте початкове налаштування зараз та отримайте незабутні враження!",
						"Оберіть мову:",
						"Виберіть країну/регіон:",
						"Оберіть регіон:",
						"Виберіть тип мережного з'єднання:",
						"Виберіть режим з'єднання з проводовою мережею:",
						"Не вдалося підключитися до xxxxxxxxx! Підключіть пристрій, як зображено на схемі, чи натисніть кнопку Left (Вліво), щоб відновити налаштування.",
						"Підключено до xxxxxxxxx! Для продовження натисніть кнопку Right (Вправо).",
						"1) Ваш телевізор, можливо, оснащений вбудованим безпровідним адаптером\n 2) Або якщо є безпровідний адаптер USB, під’єднайте його до телевізора.  Потім виберіть режим підключення безпровідної мережі",
						"Сканування. Зачекайте...",
						"До ТВ не підключено жодного бездротового пристрою!",
						"Перш ніж натиснути кнопку \"Далі\", перевірте, чи встановлено наступний PIN-код на ТД.",
						"Натисніть кнопку на АР за 120 секунд до того, як натиснете Right (Вправо).",
						"WPS (Стандарт безпечного налаштування безпроводової мережі)",
						"PIN (особистий ідентифікаційний номер)",
						"РВС (конфігурація кнопки)",
						"Доступ до цього вмісту можна отримати лише після підключення до мережі. Пропустити налаштування мережі?",
						"Нове оновлення програмного забезпечення доступне для завантаження; завантаження може зайняти певний час, залежно від стану вашої мережі.",
						"Оновлення програмного забезпечення вашого телевізора дозволить вам скористатись найновішими функціями та сервісами.",
						"Ви не зможете насолоджуватися найновішими функціями та сервісами. Пропустити оновлення програмного забезпечення?",
						"Натисніть праву кнопку, щоб продовжити.",
						"Не вимикайте живлення під час оновлення, оскільки це може призвести до несправності телевізора.",
						"Якщо не хочете виконати оновлення, виберіть NO (НІ).",
						"Триває оновлення. Зачекайте",
						"Оновити програмне забезпечення також можна в меню SYSTEM > SOFTWARE UPDATE (СИСТЕМА > ОНОВЛЕННЯ ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ).",
						"Вибрана країна вимагає налаштування пароля.\nВведіть код для вашого телевізора та підтвердіть його.",
						"This code is too simple.\nPlease use different digits.",
						"Вітаємо! Початкове налаштування завершене. Змінити конфігурацію можна в головному меню та відповідних підменю.",
						"Виберіть режим захисту:",
						"Виберіть режим підключення безпровідної мережі:",
						"Мережа"];
var initNetCabAndDonRe = ["Мережний кабель не підключено. Підключіть мережний кабель!","Відсутній вбудований безпровідний адаптер або безпровідний адаптер USB."];
var initChPrompt = ["Налаштування телевізійних каналів","Виберіть тип сканування антени.","Виконується автоналаштування...","Знайдені наступні канали антени:","Виберіть тип кабельного сканування.","Виберіть оператора з наступного списку.","Налаштуйте інформацію щодо сканування","Знайдено наступні кабельні канали:","Виберіть одного оператора із наступного списку","Виберіть супутники для сканування або редагуйте вибраний супутник","Встановіть параметри супутника","Знайдені наступні канали; повторно відсканувати канали можна в меню Channel > Channel Scan (Канал > Сканування каналів)"];
var initClockPrompt = ["Синхронізуйте час через мережу!",
						"Встановіть дату та час:"];
var initialOptions	= ["Умови","Налаштування мережі","Онов-ня пр. забез-ня","Встановлення каналів","Годинник"];
var initialHotkeys	= ["Назад","Вибрати","Далі","Я погоджуюся"];
var initLocations	= ["Дім","Крамниця","Крамниця в режимі демонстрації"];
var initNets		= ["Проводова","Бездротовий","У мене немає мережного з'єднання"];
var initWireManuals	= ["ІР-адреса","Маска підмережі","Шлюз за замовчуванням","Основний DNS","Допоміжний DNS"];
var initSoftUpdates = ["Оновити зараз","Оновити пізніше"];
var initChannelIns	= ["Продовжити","Я не хочу налаштовувати канали"];
var initChScanTypes	= ["Цифровий & Аналоговий","Цифровий","Аналоговий","Я не хочу сканувати"];
var initChDvbts		= ["Канали антени ATV:","Канали антени DTV:"];
var initChDvbcs		= ["Кабельні ATV-канали:","Кабельні DTV-канали:"];
var initChDvbss		= ["Супутникові канали:"];
var initChDvbSOther	= ["Я не хочу сканувати супутникові канали"];
var initEndConnectedStatus= ["Відключено","Мережа Wi-Fi підключена","Провідна мережа підключена"];
var initEndInstallations= "Канали ХХХХ налаштовані";
var initEndUpdate	= ["Оновлено"];

var audioScenes 	= ["Встановлення на столі","Монтаж на стіні"];			
var screenSavers	= ["Немає жодного каналу, натисніть кнопку «Оk» та виконайте пошук!",
						"Немає сигналу!",
						"Зашифровано",
						"Тільки дані",
						"Аудіо програма",
						"Немає звуку та зображення",
						"Недоступно",
						"Без телетексту",
						"Дані про передачі відсутні.",
						"Програму заблоковано!",
						"Програму заблоковано!\nНатисніть ОК та введіть ваш код.",
						"Докладна інформація про передачі відсутня.",
						"Ця програма не рекомендується для неповнолітніх.\nНатисніть OK і введіть код.",
						"Канал заблоковано!",
						"Канал заблоковано!\nНатисніть ОК та введіть ваш код.",
						"Ввід заблоковано!\nНатисніть ОК та введіть ваш код.",
						"Не підтримується!",
						"Цей сервіс зараз недоступний",
						"Введ. заблок.!",
						"Назви передач відсутні.",
						"Не працює",
						"Без Субтитри"
						];
var channelNumberOverPromt = ["The number of search programs has exceeded,you can delete some programs and then retry!"];
var chBookingPromt	= ["Запрограмований запис поточного каналу. Телевізор почне запис каналу.",
						"Знайдено запис за розкладом.\n Переключіться на XXXX для виконання запису",
						"Для поточного каналу встановлено нагадування.",
						"Знайдено заплановане нагадування.\n Переключіться на XXXX"];
var timeUnit		= ["сек.","мін"];
var ciPromt			= ["Дані мережі змінені. Для оновлення виконайте сканування наявності оновлень. ",];
var othersPromt		= ["Будь ласка, зачекайте…",];
var menuOptions		= ["Зображення","Звук","Kанал","Smart TV","Мережа","Система","Підтримка"];
var optionOptions	= ["Визначені налаштування з..","Попередня настройка звуку","Закріпити","T-Link","\"\"\"зсув у часі\"\"\"","PVR","Запис за графіком","Установки","*"];
var optionTLinkPromt= [["Автоматичне увімкнення включено","Автом. очікування","Меню посібника"],
						["Увімкнути","Режим очікув.","Гучність підсилювача"]];
var powerPromt		= ["Телевізор зараз вимкнеться! Натисніть будь-яку клавішу, щоб скасувати."];
var ttxLanguage		= ["Західна Європа","Східна Європа","Російська","Арабська/Іврит","Перська ","Арабська","Білоруська","Грецька","Турецька"];
var ttxOptions		= ["Виявити ","Підсторінки циклу","Мова","Сторінка аварійного сигналу","Екстрене повідомлення"];
var weekday         = ["неділя","Понеділок","вівторок","Cереда","четвер","п'ятниця","Субота"];
var lcnConfflict	= "Під час роботи цієї програми виникли проблеми з прийомом сигналу.";
var inShopMode		= "Телевізор працює в режимі «Магазин». Для переключення в режим «Дім» виберіть System (Система) і змініть в меню параметр Location (Розташування).";
var nitRefresh		= "Дані мережі змінено  Ви хочете виконати пошук оновлень? ";
var picHDMIMode     = ["Авто","Графіка","Відео"];

var glassRemind    	= ["Підключіть 3D-окуляри до телевізора\n(Утримуйте клавішу POWER [ЖИВЛЕННЯ] на 3D-окулярах).","Тепер 3D-окуляри підключені до телевізора ",""];
var pvrRemind 		= ["Не від’єднуйте USB-пристрій і не вимикайте живлення"];
var pvrConName   	= ["PVR","Інформація про програму:",["Note: If you record the HD channel, please to select  the  disk(of speed >5.0MB/sec), and to select the disk (of speed >3.0MB/sec) when you want to record the SD channel.","Записане відео збережено у папці \"PVR\"."],"СТОП","Запис","година","Хвилина","Тривалість","Поради","Встановіть тривалість запису за допомогою клавіш зі стрілками."];
var pvrDisRemind 	= "Вставте USB-накопичувач для запису.";
var pvrRemindWords  = ["Вийти?",
							"Припинити запис і переглянути записані файли?",
							"Диск вийнято.",
							"Недостатньо вільного місця.",
							"Записані файлі відсутні. Натисніть Start (Початок), щоб розпочати запис.",
							"PVR не працює на закодованому каналі.",
							"Функція недоступна",
							"Успішне збереження.",
							"Припинити запис та змінити джерело вхідного сигналу?",
							"Телевізор припинить поточний запис. Вийти?",
							"Для правильної роботи функції запису телепередач (PVR) перевірте телевізійний сигнал."];
var pvrChangeCh 	= ["Увімкнути канал?",
							"Припинити запис та змінити канал?"];
var pvrChangeToPIN8	= ["Змінити джерело сигналу на пристрій, підключений до входу SCART?",
				    		"Зупинити запис і змінити джерело сигналу на пристрій, підключений до входу SCART?"];
var pvrChangeToCEC  = ["Змінити джерело сигналу на пристрій, підключений до входу HDMI?",
				  			 "Зупинити запис і змінити джерело сигналу на пристрій, підключений до входу HDMI?"];
var pvrGuideJump    = ["Увійти до електронного довідника цифрових програм (EPG)?",
							"Припинити запис та перейти до EPG?"];
var pvrMediaJump    = ["Увійти до сховища Media (Медіа)?",
							"Припинити запис та перейти до Media?"];
var timeshiftExtra	= ["Бажаєте зупинити зсув у часі та змінити змінити канал?",
						"Зупинити функцію Timeshift і змінити джерело сигналу на пристрій, підключений до входу SCART?",
						"Зупинити функцію Timeshift і змінити джерело сигналу на пристрій, підключений до входу HDMI?",
						"Зміщення часу не працює на закодованому каналі.",
						"Зупинити функцію Timeshift і увійти до EPG?",
						"Бажаєте зупинити зсув у часі та змінити TV на режим USB?",
						"Бажаєте зупинити зсув у часі та змінити змінити вхідне джерело?",
						"Вставте USB-накопичувач для запису.",
						"Недостатній розмір диска.",
						"Телевізор зупинить функцію Timeshift. Вийти?"];
var timeshiftStatus	= ["Перемотати назад","СТОП","Відтворення","Пауза","Перемотати вперед"];
var pvrPowerOffRemind= ["Режим очікування запису","Режим очікув.","Зараз телевізор працює в режимі запису. Продовжити запис, коли телевізор буде переключений в режим очікування?"];
var timeshiftInitTitle= "Настройка диска";
var timeshiftInitReminds= ["Цей майстер служить для настройки USB-диска на зсув у часі. Виберіть режим настройки.",
						 "Для покращення роботи, рекомендуємо форматувати USB-диск. Це призведе до стирання усіх даних.",
						 "Виберіть розмір файла для зсуву у часі.",
						 "Форматування",
						 "Недостатньо вільного місця.",
						 "Створення файла зсуву у часі",
						 "Тест швидкості",
						 "Недостатня швидкість (< %f МБ) для увімкнення функції зсуву у часі!",
						 "Диск готовий для функції зсуву у часі. Але рекомендуємо змінити диск (швидкістю > %f MБ/с) для кращої продуктивності.",
						 "Диск готовий для функції зсуву у часі. "];
var timeshiftInitButtons= ["Форматувати","Пропустити","Скасувати","ОК","Завершити","Вихід"];
var timeshiftInitOther=["Швидк. диска:","МБ/сек"];

var selectChoice	= "Ви впевнені?";
var chAtvStore		= "Зберегти як ХХХХ";
var chEpgFirstGenreUK= ["Кіно","Новини та докум-ні","РОЗВАЖАЛЬНІ ПРОГРАМИ","Спорт","Дитячі","Освіта","Стиль життя","Драма"];
var homePageTitleList = ["ДОДАТКИ","TV","ВІДЕОЗАПИСИ","Головна сторінка"];
var homePageFavAndAllName  = ["Уподобані додатки","Усі додатки"];
var homePageBackUp = ["Електронний посібник","Функція GuideOn"];
var homePageRemind   = ["Повний набір функцій доступний тільки після підключення до мережі.","Пошук каналів на цьому телевізорі ще не був виконаний. Програми з’являться після сканування каналів.","немає програми","Виконати пошук каналів зараз?"];
var homePageHistory = ["Історія"];
var miracastTitle = ["Дисплей WiFi","Пристрій TCL"];
var miracastRemind=["Дисплей WiFi дозволяє відображати екран та відтворювати звук із вашого мобільного пристрою, наприклад, смартфона або планшета, у безпровідний спосіб (без кабелів) на вашому телевізорі. Отже ви зможете переглядати на вашому телевізорі те, що відтворюється на вашому смартфоні або планшеті. Наприклад, ви можете запустити відео на вашому смартфоні і одночасно відтворювати його на телевізорі або використовувати ваш планшет як пульт керування грою, що відображається на великому екрані вашого телевізора.","WiFi TV link на телевізорі готовий. Тепер розпочніть відображення екрана вашого пристрою на екрані телевізора.","Підключення. Зачекайте!","Підключення не виконано!","Не вдалося підключитися. Перевірте підключення!"];
var homePageLittleWin = ["Установки","Медіа","Уподобані канали","Розумне TV","EPG"];

var hbbtvStopRemind  = ["Зупинити відтворення?"];
var colorSystem = ["Авто","PAL","SECAM","NTSC"];
var deviceTitleTipsText = "Для отримання додаткової інформації натисніть ≡ (ФУНКЦІЯ)";
var emptyListInfo = "До телевізору не підключено жодного пристрою!";
var optionVideoListArray_1 = ["Визначені налаштування з..", "Попередня настройка звуку", "Режим відтворення", "Режим екрану", "Режим 3D", 
							  "Перемикач L-R", "Глибина різкості", "Субтитри", "Звукова доріжка", "Назва", "Заголовок", "Інформація"];
var optionVideoListArray_2 = ["Визначені налаштування з..", "Попередня настройка звуку", "Режим відтворення", "Режим екрану", 
							  "Субтитри", "Звукова доріжка", "Назва", "Заголовок", "Інформація"];
var bottomTipsText = ["Відтвор./Пауза", "Перемотати назад", "Перемотати вперед", "Список відтворення", "Установки"];
var picturePresetArray = ["Стандарт", "динамічна", "Природний", "Кіно", "Особистий"];
var videoPlayModeArray = ["Повторити все", "Повторити", "Нормальний"];
var screenModeHDArray = ["16:9", "4:3", "Синерама ", "Широкий зум", "Зміна масштабу 2", "Широкий зум 2", "Розтягнення зображення ", "Автоматично"];
var screenModeSDArray = ["16:9", "4:3", "Синерама ", "Зміна масштабу 14:9", "Зміна масштабу 16:9", "Збільшення масштабу 16:9", "Автоматично"];
var Mode3DArray = ["Вимкнути", "2D-у-3D", "Пліч-о-пліч", "Верх і низ", "Чергування стрічок"];
var videoOptionListArray = ["Вимкнути", "Трек", "Субтитри", "Назва", "Заголовок"];
var subMenuTitleText = "Субтитри";
var langMenuTitleText = "Мова аудіо";
var titleMenuTitleText = "Назва";
var mode3DMenuTitleText = "Режим 3D";
var langInfoText = "Трек";
var STOP_RESUME_INFO = "Зупин.-Віднов.";
var playListName = "Ім'я";
var eb_tips = "Поради";
var ok_button = "ОК";
var eb_info = ["Помилка декодування звукозапису.", "Помилка декодування відеозапису.", "Формат аудіозапису не підтримується.", 
			   "Формат відео не підтримується.", "Не вдалося відкрити цей файл.", "Помилка відтворення. Повторіть спробу пізніше.",
			   "Формат файлу не підтримується.", "Помилка! Робота програвача зупинена.",
			   "Шлях до файлу не існує чи є неприпустимим.\nПовторно вставте пристрій збереження даних і повторіть спробу.",
			   "Продовжити відтворення з попередньої\n позиції?"];
var picturePlayErrorTips = ["Збій завантаження!!!","Зображення надто велике!!!","Мережна помилка!!!","Помилка потоку!!!","Помилка параметра!!!","Невідома помилка!!!"];
var frameTitleText = "Новий пристрій";
var eb_quit_info = "Бажаєте вийти?";
var eb_yes = "ТАК";
var eb_no = "НІ";
var offinfo = "Вимкнути";
var naInfo = "Нуль";
var consoleInfoArray = ["Перемотати назад", "Перемотати вперед", "Відтвор./Пауза", "Список відтворення"];
var cantOperateText = ["Функція не підтримується."];
var chapterChangeInfo = "Доступні тільки розділи 1–XXXX.";
var metaDataArray = ["Метадані назви/видання: ", "Метадані розділу: ", "Метадані аудіозапису: ", "Метадані субтитрів: "];
var metaTitleInfo = "Назва";
var metaChapterInfo = "Заголовок";
var videoLoadingInfo = "Аналіз...";
var listLoadingInfo = "Завантаження...";
var pgInfo = "Правова категорія: ";
var fileNameText = "Ім'я";
var fileDateText = "Дата";
var fileSizeText = "Розмір";
var fileDurationText = "Тривалість";
var fileDirectorText = "Режисер";
var fileCopyrightText = "Авторські права";
var fileArtistText = "Виконавець";
var fileAlbumText = "Альбом";
var fileGenreText = "Жанр";
var fileYearText = "Рік";
var fileGenreText = "Жанр";
var mainListArray = ["Всі", "Зображення", "Відео", "Музика"];
var sortArray = ["Ім'я", "Дата"];
var parserArray = ["Нормальний", "Рекурсивний  "];
var emptyTipsInfo = "Помилка! Не знайдено підтримуваних форматів файлів.";
var emptyFolderInfo = "Помилка! Не знайдено підтримуваних форматів файлів.";
var sortName = "Сортувати за";
var parserName = "Аналізатор";
var divx_str1 = "Реєстрація DivX®";
var divx_str2 = "Скасування реєстрації DivX(R)";
var infor_str = "Інформація";
var quickMenuEmptyText = "Функції відсутні.";

var musicSoundPresetArray = ["Стандарт", "Кіно", "Музика", "Функція Clear Voice", "Особистий"];
var musicInformationArray = ["Ім'я", "Виконавець", "Альбом", "Жанр: ", "Рік:", "Тривалість:"];
var playListName = "Ім'я";
var playTipsInfo = ["Відтворюється перший файл.", "Відтворюється останній файл."]
var musicNameInfo = "Name";
var musicArtistInfo = "Виконавець";
var musicAlbumInfo = "Інформація";
var optionSoundPresetInfo = "Попередня настройка звуку";
var optionBGMInfo = "Відтворювати у фоновому режимі";
var optionAudioOnlyInfo = "Тільки звук";
var optionInfoText = "Інформація";

var remotePhoneConnecte = "Встановлено підключення ХХХХ до телевізора!";
var tvRemoteTitle		= "Пульт ДК";
var tvRemoteDeveloper	= "Дана програма розроблена компанією TCL";
var tvRemoteDeviceTitle	= "Ім'я пристрою:";
var remoteOption		= ["Спільне використання медіавмісту","Пульт дистанційного керування","Довідка","Про","Smart Connect"];
var remotebottom		= " Завантажте додаток TV Remote на свій смартфон ";
var remoteStage			= ["Android","IOS"];
var sharingReminds		= ["Спільний доступ до фотографій, відеозаписів та музики з телефону на телевізорі.",
							"Кроки: \n   1. Натисніть значок додатка TV Remote на екрані телефону. Підключіть телефон до телевізора через ту ж саму мережу Wi-Fi;\n   2. Натисніть Media Sharing (Спільний доступ до медіафайлів), щоб переглянути медіафайли;\n   3. Відправка медіафайлів на телевізор для відтворення (з одним з наступних варіантів)",
							"      a) Перетягніть папку/файл на значок телевізора вверху екрана;\n      b) Поверніть телефон до телевізора, щоб запустити перший файл;\n      c) Розпочніть відтворення файла на телефоні, а тоді клацніть значок передачі на телевізор;",
							"   4. Під час відтворення на телевізорі коливайте телефоном для відтворення попереднього або наступного файла."];
var controlReminds		= ["Використовуйте телефон для дистанційного керування телевізором.",
							" ",
							"Кроки: \n   1. Натисніть значок додатка TV Remote на екрані телефону. Підключіть телефон до телевізора через ту ж саму мережу Wi-Fi;\n   2. Натисніть Remote Control (Пульт дистанційного керування) для управління телевізором."];
var helpDeviceWords		= "Взаємодія декількох екранів";
var helpBottom			= "У час хмаркових технологій такі розумні пристрої, як телефон та телевізор можуть взаємодіяти між собою. Діліться медіафайлами зі своєю родиною та керуйте телевізором із телефону. ";
var helpReminds			= ["Підготування\n   1. Завантажте й встановіть додаток TV Remote з магазину додатків Google Play чи Apple Store.\n   2. Підключіть телефон до телевізора через ту ж саму мережу Wi-Fi.",
							" ",
							"Рекомендований телефон\n   1. ЦП: не менше 800МГц\n   2. Носій: не менше 80МБ вільного місця",
							" ",
							"Відмова від відповідальності\n   Якщо додаток TV Remote не встановлений на вашому телефоні, зверніться до виробника телефону. "];
var helpButtons			= ["Назад","Далі"];
var aboutReminds		= ["Пульт ДК","Дана програма розроблена компанією TCL"];
var aboutExit			= "Вихід";
var smartReminds		= ["Швидке й інтелектуальне з’єднання між телевізором та телефоном.",
							" ",
							"Кроки \n   1. Підключіть телевізор до смартфону через ту ж саму локальну мережу. Натисніть значок додатка TV Remote на екрані смартфону.\n   2. Натисніть кнопку Smart Connect (Інтелектуальне з’єднання), щоб відсканувати QR-код.\n   3. Під час роботи телевізора в режимі перегляду телепередач натисніть і утримуйте в додатку TV Remote клавішу INFO (ІНФОРМАЦІЯ) протягом 4 секунд. На екрані з’явиться повноекранний QR-код.",];
var smartQRReminds		= ["Натисніть в додатку TV Remote на екрані телефону кнопку Smart Connect (Інтелектуальне з’єднання) і відскануйте QR-код для швидкого з’єднання телевізора та телефону.",
							"QR-код містить інформацію про обліковий запис локальної мережі. Зберігайте цю інформацію."];
							

var consoleTipArray = ["Назад","Далі","Консоль","Список відтворення"];							
var optionInfoArray = ["Визначені налаштування з..","Режим відтворення","Тривалість","Ефект ","Інформація"];

var playModeArray = ["Нормальний","Випадк. порядок","Повторити"];
var durationArray = ["Короткий (5 с)", "Середній (10 с)", "Довгий (15 с)"];
var effectArray = ["Жодний", "Повернути", "Поява зліва", "Поява справа ", "Поява знизу", "Поява зверху", "Всеред. рамки", "Прямокутник назовні", "Випадково"];
var infoArray = ["Назва:","Розмір: ","Дата: ","Розташування"];

var picturePresetBarTitleInfo = "Визначені налаштування з..";
var picturePresetBarArray = ["Стандарт","динамічна","Кінотеатр","Кіно","Особистий"];
var upTipsInfo = "Перемістити зображення"; //add yums 2014-10-10
var consoleTipsArray = ["Консоль","Назад","Далі","Список відтворення","Установки"];  //add yums 2014-10-10
var pictureMoveTipsArray = ["Натисніть кнопку RIGHT (ВПРАВО) ще раз для перегляду наступного зображення","Натисніть кнопку LEFT (ВЛІВО) ще раз для перегляду попереднього зображення","Натисніть кнопку DOWN (ВНИЗ) ще раз для відображення списку відтворення"]; //add yums 2014-10-10

var optionPvrListArray = ["Визначені налаштування з..","Попередня настройка звуку", "Режим екрану", "Режим 3D", "Субтитри", "Звукова доріжка", "Інформація"];							
	
var titleSpanFirstArray = ["Управління і підключення","Основні операції","ДОДАТКИ","TV","Установки","Запитання й відповіді"];
var titleSpanSecondArray = [["Пульт дистанційного керування","Клавіші панелі","Зручна навігація","Підключення телевізора","Підключення телевізора","Підключення телевізора","Бездротовий"],["Запускач","Рядок стану","Джерело"],["Додатки для відтворення","Медіа","Пульт ДК"],["Налаштувати канал і гучність","Список каналів","EPG","Встановлення каналу","Уподобані канали"],["Налаштування зображення","Налаштування звуку","Налаштування каналу","Онов-ня пр. забез-ня","Мова","Батьківський захист"],["Часті запитання","Часті запитання","Усунення несправностей","Усунення несправностей","Умови та положення"]];
var contentSpan1_1Array =[["POWER (ЖИВЛЕННЯ):","SOURCE (ДЖЕРЕЛО СИГНАЛУ):","НАЛАШТУВАННЯ:","ОПЦІЯ:","НАЗАД:","INFO (ІНФОРМАЦІЯ):","ГОЛОВНА:","ВИХІД:","LIST (СПИСОК):"],
    ["Увімкнення телевізора або перемикання його в режим очікування",
        "Вибір джерела вхідного сигналу",
        "Щоб відобразити меню Налаштування",
        "Щоб відобразити меню Опції",
        "Повернення назад до попереднього меню або вихід із поточної програми",
        "Показує інформацію про програму",
        "Щоб отримати доступ до домашньої сторінки SmartTV",
        "Повернення назад до попереднього меню або вихід із поточної програми",
        "Показує список каналів"]];
var contentSpan1_2Array = ["Попередній канал","Наступний канал","Збільшити гучність","Зменшити гучність","Перехід на головну сторінку","Підтвердити функцію","Режим очікування/увімкнути живлення"];
var contentSpan1_3Array = ["ОК/довідник","Канал вгору","Канал вниз","Зменшити гучність","Збільшити гучність","Присутні у деяких функціях у вигляді клавіш зі стрілками."];
var contentSpan1_4Array = ["ЛОКАЛЬНА МЕРЕЖА","HDMI (MHL)","HDMI","HDMI (ARC)","Адаптер AV OUT","ЛОКАЛЬНА МЕРЕЖА","Смартфон","ПК/зовнішній декодер/DVD","Звуковий підсилювач","Звуковий підсилювач/монітор","Можливо, телевізор не оснащений усіма потрібними гніздами."];
var contentSpan1_5Array = ["Порт USB 2.0","Порт USB 3.0","Навушник","Адаптер AV IN","SPDIF","Адаптер CMP AUDIO IN","Адаптер CMP IN (YPbPr)","USB-пристрої","USB-пристрої","Навушник","DVC/ігрова приставка/ зовнішній декодер/DVD","Звуковий підсилювач","DVC/ігрова приставка/ зовнішній декодер/DVD","Можливо, телевізор не оснащений усіма потрібними гніздами."];
var contentSpan1_6Array = ["Загальний інтерфейс ","SD","VGA","SCART","Mini SCART","АНТЕННИЙ ВХІД","Карта PCMCIA","SD-карта","ПК","Зовнішній декодер/DVD","Антена/кабель/супутник","Можливо, телевізор не оснащений усіма потрібними гніздами."];
var contentSpan1_7Array = ["Планшет","ПК","Маршрутизатортор","Телефон","TV"];
var contentSpan1_8Array = ["Перемикач функцій/живлення","Натисніть і утримуйте, щоб перейти до таймера сну","Вниз","Вгору","Гучність/Канал/Джерело"];

var contentSpan2Array = [["Для перегляду головної сторінки натискайте клавіші зі стрілками.","Потім натисніть ОК, щоб переглянути популярні програми чи відкрити додаток."],["Відображає дату, мережу, пристрої та ін. у правому верхньому куті екрану."],["Виберіть джерело вхідного сигналу від пристроїв, підключених до телевізора, через різні порти, наприклад TV, AV, HDMI та ін."]];

var contentSpan3Array = ["Насолоджуйтеся та розважайтеся з уподобаними додатками на сторінці Smart TV","Дивіться фотографії, відеозаписи та слухайте музику з USB-пристрою.","Підключіть телевізор і смартфон або планшет до тієї ж самої локальної мережі","Натисніть на екрані смартфону чи планшета значок nScreen або TV Remote","Обмінюйтеся зі своєю сім’єю фотографіями, відеозаписами та музикою на декількох екранах і керуйте телевізором за допомогою смартфону"];

var contentSpan4Array = [["Натисніть кнопку UP/DOWN (ВГОРУ/ВНИЗ), щоб переключити канали","Натисніть кнопку LEFT/RIGHT (ВЛІВО/ВПРАВО), щоб налаштувати гучність"],["Для перегляду списку каналів натисніть на пульті дистанційного керування кнопку LIST","Натисніть кнопку UP/DOWN (ВГОРУ/ВНИЗ), щоб вибрати канал"],["Електронний довідник цифрових програм (EPG) — це екранний довідник, що відображає список запланованих телепрограм. Користувач може переміщуватися, вибирати, переглядати та записувати телепрограми."],["Пошук і налаштування каналів"],["Додавайте чи редагуйте уподобані канали в Channel List (Список каналів)"]];

var contentSpan5Array = ["Переглядайте уподобані програми у відеододатках"];

var contentSpan6Array = [["Натисніть кнопку Опція, щоб відобразити параметри налаштування системи","Відкрийте налаштування Picture (Зображення), щоб настроїти значення"],["Натисніть кнопку Опція, щоб відобразити параметри налаштування системи","Відкрийте налаштування Sound (Звук), щоб настроїти параметри"],["Натисніть кнопку Опція, щоб відобразити параметри налаштування системи","Відкрийте налаштування Channel (Канал), щоб настроїти параметри"],["Оновіть телевізор за наявності нового програмного забезпечення"],["Користувач може вибрати мову меню"],["Дозволяє батькам встановити пароль на перегляд каналів або програм, що не призначені для дітей"]];

var contentSpan7_1Array = [["Відсутні зображення та звук","Перевірте плавкий запобіжник чи переривач.","Підключіть інший електричний прилад до розетки, щоб впевнитися, що розетка працює належним чином.","Поганий контакт роз’єму з гніздом живлення","Перевірте джерело сигналу."],["Нормальне зображення, відсутній звук","Натисніть кнопку UP (ВГОРУ), щоб збільшити гучність.","Звук налаштований неправильним чином.","Помилка сигналу телепередачі."],["Нормальний звук, відсутнє зображення","Налаштуйте яскравість і контрастність","Помилка сигналу телепередачі.","Перевірте, чи працює телевізор тільки в режимі відтворення звуку."]];
var contentSpan7_2Array = [["Радіочастотні перешкоди","Цей тип перешкод призводить до утворення на екрані телевізора рухомих пульсацій чи діагональних смуг, і в деяких випадках — втрати контрастності зображення. Знайдіть і виключіть вплив джерела радіочастотних перешкод на телевізор."],["Відсутній колір","Налаштуйте параметри кольору.","Виберіть інший канал. Телевізор може приймати телепередачі в чорно-білому форматі."],["Не працює пульт дистанційного керування","Замініть батарейки.","Неправильно встановлені батарейки. Не підключено живлення до телевізора."]];
var contentSpan7_3Array = [["Не відображується вміст з USB-пристрою","Перевірте, щоб USB-пристрій був сумісним з телевізором.","Перевірте, чи підтримує телевізор формати звуку та файлів зображень."],["При відтворенні відсутній звук","Формат звуку відеозапису не підтримується телевізором."],["Файли відтворюються ривками","Швидкість роботи USB-пристрою може обмежувати швидкість передавання даних на телевізор."]];
var contentSpan7_4Array = [["На що треба звернути увагу при оновленні програмного забезпечення","Не вимикайте живлення під час оновлення програмного забезпечення.","Не натискайте будь-які кнопки на пульті дистанційного керування під час оновлення програмного забезпечення.","Зачекайте, оскільки оновлення програмного забезпечення може зайняти трохи більше часу."],["Після оновлення програмного забезпечення зміни інтерфейсу телевізора не будуть помітні.","У деяких випадках оновлення ПЗ може не тільки оновити чи додати нові функції, але й покращити роботу телевізора без видимих змін у його інтерфейсі. Інколи інтерфейс телевізора може не змінюватися взагалі."]];
var termsTitle = "Умови та положення";
var termsConditions = ["Правова заява компанії TCL — виробника цього телевізора. ","У зв'язку з різними характеристикам виробів, що включають послуги SmartTV, а також у зв'язку обмеженнями, наявними в доступному наповненні (контенті), деякі функції, програми та послуги можуть бути недоступними на деяких пристроях або на деяких територіях. Для використання деяких функцій на SmartTV можуть бути потрібні додаткові периферійні пристрої або можуть зніматись членські внески. Відвідайте нашу веб-сторінку для отримання детальнішої інформації щодо певного пристрою та доступності наповнення. Перелік послуг та доступність наповнення через SmartTV можуть змінюватись час від часу без попередження. \n   Все наповнення та послуги, доступні через даний пристрій, належать третій стороні та захищені авторським правом, патентами, торговими марками та/або іншими законами щодо захисту інтелектуальної власності. Таке наповнення та послуги забезпечуються виключно для персонального некомерційного використання. Забороняється використовувати будь-яке наповнення або послуги у спосіб, не схвалений власником наповнення або постачальником послуг. Без обмеження вищезгаданого, окрім випадків чіткого схвалення власника даного наповнення, забороняється змінювати, копіювати, перевидавати, завантажувати, публікувати, передавати, перекладати, продавати, створювати збірні роботи, використовувати або розповсюджувати у будь-який спосіб або на будь-якому носії будь-яке наповнення або послуги, що відображаються на даному пристрої. \n   ВИ ЧІТКО УСВІДОМИЛИ ТА ПОГОДЖУЄТЕСЬ, ЩО ВИ БЕРЕТЕ НА СЕБЕ ПОВНУ ВІДПОВІДАЛЬНІСТЬ ЗА ВИКОРИСТАННЯ ЦЬОГО ПРИСТРОЮ, А ТАКОЖ ЗА ЙОГО НАЛЕЖНУ ЯКІСТЬ, РОБОТУ ТА ТОЧНІСТЬ РОБОТИ. ДАНИЙ ПРИСТРІЙ ТА ВСЕ НАПОВНЕННЯ І ПОСЛУГИ ВІД ТРЕТЬОЇ СТОРОНИ НАДАЮТЬСЯ У СПОСІБ « ЯК Є » БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ ЯВНО АБО НЕЯВНО. TCL ЧІТКО ВІДМОВЛЯЄТЬСЯ ВІД УСІХ ГАРАНТІЙ ТА УМОВ, ЩО СТОСУЮТЬСЯ ДАНОГО ПРИСТРОЮ ТА БУДЬ-ЯКОГО ВМІСТУ І ПОСЛУГ, ЯВНО ТА НЕЯВНО, ВКЛЮЧАЮЧИ ТА НЕ ОБМЕЖУЮЧИСЬ ГАРАНТІЯМИ ТОВАРНОГО СТАНУ, НАЛЕЖНОЇ ЯКОСТІ, ПРИДАТНОСТІ ДЛЯ ПЕВНИХ ЦІЛЕЙ, ТОЧНОСТІ, СПОКІЙНОГО ВИКОРИСТАННЯ ТА НЕПОРУШЕННЯ ПРАВ ТРЕТЬОЇ СТОРОНИ. TCL НЕ ГАРАТУЄ ТОЧНОСТІ, ДІЙСНОСТІ, СВОЄЧАСНОСТІ, ЗАКОННОСТІ АБО ПОВНОТИ БУДЬ-ЯКОГО НАПОВНЕННЯ АБО ПОСЛУГИ, ЩО ВИКОРИСТОВУЮТЬСЯ ЧЕРЕЗ ДАНИЙ ПРИСТРІЙ І НЕ ГАРАНТУЄ, ЩО ДАНИЙ ПРИСТРІЙ, НАПОВНЕННЯ АБО ПОСЛУГИ ВІДПОВІДАТИМУТЬ ВАШИМ ВИМОГАМ, А ТАКОЖ, ЩО ВАШ ПРИСТРІЙ АБО ПОСЛУГИ БУДУТЬ ПРАЦЮВАТИ БЕЗ ПРЕШКОД ТА ПОМИЛОК. ЗА ЖОДНИХ ОБСТАВИН, ВКЛЮЧАЮЧИ НЕДБАЛІСТЬ, КОМПАНІЯ TCL НЕ НЕСЕ ВІДПОВІДАЛЬНОСТІ, НІ У ВИГЛЯДІ КОНТРАКТУ, НІ У ВИГЛЯДІ ДЕЛІКТУ, ЗА БУДЬ-ЯКІ ПРЯМІ, НЕПРЯМІ, НАВМИСНІ АБО НЕНАВМИСНІ ПОШКОДЖЕННЯ, ЮРИДИЧНІ СПЛАТИ, ГРОШОВІ ВИТРАТИ АБО БУДЬ-ЯКІ ІНШІ ЗБИТКИ, ЩО ВИПЛИВАЮТЬ З ЦЬОГО АБО ВНАСЛІДОК ЦЬОГО, ЗА БУДЬ-ЯКУ ІНФОРМАЦІЮ, ЩО МІСТИТЬСЯ АБО ЗА ВИКОРИСТАННЯ ДАНОГО ПРИСТРОЮ, А ТАКОЖ ЗА БУДЬ-ЯКЕ НАПОВНЕННЯ АБО ПОСЛУГИ, ДО ЯКИХ ОТРИМУЄТЕ ДОСТУП ВИ АБО БУДЬ-ЯКА ТРЕТЯ СТОРОНА, НАВІТЬ ПРИ НАЯВНОСТІ ПОПЕРЕДЖЕННЯ ПРО МОЖЛИВІСТЬ ПОДІБНИХ ЗБИТКІВ. \n   Послуги третьої сторони можуть бути змінені, зупинені, усунені або перервані та доступ до них може бути відключений у будь-який час без попередження, і компанія TCL (виробник телевізорів марки Thomson) не дає пояснень та гарантій, що будь-яке наповнення або послуги будуть залишатись доступними упродовж будь-якого періоду часу. Наповнення та послуги надаються третіми сторонами - мережею та засобами зв'язку, на які компанія TCL не має жодного впливу. Не обмежуючи загальне застосування даної відмови, TCL чітко відмовляється від будь-якої відповідальності за будь-які зміни, переривання, вимкнення, усунення або призупинення надання будь-якого наповнення або послуг, які використовуються на даному пристрої. Компанія TCL може накласти обмеження на використання або доступ до певних послуг або наповнення у будь-якому випадку, без попередження та без відповідальності за це. Компанія TCL не несе відповідальність за технічну підтримку користувачів стосовно наповнення та послуг. Будь-які запитання або запити щодо надання наповнення або послуг слід направляти безпосередньо відповідним постачальникам наповнення та послуг."];

var noChannelListRemind        = ["Не знайдено жодного каналу. Список каналів з’явиться після сканування каналів.","Пошук каналів"];
var closeSubtitleRemind   = "Функція з’явиться при відключенні субтитрів. Налаштувати зараз?";

var estickerTitles = ["Високореалістичні зображення","Відтінки кольору, що виглядають живими","Чудові природні рухи","Якість динамічного зображення","Укрупнення SR UHD","Відчуйте тривимірний світ!","Збільшена продуктивність","Підтримка майбутнього вмісту з роздільною здатністю 4К","Розважайтеся в Інтернеті","Отримайте доступ до додаткового вмісту","Інтегровані цифрові тюнери","Можливість підключення усіх пристроїв","Підтримка різних джерел з роздільною здатністю 4К","Відтворення вмісту з USB-пристрою","Надшвидкісний Wi-Fi","Мобільний вміст на телевізорі","Вміст на мобільних пристроях","Локальний вміст","Схвалено DivX","Плавне зображення","Модуль Canal Ready","Додаток TDT Premium"];
var estickerDescriptions = ["Чудова якість телевізійних програм і відеозаписів завдяки роздільній здатності, що в чотири рази перевищує роздільну здатність Full HD на екрані UHD","Широкий діапазон кольорів гарантує насолоду при перегляді кожного сюжету, насиченого червоними та смарагдовими відтінками","Кадрова інтерполяція 4К і драйвери заднього підсвічування допомагають боротися з розмиттям","Насиченість оригінального зображення покращується, щоб створити справжній динамічний вираз із чудовою контрастністю","Насолоджуйтеся більш чіткім зображенням телевізійних передач і відеозаписів Blu-Ray завдяки технології Super Resolution","Пізнайте технологію 3D TV Ready і дивіться різноманітний вміст із тривимірними зображеннями","Найкращий розважальний досвід завдяки процесору Quad Core, що забезпечує ідеальну взаємодію та покращену продуктивність","Підтримка відеокодека HEVC (H.265) для наступного стандарту відеозаписів із роздільною здатністю 4К","Різноманіття додатків у мережі Інтернет, сервіси «відео на замовлення» (VOD) і «услід за ефіром», перегляд веб-сторінок","Ви маєте можливість побачити більше завдяки додатковим сервісам і вмісту, що пропонуються вашими уподобаними телевізійними каналами","Отримайте доступ до телевізійних каналів високої роздільної здатності без додаткового зовнішнього декодера","Числені цифрові джерела, що легко підключити, — тепер у вашій домівці!","Цей телевізор готовий для відтворення майбутніх трансляцій та відеозаписів із роздільною здатністю 4К з частотою 50–60 Гц через порт HDMI 2.0 завдяки технології захисту медіаконтенту HDCP 2.2","Відтворення відеозаписів і перегляд фотографій безпосередньо з USB-накопичувача, жорсткого диска чи камери на великому екрані з роздільною здатністю 4К","Останнє покоління систем зв’язку 2x2 MIMO та стандарт АС забезпечують неперевершену швидкість доступу до мережі Інтернет","Насолоджуйтеся переглядом фотографій, відеозаписів, розважайтеся і працюйте з додатками з мобільних пристроїв на великому екрані завдяки технології дзеркального відображення екрана Screen Mirroring","На великому екрані відображуються фотографії, відеозаписи, додатки зі смартфону чи планшета ","Переглядайте на великому екрані локальний вміст, наприклад фотографії та відеозаписи з пристроїв, підключених до локальної мережі","Відтворюйте власні чи узяті напрокат фільми, захищені технологією DivX","Ультратонка рамка та надзвичайно витончений дизайн","Перевірено та схвалено телевізійним каналом Canal+","Перевірено та схвалено компанією TDT Premium"];							

var eManualTextArray = ["Електронний посібник","Усі графічні зображення усередині призначені тільки для візуального представлення."];
var frontPanelRemind = "Перед. панель заблок.";
var eRPRemind		 = "Режим продажу може не відповідати вимогам ERP. Ви впевнені?";	
var noRelatedChannel = "Відповідні канали відсутні";
var option0624Name          = ["BOP","BFS","Подія за подією","Отримати ID користувача","BGM","Reset all","Відновити попередні налаштування","NRM","Вибір стандарту DVB-T2 та країни","Режим HbbTV"];
var DVBT2AndChoice = ["Увімкнути","За країною","Вимкнути"];
var hbbtvServiceRemind = "Скоро буде доступною служба HbbTV.";
var insertWord = "Вставити";		
var viewDetail = "Перегляд докладних відомостей";							

var remindOAD  = "Оновлення програми. Рекомендоване оновлення програми може бути доступним на іншому каналі. Якщо погодитесь на його завантаження, перехід на канал може відбутись автоматично. Бажаєте зробити це зараз?";

var LEDStatus = ["Блимає", "Нормальний","Вимкнути"];
var netFlixRemind = "Ця функція перерве доступ до сервісів Netflix доти, доки ви не увійдете знову.";
var ESNExplanation = "Електронний серійний номер";
var resetShopRemind = "Система перезавантажується, будь ласка, не вимикайте телевізор";
var initialSelectOption = "Виберіть одну з опцій:";
var databaseRemind   = "Система виявила, що база даних пошкоджена з невідомих причин, і автоматично перебудує її; натисніть ОK, щоб продовжити";
var Deactivation = "Вихід";
var oadFutureRemind = "Оновлення програмного забезпечення.\n Нова версія рекомендованого програмного забезпечення буде доступна о %s. Процес оновлення займе деякий час, при цьому екран може згаснути. Не вимикайте приймач протягом оновлення. Якщо ви бажаєте виконати це оновлення, залиште приймач увімкненим у зазначений час. Бажаєте виконати оновлення?";														
							
var bt_title = "Bluetooth";
var bt_soundOutPutName = "Вихід звуку";
var bt_soundOutPutTV = "Динаміки ТВ";
var bt_soundOutPutBT = "Пристрій Bluetooth";
var bt_soundOutPutBT_TV = "Bluetooth і ТВ";
var bt_refreshBarName = "Пристрої";
var bt_settingTips_On = "Увімкніть Bluetooth і проскануйте пристрої";
var bt_settingTips_Finding = "Пошук доступних пристроїв";
var bt_settingTips_NoDevice = "Пристрої недоступні";
var bt_deviceList_State_NoConnect = "Не підключено";
var bt_deviceList_State_Connecting = "Підключення";
var bt_deviceList_State_Connected = "Підключено";
var bt_deviceList_State_Paired = "З′єднано";
var bt_deviceList_Conncect_Failed_Tips1 = "Помилка підключення";
var bt_deviceList_Conncect_Failed_Tips2 = "Підтвердіть, що увімкнена ф-ція Bluetooth ХХХ";
var bt_deviceList_Conncect_Success = "Підключено до пристрою Bluetooth";
var bt_deviceList_Disconncect_Success = "Відключено від пристрою Bluetooth";
var bt_deviceList_Disconnect = "Відключитися від ХХХ?";
var bt_tipsTitle = "Порада";
var bt_bluetooth_Pairing_Title = "Bluetooth спаровування";
var bt_bluetooth_Input_Pin = "Введіть PIN-код:";
var bt_bluetooth_Output_Pin_Tip = "Ввести PIN-код XXXX з клавіатури";
var bt_bluetooth_Pin_Wrong_Tip = "Невірний PIN-код";
var bt_bluetooth_Remove_Pair_Title = "Запит";
var bt_bluetooth_Remove_Pair_Ask = "Забути цей пристрій?";

var audioDescriptionName = ["Опис аудіо","Колонка","Гучність колонки","Навушники","Гучність навушників","Гучність AD","BT-пристрій","Гучність BT-пристрою","Підсилювач","Колонка"];
var audioDescriptionOptions = ["Вимкнути","Нормальний","Опис аудіо"];
var volumeOffRemind = 'Встановіть XXX на «Вкл.» в меню Налаштування.';
var switchSourceRemind   = " вставлено. Бажаєте увімкнути зараз?";
var footballModeName = "Режим Спорт";
var resetStadium = "Стадіон";

var atvSearchMenu = "ATV manual search";
var dtvSearchMenu = "DTV manual search";
var settingNoticeSourceName ="Автоджерело";

var smartTVOptions		= ["Портал Smart TV","HbbTV","Відкрити доступ","Дисплей WiFi","Умови та положення",
    "Очікування мережі","Скинути smart TV","Cookie policy","Політика конфіденційності","Видалення даних"];
var supportOptions		= ["Дистанційна діагностика","Зверніться до нас"];
var ClosedcaptionName ="Closed caption";
var sysCCOptions	= ["CC mode","Analog CC","Digital CC","Superimpose","Closed caption"];							
var sysCCmodeOption = ["Off", "On", "On When Mute"];
var sysanalogCCOption = ["Off", "CC1", "CC2", "CC3", "CC4", "Text1", "Text2", "Text3", "Text4"];
var sysdigitalCCOption = ["Off", "Service 1", "Service 2", "Service 3", "Service 4", "Service 5", "Service 6", "Service 7", "Service 8"];
var syssuperimposeOption = ["Off", "Service 1", "Service 2", "Service 3", "Service 4", "Service 5", "Service 6", "Service 7", "Service 8"];
var sysCCOPtionItems = ["CC Option","Mode","Font Style","Font Size","Font Edge Style","Font Edge Color","FG Color","BG Color","FG Opacity","BG Opacity"];
var sysCCOtionMode = ["Custom","Default"];
var sysCCOptionFontStyle = ["Default","Font1","Font2","Font3","Font4","Font5","Font6","Font7"];
var sysCCOptionFontSize = ["Default","Large","Small","Normal"];
var sysCCOptionFontEdgeStyle = ["Default","None","Raised","Depressed","Left Shadow","Right Shadow"];
var sysCCOptionFontColor = ["Default","Black","White","Red","Green","Blue","Yellow","Magenta","Cyan"];
var sysCCOptionFontOpacity = ["Default","Solid","Flashing","Translucent","Transparent"];

var tvDoctor=["Дистанційна діагностика 2.0",
"Цей додаток підходить тільки для вашого Smart TV і служить для запуску діагностичної перевірки та покращення характеристик даного виробу. Цей додаток збирає дані щодо керування телевізором та інформацію щодо його моделі і завантажує їх на сервер. Ця інформація використовується для вирішення проблем із телевізором. Ваша особиста інформація залишається конфіденційною. Переконайтесь, що ваш телевізор належно підключений до інтернету.",
"Локальна діагностика",
"Після початку діагностики виконуйте вказівки нашого інженера.",
"Дистанційна діагностика",
"Перед використанням переконайтесь, що наш інженер знаходиться онлайн.",
"Серійний номер:",
"&nbsp;&nbsp;&nbsp;&nbsp;Ідентифікатор користувача:",
"Підключення...",
"Виконується діагностика. Будь ласка, не відключайтесь від мережі.",
"Немає доступу до інтернету, будь ласка, \n перевірте підключення до інтернету.",
"Вихід"
];
var contactUsOption = ["Зверніться до нас",
    "У випадку проблем із використанням цього пристрою зверніться у TCL.",
    "Зверніться до нас",
    "Веб-сайт: Відвідайте",
    "Номер центру викликів:","Інформація щодо виробу","Номер моделі:",
    "Версія ПО:","","Ідентифікатор користувача:","Номер проекту:",
    "Тип клієнта:","Безпроводова MAC-адреса:","Проводова MAC-адреса:","Netflix ESN:","Сканування інформації на вашому телефоні.",
    ", а тоді виберіть вашу країну."];
							


//本地launcher的翻译，与服务器无关，只用于本地launcher
var homePageWords = ["Історія", "Пошук"];//home页的翻译
var titlePageWords = ["Дім", "Відео","TV","Додатки"];//index的标题翻译
var videosPageWords = ["Кіно", "Спорт","Музика","Найчастіше","Ігри","Освіта","Nieuws"];//videos页的内容翻译

//同时应用于本地和服务器
var statusPageWords = ["USB","Налаштування","WiFi","Проводова"];//状态栏的翻译

//二级页面的翻译
var searchPageWords = ["Пошук", "Найчастіше шукають:","Шоу, Фільми, Люди..."];
var resultSearchPageWords = ["Результати щодо", " ","Спробуйте інші ключові слова.","Вибачте, щодо ","не знайдено жодного відео."];
var historyPageWords = ["Історія", 'Натисніть','щоб видалити журнал',"Видалити один","Видалити всі","Вчора","Сьогодні"," Ви ще не переглядали жодного відео.","Журнал перегляду видалено успішно!"];
var channelPageWords = ["Вибачте, ще не знайдене жодне відео."];


//以下数组是虚拟遥控器的html中所有span的文字，要一一对应

var virtualRemoteValues	= ["1","2","3","4","5","6","7","8","9",
                       	   "Zoom-","0","Zoom+",
                       	   "Вихід","0","",
                       	   "Список","0","Текст",
                       	   "Посібник","Ввід","Вихід",
                       	   "Меню","Субтитри","Вікно відомостей",
                       	   "Зупинити",
                       	   "Вікно відомостей","Меню","Вихід",
                       	   "Вихід"
                       	   ];	

//added for LA sports mode
var sportsModeInitReminds= ["Цей майстер служить для настройки USB-диска для режиму Спорт. Виберіть режим настройки.",
						 "Виберіть розмір файла для режиму Спорт.",
						 "Створення файла для режиму Спорт",
						 "Недостатня швидкість USB-носія (< %f МБ/с) для функції режиму Спорт!",
						 "USB-носій готовий для режиму Спорт. Але ми рекомендуємо замінити його на диск із швидкістю > %f MБ/с для кращої роботи.",
						 "USB-носій готовий для режиму Спорт."];

var sportsModeExtra	= ["Бажаєте зупинити режим Спорт і змінити канал?",
						"Бажаєте зупинити режим Спорт і вибрати джерелом сигналу пристрій, підключений до роз’єму SCART?",
						"Бажаєте зупинити режим Спорт і вибрати джерелом сигналу пристрій, підключений до роз’єму HDMI?",
						"Режим Спорт не підтримується на зашифрованому каналі.",
						"Бажаєте зупинити режим Спорт і відкрити ЕПП?",
						"Бажаєте зупинити режим Спорт і відкрити Медіа?",
						"Бажаєте зупинити режим Спорт і змінити джерело вхідного сигналу?",
						"Телевізор завершить поточний режим Спорту. Бажаєте вийти?"];
var remoteControlNote = "- Наданий пульт дистанційного керування може відрізнятися залежно від моделі виробу";


var textArray = ["Volume","Channel","Source","Switch/Power","Guide","seconds to Power OFF"];
var guideArray = ["VOL-","VOL+","CH-","CH+","Pre","Next"];
var favChannelListRemind = ["Обраних каналів немає. Перейдіть, будь ласка до інших списків і скористайтеся «Зеленою кнопкою», щоб додати обрані канали."];

var proxySetting = ["Налаштування Проксі","Порт"];
var powerOffShop = ["Рекомендуємо використати режим Магазин, використати?"];
var tcastTextPageWords = ["Безліч відео, цікаві і корисні застосунки","Пульт ДУ для ТВ просто у вас під рукою","Видовищний контент, який краще переглядати на великому екрані"];
var tcastOtherWords = ["Відскануйте QR-код і завантажте T-CAST","ТВ з'єднано з мережею","Ім’я телевізора","T-Cast"];
var hbbtvWords = ["Налаштування Hbbtv","HbbTV","Файли cookie","Cookie-файлі третіх сторін","Ідентифікатор пристрою","стеження"];
var hbbtvTrackingWords = ["YES","NO","Байдуже"];
var eStickerTipWords = ["Зайнято майже 400MБ, бажаєте видалити відео в режимі Демо, щоб отримати більше місця?"];
var delEstickerVideoRemid = ["Відео видалено успішно"];
var selectSatRemind = "Ви можете вибрати не більше 20 супутників!";
var cookiePolicyTitle = "Політика щодо Cookie – Онлайн-сервіси Smart TV";
var cookiePolicyConditions = ["Компанія поважає вашу приватність при використанні наших Smart TV та Сервісів, що ми надаємо. Файли Cookies використовуються багатьма веб-сайтами та іншими інтернет-сервісами, тому ваш Smart TV приймає, зберігає та передає файли cookies, щоб забезпечити належну роботу цих веб-сайтів і сервісів. Компанія також використовує файли cookies при наданні вам Сервісів. У цій політиці щодо Cookie Компанія описує, які файли cookies встановлюються на ваш Smart TV, і як ви можете ними керувати.\nЗверніть увагу, що усі особисті дані, які Компанія збирає та/або обробляє через або за допомогою файлів cookies, описані в Політиці конфіденційності, тому ви повинні читати Політику щодо Cookie разом із Політикою конфіденційності.\n1.Що таке cookie?\nCookie — це маленькі текстові файли, що можуть записуватись на ваш Smart TV. Коли ви здійснюєте доступ до веб-сайту або сервісу червоної кнопки телестанції, цей веб-сайт або сервіс може зберігати файл cookie на Smart TV. Упродовж наступних доступів файл cookie, щоб був встановлений на ваш Smart TV, надсилатиме інформацію стороні, що встановила цей файл cookie. Файли cookies дуже поширені та використовуються багатьма веб-сайтами і сервісами. Кожен файл cookie здебільшого містять ім'я домену, з якого цей файл надійшов, «строк дії» цього cookie та величину (зазвичай унікальний номер). Детальнішу інформацію про те, що таке cookies, і як вони працюють, можна знайти на www.allaboutcookies.org.\nCookies поділяються на функціональні cookies та нефункціональні cookies. Функціональні cookies — це cookies, які обов’язково необхідні для надання вам сервісів Smart TV, а з боку веб-сайтів і інших сервісів — для надання вам правильного контенту для Smart TV. Нефункціональні cookies — це всі інші cookies.\nЦя політика щодо cookie стосується файлів cookies, встановлених нами, а також рекламних файлів cookies, які можуть встановлюватись третіми сторонами через наші сервіси на ваш Smart TV. Ця політика щодо Cookie не стосується файлів cookies, що можуть бути встановлені при використанні сервісів Smart TV для доступу до сторонніх веб-сайтів, сервісів або застосунків. Стосовно цих файлів cookies дивіться відповідні політики щодо cookie третіх сторін. Однак у цій Політиці щодо Cookie описано, як видалити ці файли cookies (див. розділ 4 нижче).\n2.Які нефункціональні файли cookies ми використовуємо?\nРеклама: При використанні сервісів Smart TV на вашому Smart TV може розміщуватися відео та екранна реклама. Ця реклама може розміщуватись нами або третьою стороною через або за допомогою нашого рекламного сервера, який виконує центральну координуюючу роль стосовно розміщення такої реклами. Наш рекламний сервер або сторонній рекламний сервер встановить файл cookie на ваш Smart TV. За допомогою цього файла cookie рекламний сервер стежитиме, чи реклама була розміщена на вашому Smart TV, а також, чи хтось, хто використовує ваш Smart TV, клацнув на рекламі. Ми використовуємо цю збережену в рекламному файлі cookie інформацію, щоб пам’ятати, яка реклама вже розміщувалась на вашому Smart TV з метою уникнення частого показу однакової реклами на тому чи іншому Smart TV, і щоб ми могли врегулювати комерційні угоди з нашими партнерами по рекламі. Ми не будемо використовувати цю інформацію для розміщення цільової реклами. Окрім цього, третя сторона може використовувати нашу рекламну систему для розміщення реклами на вашому Smart TV та встановлення файлів cookies на ваш Smart TV під час розміщення цієї реклами. \nЦі файли cookies містять поміж іншого інформацію про розміщену рекламу, інформацію про те, на якому застосунку або домені ця реклама розміщується, та вашу IP-адресу. Це робиться для того, щоб пам’ятати, як часто розміщалась ця реклама, та з метою уникнення надто частого показу однакової реклами. Сторонні рекламодавці, які можуть розміщати рекламу, також можуть використовувати файли cookies для відстеження ваших дій на інших веб-сайтах, а також для показу реклами, що відповідає вашим уподобанням.\n3.Сторонні веб-сайти\nКоли ви відвідуєте сторонні веб-сайти або сервіси через сервіси Smart TV вашого телевізора Smart TV, то повністю можливо, що ці веб-сайти або сервіси встановлять cookies на ваш Smart TV, а також, що вони стежитимуть і зберігатимуть ваші дії на цих веб-сайтах. Ми не замовляємо та не заохочуємо такі дії і не використовуватимемо таку інформацію. Ознайомтесь із відповідними політиками щодо cookie та політиками конфіденційності на цих веб-сайтах і сервісах, щоб отримати детальнішу інформацію про те, як ці сторони використовують такі файли cookies.\n4.Видалення Cookie\nІнтерфейс користувача вашого Smart TV дозволяє видаляти усі файли cookies та інший збережений вміст локального браузера із вашого Smart TV. Дуже рекомендуємо видалити усі файли cookies та локально збережені налаштування перед продажем або утилізацією вашого Smart TV.\n5.Наші контакти\nЯкщо у вас виникли якісь питання або коментарі стосовно нашої Політики щодо Cookie, а також стосовно того, як ми використовуємо файли cookies, надішліть нам повідомлення на адресу FRsupport@tcl.com.\nВерсія: 1,0\n"];
var privacyPolicyTitle = "Політика конфіденційності – Онлайн-сервіси Smart TV";
var privacyPolicyConditions = ["При обробці ваших особистих даних ми поважаємо вашу конфіденційність. Ця політика конфіденційності описує механізм збирання, обробки та використання персональних даних, які ми отримуємо від вас за допомогою наших сервісів Smart TV («Сервіси»), а також які типи персональних даних ми збираємо про вас, що ми робимо з ними, та ваші права стосовно використання нами персональних даних. \n1.Оператор персональних даних\nЗбір, обробка та використання персональних даних, отриманих від вас при використанні Сервісів, виконується компанією Shenzhen TCL New Technology Co., Ltd., No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, Китай («Компанія»). Зверніть увагу, що ми, однак, не відповідаємо за усі нижченаведені дії щодо обробки даних. Ми, проте, включили опис таких відповідних дій у нашу політику конфіденційності, оскільки ця обробка пов’язана з вашим використанням Smart TV.\n2.Згода на обробку даних\nДеякий збір, обробка та/або використання ваших особистих даних потребує вашої згоди. \nЯкщо ви погодились із використанням ваших особистих даних з метою покращення Сервісів, тоді ваша згода матиме такий вигляд:\n«Я погоджуюсь на збирання, обробку та використання даних щодо часу увімкнення мого пристрою, списку каналів DTV, списку вибраних каналів, а також часу відвідування та перегляду каналів, з метою аналізу звичок користувача та з метою покращення Сервісів та/або аналізу того, скільки онлайн-користувачів має Компанія на день/місяць/рік, а також для надання цієї інформації телестанціям».\nЯкщо ви погодились на використання ваших особистих даних для реклами, скроєної згідно ваших зацікавлень, ваша згода матиме такий вигляд:\n«Я погоджуюсь на збирання, обробку та використання даних щодо мого типу клієнта та країни з метою отримання відповідних рекламних пропозицій».\nЗгода є добровільною і ви зможете використовувати Сервіси, навіть якщо ви не дасте згоду. Проте ви можете бачити рекламу та інший вміст, не скроєний згідно ваших уподобань. Незалежно від вашої згоди Компанія залишає за собою право збирати, обробляти та/або використовувати вищезгадані дані в обсязі, що дозволяється чинним законодавством.\nВи можете в будь-який час відкликати вашу згоду на будь-яку з вищенаведених дій і ця відмова стане чинною у майбутньому. Ви можете заборонити використання ваших особистих даних для маркетингу, для знаходження ринку збуту або вивчення суспільної думки, а також для кроєння Сервісів до ваших потреб. Щоб відкликати вашу згоду та/або заборонити використання ваших даних, змініть відповідно налаштування конфіденційності у вашому телевізорі Smart TV.\n3.Зібрані особисті дані\nНезалежно від вашої згоди Компанія збрирає, обробляє, зберігає та використовує такі категорії даних:\nDevice-ID: Ваш Smart TV зберігає фіксований унікальний номер, який дозволяє нам ідентифікувати та встановлювати справжність Smart TV, коли ви використовуєте Сервіси. Цей номер називається Device-ID. Номер Device-ID буде наданий нашому сервісному партнеру для надання вам Сервісів. Ми також надаємо номер Device-ID вибраним інформаційним партнерам з метою аутентифікації. Ці інформаційні партнери використовують номер Device-ID для аутентифікації вашого Smart TV з метою надання доступу до своїх сервісів.\nIP-адреса та MAC-адреса: При доступі до інтернету вашому Smart TV буде присвоєно IP-адресу. Ця IP-адреса буде передаватись нам та оброблятись нами кожного разу, коли Smart TV робитиме запит інформації або даних із Сервісів. Якщо ваш Smart TV підключений через маршрутизатор (наприклад, у локальній домашній мережі або у локальній безпроводовій мержі WLAN), ми можемо збирати та обробляти IP-адресу цього маршрутизатора. MAC-адреса — це унікальний номер, що присвоюєтья кожному мережному інтерфейсу вашого Smart TV. MAC-адреса також буде збиратись та оброблятись нами, коли Smart TV запитуватиме інформацію або дані у Сервісах.\nЗапит Сервісом даних: При кожному підключенні вашого Smart TV до інтернету та увімкненні Smart TV він автоматично підключається до Сервісів, якими керує наш сервісний партнер. Після цього ваш Smart TV пройде аутентифікацію для отримання доступу до Сервісів. З метою аутентифікації у Сервісах зберігається один або більше унікальних ідентифікаційних номерів, пов’язаних із вашим Smart TV. При підключенні до Сервісу Smart TV передасть присвоєну йому IP-адресу і дані про пристрій (модель Smart TV, версію ПЗ), щоб перевірити наявність оновлень.\nНалаштування Сервісу: У рамках звичайної функціональності Сервісів ви можете вручну налаштовувати порядок відображення застосунків у Сервісах. Наш сервісний партнер збереже ваш порядок відображення застосунків та інші параметри, які ви встановите під час використання Сервісів. Ця інформація буде прив’язана до вашого номера Device-ID.\nДані про пристрій: Smart TV зберігає певну інформацію про себе та свою конфігурацію. Ці дані включають в себе тип Smart TV, версію операційної системи Smart TV, роздільну здатність його панелі, номер проекту (тобто інформацію щодо файлів налаштувань), агент користувача, назву браузера, версію браузера, а також мову та країну, які ви зазначили в Smart TV. Ця інформація буде використовуватися нами, а також буде надана нашому сервісному партнеру та інформаційним партнерам.\nРеклама: Сервіси можуть розміщувати рекламні оголошення. Ці рекламні оголошення розміщуються нами або третіми особами за допомогою призначеного нами рекламного інвентаря. Усі рекламні оголошення розміщуються за допомогою або через наш рекламний сервер, який виконує координуючу роль для розміщення реклами. Наш рекламний сервер або рекламний сервер третьої сторони можуть встановлювати файли cookie на Smart TV. Будь ласка, зверніться до нашої політики щодо файлів cookie для отримання додаткової інформації про ці файли cookie.\nТрафік Сервісу та інформаційного партнера: При використанні Сервісів ваш Smart TV робитиме запит даних від цих Сервісів через інтернет. У рамках цих запитів ваша IP-адреса, як описано вище, а також мова та країна, що були налаштовані у вашому Smart TV, будуть передані нашому сервісному партнеру. Наш сервісний партнер оброблятиме ці відповідні дані згідно з його політикою конфіденційності.\nВикористання другого екрана: Якщо ви використовуєте наш застосунок, що відображає другий екран, елементи керування, які ви активуєте у застосунку, а також налаштування країни і мови, список каналів DTV, список улюблених каналів, списки з розкладами, номер Device-ID, поточний канал, версія протоколу та IP-адреса вашого Smart TV, будуть зібрані та оброблені нами на наших серверах. Після цього наші сервери будуть керувати вашим Smart TV так, як ви задали це у застосунку, що відображає другий екран.\nHbbTV - « Червона кнопка»: ТВ-станції («Станції») можуть надсилати додаткову інформацію зі своїм ТВ-сигналом. Якщо Smart TV отримує певні інструкції в такій додатковій інформації, і якщо він підключений до інтернету, Smart TV завантажить зображення або маленьку сторінку з веб-сайту станції та відобразить її разом з інформацією; натисніть «Червону кнопку» на своєму пульті дистанційного керування, якщо ви хочете використовувати додаткові послуги, що надаються станцією.  Це стається кожного разу, коли ви перемикаєте канали. Завантажуючи зображення з веб-сайту станції, Smart TV передасть деякі особисті дані, наприклад, список каналів DTV, поточний канал, таблицю інформації про події, час телевізора, IP-адресу вашого Smart TV та файли cookie, що зберігаються на Smart TV (якщо такі є). Ця станція відповідає за збір, обробку та/або використання цих даних. Окрім того, якщо ви використовуєте додаткові служби, що пропонуються станцією за допомогою червоної кнопки, станція може збирати інші особисті дані про вас (наприклад, які відеозаписи на вимогу ви переглядаєте, які новини читайте тощо).\n4.З якою метою ми обробляємо та/або використовуємо особисті дані\nМи обробляємо зібрані дані з наступною метою:\nНадання сервісів: Ми використовуємо IP-адресу та MAC-адресу, номер Device-ID, версію операційної системи Smart TV, тип клієнта вашого Smart TV та роздільну здатність панелі телевізора, номер проекту (тобто інформацію щодо файлів налаштувань), ваш список каналів DTV, переглянуті канали, часовий пояс, а також налаштування країни і мови, для того щоб надати вашому Smart TV доступ до Сервісів та сервісів, що надаються інформаційними партнерами. Цілі включають (але не обмежуються) аутентифікацію, надання вам послуг із визначенням місцезнаходження (наприклад, прогноз погоди); робота зі зловживаннями, управління інцидентами безпеки, моніторинг доступності Сервісів та забезпечення сервісів резервного копіювання уподобань користувача.\nАвтентифікація: Ми використовуємо номер Device-ID та MAC-адресу з метою автентифікації.\nОновлення ПЗ: При кожному увімкненні ваш Smart TV надає нам IP-адресу, номер Device-ID, версію ПЗ, тип клієнта вашого Smart TV, номер проекту (тобто файли налаштувань), номер користувача та серійний номер, щоб запропонувати та надати вам відповідні оновлення ПЗ. \nПокращення Сервісів: Ми використовуємо агреговані та анонімні дані щодо використання (тобто дані про вашу взаємодію з Сервісами), щоб покращити ці Сервіси.\nРозміщення реклами: Ми використовуємо інформацію в рекламних файлах cookie, щоб система могла відстежувати, які оголошення були показані на вашому Smart TV, щоб переконатися, що ви не отримуєте занадто багато схожих рекламних оголошень, і щоб ми могли врегулювати комерційні угоди з нашими партнерами по рекламі. Зовнішні рекламодавці, які після узгодження з нашим рекламним сервером розміщують рекламу на Сервісах або веб-сайтах інформаційних партнерів, також можуть використовувати файли cookie, щоб відстежувати вас на інших веб-сайтах та розміщувати рекламу, яка відображає ваші особисті уподобання.\nОптимізація реклами: Ми використовуємо дані, пов'язані з переглядом реклами та натисканням на рекламі, щоб оптимізувати роботу користувачів із рекламою у Сервісі.\nЗнижки: Ми надаємо номер Device-ID вибраним інформаційним партнерам, щоб вони мали змогу визначити, у якій мірі вони можуть забезпечити вас доступом до файлів відео на вимогу з їх колекції.\nЗастосування права: Від нас можуть вимагати надання даних компетентним правоохоронним або судовим органам. Якщо ми це зробимо, то зробимо тільки за умови наявності таких юридичних інструментів, як ордер або судове рішення, які вимагають від нас співпрацю з відповідними органами.\nПри використанні Сервісів можна використовувати псевдоніми, однак певні сервіси можуть вимагати вказання вашого імені та/або електронної адреси.\n5.Категорії отримувачів\nКомпанія надсилає ваші особисті дані, зібрані під час вашого використання Сервісів, тільки таким третім сторонам:\nСтороннім провайдерам сервісів Smart TV, якщо ви запитували такі сервіси (наприклад, якщо ви запускали застосунок Netflix на вашому Smart TV, ми можемо надати вашу IP-адресу, MAC-адресу, версію ПЗ та назву моделі телевізора компанії Netflix).\nСтороннім інформаційним партнерам, якщо ви запитували певний вміст у цих інформаційних партнерів (наприклад, для надання вам сервісу GoLive IP TV ми можемо надати ваш тип клієнта ТВ, IP-адресу та мовні налаштування юридичній особі, що надає сервіс GoLive).\nКомпанія передасть ваші особисті дані третім сторонам у тому обсязі, на який ви погодились вище.\nПровайдерам аутсорсингового сервісу у ролі обробників даних, які допомагають Компанії надавати Сервіси.\nКомпанія надає ваші особисті дані третім сторонам тільки тоді, якщо Компанія зобов’язана робити це на основі вимог законодавства (наприклад, судовим органам або органам карного розшуку), якщо ви погодилися на таке надсилання або це надсилання є законним згідно чинного законодавства.\n6.Країни, в яких буде здійснюватися обробка ваших даних\nКомпанія та/або деякі вищенаведені отримувачі ваших особистих даних можуть знаходитись за межами Європейської економічної зони (тобто в таких країнах, як Китайська народна республіка, Сполучені Штати Америки), Тому ваші особисті дані можуть оброблятись у країнах, які не забезпечують адекватний рівень захисту особистих даних згідно з Директивою 95/46/EC Європейського парламенту та Ради Європи від 24 жовтня 1995 року щодо захисту осіб при обробці особистих даних і вільного переміщення таких даних.\n7.Ваші права\nВи можете звернутися у Компанію для отримання інформації про ваші особисті дані, оброблені Компанією, та/або скористатись вашим законним правом стосовно доступу, виправлення, видалення та блокування ваших особистих даних; та/або опротестувати обробку ваших особистих даних з маркетинговою метою, з метою вивчення ринку або вивчення суспільної думки.\n8.Зміни до Політики конфіденційності\nДля покращення наших Сервісів нам може бути потрібно внести поправки в Політику конфіденційності, наприклад, при впровадженні нових технологій або нових сервісів. Ми залишаємо за собою право змінювати або доповнювати цю Політику конфіденційності у будь-який час.\n9.Контактна інформація\nЯкщо ви маєте якісь питання щодо Політики конфіденційності або бажаєте оскаржити нашу роботу з вашими особистими даними, будь ласка, звертайтесь до нас у один із наступних способів:\nЕл. пошта: FRsupport@tcl.com\nВерсія: 1.0\n"];
var privacyPolicyTerms = [
    "Увімкнути сервіс Smart TV",
    "Я погоджуюсь зі збиранням, обробкою та використанням даних щодо часу увімкнення мого пристрою, списку каналів ЦТВ, списку вибраних каналів, часу відвідування та переглянутих каналів з метою аналізу звичок користувача і покращення послуг та/або аналізу, скільки онлайн-користувачів є у TCL за день/місяць/рік, а також для надання цієї інформації ТВ-станціям.",
    "Увімкнути рекомендований сервіс.",
    "Увімкнути застосунок другого екрана для мобільних пристроїв",
    "Увімкнути автоматичне оновлення ПЗ.",
    "Увімкнути сервіс FreeviewPlay."
];
var privacyPolicyTips = [
    "Усі сервіси Smart TV були вимкнені.",
    "Сервіс HbbTV, що надається ТВ-каналами, буде вимкнений при використанні вбудованого тюнера.",
    "Сервіс з рекомендування вмісту та телепрограм буде вимкнено.",
    "Застосунок другого екрана буде вимкнено.",
    "Телевізор не буде автоматично перевіряти наявність оновлень ПЗ та нових функцій.",
    "Вміст FreeviewPlay буде вимкнено."
];
var privacyPolicyRemind = "Поставте галочку у відповідному квадратику в Налаштуваннях.";
var set = "Встановити";
var copyShopDemoTips = ["Підключення до USB, скопіювати відео на флеш-пам'ять?","Скопіювати відео на флеш-пам'ять","Відео скопійовано успішно!","Помилка копіювання відео!"];
var dataDeletionWords = ["Видалити з внутрішніх серверів Ваші дані Smart TV.","Примітки: Після встановлення цього прапорця протягом одного місяця будуть видалені дані, пов'язані з Вашим обліковим записом користувача Smart TV. Майте на увазі, що видалення не розповсюджується на локальні дані, що зберігаються на телевізорі.","Більше не надсилати дані на сервер Smart TV.","Примітки:  Після встановлення цього прапорця дані, пов'язані з користуванням послугами Smart TV, більше не надсилатимуться на сервер. Ваш телевізор більше не отримуватиме рекомендовані послуги.","Якщо бажаєте дізнатись більше, відвідайте веб-сайт www.tcl.eu"];
var miracastWords = ["Бездротове підключення","Віддзеркалити телефон Android на ТВ","Клацніть для підключення","Ця функція доступна лише на телефоні Android"];
var miracastTips = ["Кроки із підключення","Відкрити налаштування системи","Інші способи підключення \n / Інші бездротові підключення","Виберіть бездротовий дисплей","Клацніть для підключення \n можна знайти"];
var termsAndConditions = ["\nВміст та сервіси (далі «Ліцензійна програма»), які стали доступними вам через цей телевізор (далі «Пристрій), є ліцензовані, а не продаються, і надані вам для використання тільки згідно цих положень і умов. Кожен провайдер Ліцензійної програми (далі «Провайдер програми») залишає за собою всі права не явно надані вам.\n\n1.	Обсяг ліцензії\n\nЛіцензія, видана вам на Ліцензійну програму відповідним Провайдером програми є непередавальною ліцензією, яка дозволяє використовувати Ліцензійну програму тільки на Пристрої, який належить вам. Вам забороняється поширювати цю Ліцензійну програму або робити її доступною в мережі, де її можуть використовувати декілька пристроїв одночасно. Вам забороняється орендувати, здавати в оренду, позичати, продавати, поширювати або субліцензувати цю Ліцензійну програму. \n\nУсі Ліцензійні програми та весь вміст включений та доступний через цей Пристрій належать Провайдеру програми і захищені чинним законодавством про інтелектуальну власність. Якщо інше не дозволяється чинним законодавством, ви не маєте право змінювати, копіювати, декомпілювати, реконструювати, розбирати, перевидавати, завантажувати, публікувати, передавати, перекладати, пробувати витягувати вихідний код, створювати похідні роботи або будь-яким іншим чином використовувати будь-яку Ліцензійну програму або будь-які оновлення або будь-які її частини. У випадку порушення цього обмеження ви можете підпадати під обвинувачення та отримати позов щодо відшкодування збитків. Умови ліцензії регулюватимуть будь-які оновлення, надані Провайдером програми, які замінюють та/або доповнюють оригінальну Ліцензійну програму; однак якщо для такого оновлення існує окрема ліцензія, то у такому випадку будуть діяти умови цієї окремої ліцензії. Ви несете виключну відповідальність за всі можливі витрати (якщо такі є) за оновлення Ліцензованої програми.\n\n2.	Матеріали сторонніх осіб\n\nЛіцензійна програма може надавати доступ до сервісів Провайдера програми, сторонніх сервісів та веб-сайтів (далі «Сервіси»). Використовуючи будь-які Сервіси, ви можете зустріти вміст, який може вважатися образливим, непристойним чи неприйнятним, а також вміст, який може визначатися, а може й ні, як нецензурний; окрім цього, результати будь-якого пошуку або введення певної URL-адреси можуть автоматично і ненавмисно генерувати посилання та довідки на неприйнятний матеріал. Однак виробник цього Пристрою («Виробник») та Провайдер програми не несуть жодної відповідальності за вміст, який може бути визнано як образливий, непристойний або неприйнятний. \n\nВиробник не несе відповідальність за перевірку чи оцінку вмісту, точності, повноти, своєчасності, дійсності, дотримання авторських прав, законності, якості чи будь-якого іншого аспекту таких Сервісів. Виробник не гарантує, не схвалює, не бере на себе будь-які зобов’язання та не несе жодної відповідальності перед вами чи перед будь-якою іншою особою за будь-який із Сервісів. \n\nСервіси можуть містити власний вміст, інформацію та матеріали (далі «Сторонні матеріали»), які захищені відповідною інтелектуальною власністю та іншими законами, і ви не маєте право використовувати такі Сторонні матеріали у жодний інший спосіб, окрім дозволений у Сервісах. Якщо інше не дозволяється чинним законодавством, ви не маєте право відтворювати, змінювати, орендувати, здавати в оренду, позичати, продавати, розповсюджувати Сторонні матеріали або створювати їх похідні матеріали в будь-який спосіб, і ви не маєте право використовувати Сервіси у будь-який несанкціонований спосіб. Ви не маєте право використовувати Сервіси в будь-який спосіб із метою дратування, ображання, висліджування, погрожування, обмовляння або будь-якого іншого нехтування або порушення прав будь-якої іншої сторони, і Виробник у жодному разі не несе відповідальність, як за будь-яке таке використання вами, так і за будь-які ганебні, загрозливі, наклепницькі, образливі або незаконні повідомлення або передавання, які ви можете отримати внаслідок використання будь-якого Сервісу. \n\n3.	Відсутність гарантії\n\nУсі Ліцензійні програми та Сервіси надаються \"як є\" та \"як доступно\" без будь-яких гарантій будь-якого виду, як прямих, так і опосередкованих. Виробник прямо відмовляється від усіх гарантій та умов стосовно Ліцензійних програм та Сервісів, як виражених, так і неявних, в тому числі, але не обмежуючись ними, від гарантій товарного стану, належної якості, придатності для певних цілей, точності, спокійного використання та непорушення прав третьої сторони. Виробник не гарантує точність, достовірність, своєчасність, законність або повноту будь-якої Ліцензійної програми чи Сервісу, які є доступні через цей пристрій, і не гарантує, що Пристрій, Ліцензійні програми або Сервіси відповідатимуть вашим вимогам, а також, що робота Ліцензійних програм або Сервісів буде безперервною або без помилок, або що дефекти у Ліцензійній програмі або Службах будуть виправлені. Якщо Ліцензійна програма або Сервіси виявляться дефектними, ви повинні будете взяти на себе всі витрати для проведення необхідного обслуговування, ремонту або виправлення.\n\nЛіцензійні програми та Сервіси можуть бути змінені, призупинені, вилучені, завершені або перервані, або доступ до них може бути відключений у будь-який час без попередження, і Виробник не робить жодних заяв та не дає жодних гарантій щодо того, що будь-який вміст або сервіс, включений до Ліцензійних програм та Сервісів, буде залишатись доступним протягом будь-якого періоду часу. Такий вміст та сервіси передаються третіми сторонами за допомогою мереж та засобів зв’язку, які Виробник не контролює. Не обмежуючи загальний характер вищевикладеного, Виробник прямо відмовляється від будь-якої відповідальності або відповідальності за будь-які зміни, переривання, відключення, вилучення або призупинення будь-якого вмісту чи сервісу, доступного через цей Пристрій. Провайдер програми та інші провайдери Сервісів залишають за собою право змінювати, призупиняти, видаляти або вимикати доступ до будь-якої Ліцензійної програми або Сервісів у будь-який час без попередження. Виробник може також накладати обмеження на використання або доступ до певних Ліцензійних програм або Сервісів у будь-якому випадку і без попередження або відповідальності.\n\nВиробник не забезпечує клієнтське обслуговування стосовно Ліцензійних програм та Сервісів. Будь-які питання або запити на обслуговування стосовно Ліцензійних програм та Сервісів слід направляти безпосередньо відповідному провайдеру.\n\n4.	Збирання та використання інформації\n\nВиробник, Провайдери програм та провайдери Сервісів можуть збирати та використовувати технічні дані і відповідну інформацію, в тому числі, але не обмежуючись, технічну інформацію про цей Пристрій, систему, програмне забезпечення та периферійні пристрої, щоб полегшити надання вам оновлень програмного забезпечення, підтримки виробу та інших сервісів (якщо такі є), пов’язаних із Пристроєм та Ліцензійною програмою. Виробник, Провайдери програм та провайдери Сервісів можуть використовувати таку інформацію для вдосконалення своїх продуктів або для надання вам сервісів і технологій доти, доки вона знаходиться у формі, яка не ідентифікує вас особисто. Докладніше про збирання та використання інформації читайте в наші політиці конфіденційності за адресою: http://www.tcl.eu/en/.\n\n5.	Відсутність певних функцій\n\nУ зв’язку з обмеженнями Провайдера програми деякі функції, застосунки та сервіси можуть бути недоступні на цьому Пристрої (включаючи периферійні пристрої) або на деяких територіях. Для використання деяких функцій на цьому Пристрої можуть бути потрібні додаткові периферійні пристрої або членство, які можна придбати окремо.\n\n6.	Обмеження відповідальності\n\nУ тій мірі, в якій це не заборонено чинним законодавством, за жодних обставин, включаючи недбалість, виробник не несе відповідальність, незалежно від контракту чи правопорушень, за будь-які прямі, непрямі, випадкові, спеціальні або опосередковані збитки, витрати на адвоката, інші витрати чи будь-які інші збитки, що виникають або пов'язані з будь-якою розміщеною інформацією або внаслідок використання Пристрою, будь-якої Ліцензійної програми або будь-якого Сервісу вами або будь-якою третьою стороною, навіть при наявності попередження про можливість подібних збитків.\n\nВиробник не несе відповідальність за навмисне або грубе недбальство."];
var privacyNotice = ["\nПри обробці ваших особистих даних ми поважаємо вашу конфіденційність. Це повідомлення про конфіденційність містить інформацію про організацію, яка відповідає за обробку особистих даних, отриманих від вас під час використання сервісів Smart TV («Сервіси»), типи ваших особистих даних, які ми збираємо, що ми робимо з цими даними, та ваші права щодо використання нами ваших особистих даних. \n\n1.	Контролер даних та представник в країнах ЄС\n\nЗбір, обробка та використання особистих даних, отриманих від вас при використанні Сервісів, виконується компанією Shenzhen TCL New Technology Co., Ltd., No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, Китай («Компанія»). Наші контактні дані та контактні дані нашого представника в країнах ЄС наводяться в Розділі 12 нижче. Зверніть увагу, що ми, однак, не відповідаємо за усі нижченаведені дії щодо обробки даних. Тим не менш, у повідомленні про конфіденційність ми наводимо опис відповідних дій, оскільки така обробка пов'язана з використанням вами Smart TV.\n\n2.	Погодження з обробкою даних\n\nДеякі дії з обробки даних, як-от використання ваших особистих даних з метою покращення Сервісів, вимагають вашої згоди.\n\nЗгода є добровільною і ви зможете використовувати Сервіси, навіть якщо ви не дасте згоду. Проте ви можете бачити вміст, що не відповідає вашим уподобанням. Незалежно від вашої згоди, ми залишаємо за собою право на обробку ваших особистих даних в межах, дозволених відповідними законами.\n\nВи можете в будь-який час скасувати вашу згоду. Скасування згоди не впливає на законність обробки, виконаної відповідно до попередньої згоди. Для скасування вашої згоди та/або оскарження (див. нижче Розділ 10 та Додаток про ваші права щодо оскарження) змініть відповідним чином налаштування конфіденційності вашого Smart TV.\n\n3.	Певні категорії особистих даних\n\nМи обробляємо у тому числі такі категорії даних:\n\nDevice-ID: Ваш Smart TV зберігає фіксований унікальний номер, який дозволяє нам ідентифікувати та встановлювати справжність Smart TV, коли ви використовуєте Сервіси. Цей номер називається Device-ID. \n\nIP-адреса та MAC-адреса: При доступі до інтернету вашому Smart TV буде присвоєно IP-адресу. Якщо ваш Smart TV працює через маршрутизатор (напр., в домашній мережі чи локальній WLAN), ми можемо обробляти IP-адресу цього маршрутизатора. MAC-адреса — це унікальний номер, що присвоюється кожному мережному інтерфейсу вашого Smart TV. \n\nДані про пристрій: Smart TV зберігає певну інформацію про себе та свою конфігурацію. Ці дані включають в себе тип Smart TV, версію операційної системи Smart TV, роздільну здатність його панелі, номер проекту (тобто інформацію щодо файлів налаштувань), агент користувача, назву браузера, версію браузера, а також мову та країну, які ви зазначили в Smart TV. \n\nТака інформація буде використовуватися нами і буде надаватися нашому сервісному партнеру та інформаційним партнерам з цілями, про які написано нижче.\n\n4.	Цілі обробки та/або використання ваших особистих даних і законні підстави\n\nНижче розповідається про цілі обробки ваших особистих даних та відповідні законні підстави. В тому об'ємі, в якому контрактні положення згадуються нижче як законна підстава, ми не можемо надавати вам Сервіси, якщо ви не надаватимете нам відповідні дані. В тому об'ємі, в якому ваша згода згадується як законна підстава, ви вільні надавати або не надавати згоду. Якщо ви не надаєте згоду, ми не будемо обробляти ваші особисті дані для відповідних цілей\n\n•	Надання Сервісів: Ми використовуємо IP-адресу та MAC-адресу, номер Device-ID, версію операційної системи Smart TV, тип клієнта вашого Smart TV та роздільну здатність панелі телевізора, номер проекту (тобто інформацію щодо файлів налаштувань), ваш список каналів DTV, переглянуті канали, часовий пояс, а також налаштування країни і мови, для того щоб надати вашому Smart TV доступ до Сервісів та сервісів, що надаються інформаційними партнерами. Цілі включають, поміж іншого, надання сервісів, пов'язаних з місцезнаходженням (як-от прогноз погоди), запобігання домаганням, усунення порушень безпеки, відстеження доступності Сервісів та надання сервісів з резервного копіювання уподобань користувача.\n\nПри використанні Сервісів ваш Smart TV робитиме запит даних від цих Сервісів через інтернет. У рамках цих запитів ваша IP-адреса, як описано вище, а також мова та країна, що були налаштовані у вашому Smart TV, будуть передані нашому сервісному партнеру. Наш сервісний партнер оброблятиме відповідні дані згідно свого повідомлення про конфіденційність.\n\nЗаконною підставою для відповідної обробки ваших особистих даних є контрактні положення, викладені в Статті 6 (1) b) Генеральний регламент із захисту персональних даних («GDPR»).\n\n•	Налаштування Сервісів: У рамках звичайної функціональності Сервісів ви можете вручну налаштовувати порядок відображення застосунків у Сервісах. Наш сервісний партнер зберігатиме порядок відображення та інші уподобання, які ви можете встановити під час використання Сервісів. Ця інформація буде прив’язана до вашого номера Device-ID.\n\nЗаконною підставою відповідної обробки ваших особистих даних є контрактні положення, викладені в Статті 6 (1) b) GDPR.\n\n•	Аутентифікація: При кожному підключенні вашого Smart TV до інтернету та увімкненні Smart TV він автоматично підключається до Сервісів, якими керує наш сервісний партнер. Після цього ваш Smart TV пройде аутентифікацію для отримання доступу до Сервісів. З метою аутентифікації у Сервісах зберігається один або більше унікальних ідентифікаційних номерів, пов’язаних із вашим Smart TV. Ми використовуємо номер Device-ID та MAC-адресу з метою автентифікації. Ми також надаємо номер Device-ID вибраним інформаційним партнерам з метою аутентифікації. Ці інформаційні партнери використовують номер Device-ID для аутентифікації вашого Smart TV з метою надання доступу до своїх сервісів.\n\nЗаконною підставою відповідної обробки ваших особистих даних є контрактні положення, викладені в Статті 6 (1) b) GDPR.\n\n•	Дистанційна діагностика: У рамках надання Сервісів, ми також надаємо вам сервіси з дистанційної діагностики. Таким чином, ми обробляємо Device-ID, номер пристрою, серійний номер, MAC-адресу, журнали помилок, коди помилок та опис помилок, що надається несправним модулем (застосунок, проміжна система).\n\nЗаконною підставою відповідної обробки ваших особистих даних є контрактні положення, викладені в Статті 6 (1) b) GDPR.\n\n•	Післяпродажне обслуговування: Згідно відповідних законів у вас може бути гарантія або схожі права на післяпродажне обслуговування. Обробкою гарантійних та інших запитів щодо післяпродажного обслуговування та обробкою пов'язаних з цим особистих даних займається компанія TCL Europe, 9-15 rue Rouget de L'Isle- 92130 Issy- Les-Moulineaux, Франція. Тобто, в рамках післяпродажного обслуговування контролером даних виступає компанія TCL Europe і ми не несемо відповідальність за відповідну обробку ваших особистих даних.\n\nКоли ви звертаєтесь для отримання післяпродажного обслуговування, для надання такого обслуговування може знадобитись ваше ім'я, адреса електронної пошти, номер телефону, запит обслуговування та поштова адреса з рахунку-фактури. Інформація може також збиратись через партнерів з післяпродажного обслуговування наших торговельних посередників або сертифікованих постачальників послуг, якщо ви звертаєтесь до них по обслуговування. Для отримання більш детальної інформації щодо захисту особистих даних, що збираються під час післяпродажного обслуговування, ви можете звернутись до TCL Europe, скориставшись контактними даними з Розділу 12 нижче.\n\nЗаконною підставою для відповідної обробки даних є обов'язок дотримуватись правових зобов'язань, наведених у Статті 6 (1) c) GDPR.\n\n•	T-Launcher: T-Launcher є головною сторінкою для використання Smart TV в операційній системі Linux (робота в операційній системі Android описана нижче), за допомогою якої можна вибирати потрібний вміст.\n\nЗаконною підставою обробки ваших особистих даних, що є обов'язковою для використання T-Launcher, є контрактні положення, викладені в Статті 6 (1) b) GDPR.\n\nВідповідно до вашої попередньої згоди ми також відстежуватимемо використання T-Launcher, а саме нас цікавлять так дані.\n	Коли ви починаєте користуватись T-Launcher, ми записуємо час входу та виходу з T-Launcher.\n	Коли ви починаєте відтворювати відео в T-Launcher, ми записуємо назву та тривалість відео (не відноситься до Netflix, YouTube та будь-яких інших сервісів сторонніх постачальників).\n	Коли ви заходите на сторінку та залишаєте її, ми записуємо час перебування на сторінці.\n	Коли ви пересуваєте курсор з одного місця до іншого або запускаєте застосунок, ми записуємо цю подію.\n	Коли ви інсталюєте, видаляєте або оновлюєте застосунки, ми записуємо ці події, включно з назвами застосунків.\n\nМи збираємо таку інформацію в основному для аналізу великих об'ємів даних з метою покращення продуктів та надання користувачам більш якісного контенту та сервісів.\n\nЗаконною підставою обробки ваших особистих даних у зв'язку з відстеженням використання вами T-Launcher, є контрактні положення, викладені в Статті 6 (1) a) GDPR.\n\nЯкщо ви придбали Android TV і використовуєте операційну систему Android від Google, ваші особисті дані обробляються Google і ми не несемо відповідальність за таку обробку. Інформацію про обробку даних та ваші відповідні права дивіться в повідомленні про конфіденційність Google.\n\n•	T-Cast: T-Cast дозволяє керувати телевізором за допомогою телефону та транслювати на телевізорі відео, музику і зображення зі смартфона. T-Cast також дозволяє відтворювати екран смартфона на телевізорі.\n\nЗавантаження і використання цього застосунку здійснюється за власним бажанням. У разі завантаження і використання застосунку, ми обробляємо MAC-адресу, щоб підрахувати кількість версій T–Cast, які використовуються на ринку. Ця процедура є обов'язковою для надання вам цього сервісу. Якщо ви використовуєте нашу функцію другого екрана, ми збираємо та обробляємо на наших серверах таку інформацію, як вибрані у застосунку засоби керування, вибрана країна та мова, список каналів DTV, список улюблених каналів, встановлені записи за графіком, номер Device-ID, поточний канал, версія протоколу та IP-адреса вашого Smart TV. Після цього наші сервери керуватимуть вашим Smart TV згідно інструкцій, які ви надаєте за допомогою застосунку.\n\nЗаконною підставою відповідної обробки ваших особистих даних є контрактні положення, викладені в Статті 6 (1) b) GDPR.\n\n•	Оновлення програмного забезпечення: Оновлення програмного забезпечення є частиною Сервісів. Таким чином, щоразу як ви вмикаєте Smart TV, він надає нам IP-адресу, номер Device-ID, номер пристрою, версію програмного забезпечення, тип клієнта вашого Smart TV, номер проекту (тобто інформацію щодо файлів налаштувань), ідентифікатор користувача та серійний номер, що дозволяє нам знайти і надати вам оновлення програмного забезпечення.\n\nЗаконною підставою відповідної обробки ваших особистих даних є контрактні положення, викладені в Статті 6 (1) b) GDPR.\n\n•	Застосування права: Від нас можуть вимагати надання даних компетентним правоохоронним або судовим органам. Якщо ми це зробимо, то зробимо тільки за умови наявності таких юридичних інструментів, як ордер або судове рішення, які вимагають від нас співпрацю з відповідними органами.\n\nЗаконною підставою для відповідної обробки даних є наш обов'язок дотримуватись правових зобов'язань, наведених у Статті 6 (1) c) GDPR.\n\nПри використанні Сервісів можна використовувати псевдоніми, однак певні сервіси можуть вимагати вказання вашого імені та/або електронної адреси.\n\n5.	Конфіденційність та безпека для дітей молодше 16 років\n\nМи розуміємо важливість додаткових заходів безпеки для забезпечення конфіденційності та безпеки дітей під час використання наших Сервісів. Дітям молодше 16 років або аналогічного мінімального віку залежно від юрисдикції, не дозволяється надавати особисті дані за допомогою телевізора або під час звертання до служби післяпродажного обслуговування, якщо тільки вони не отримати від батьків згоду, яка може бути перевірена.\n\nОскільки ми ніколи не збираємо дати народження наших користувачів, ми не можемо визначити їх вік. Але якщо ми дізнаємось, що зібрали особисті дані дитини молодше 16 років або аналогічного мінімального віку залежно від юрисдикції, при цьому не було наведених вище обставин, що дозволяють це зробити, ми вживемо заходів, щоб якомога швидше видалити таку інформацію.\n\n6.	Застосунки сторонніх виробників\n\nВаш Smart TV дозволяє користуватися застосунками сторонніх виробників, як-от Netflix, YouTube або HbbTV (сервіс червоної кнопки надається телевізійними компаніями). Ви можете завантажувати застосунки з магазину застосунків або активувати застосунки сторонніх виробників, попередньо інстальовані на вашому пристрої. Попередньо інстальовані на вашому пристрої застосунки сторонніх виробників не збирають особисті дані без вашого попереднього дозволу. Наприклад, застосунок Netflix вже встановлений на пристрої, проте починає збирати дані лише після того, як ви увійдете до облікового запису Netflix. HbbTV збирає дані лише після того, як ви погодитесь із цим, натиснувши відповідну кнопку на пульті дистанційного керування.\n\nУ разі увімкнення застосунку стороннього виробника постачальник застосунку може обробляти ваші особисті дані. Ми не несемо відповідальність за таку обробку, тож для отримання інформації щодо обробки ваших даних і відповідних прав читайте повідомлення про конфіденційність застосунку стороннього виробника.\n\n7.	Категорії одержувачів\n\nМи надаємо ваші особисті дані, зібрані під час використання Сервісів, лише стороннім інформаційним партнерам, якщо ви запитуєте інформацію, що надається цими інформаційними партнерами, або постачальникам послуг, які виступають у якості обробників даних і допомагають нам із наданням Сервісів.\n\nМи надаємо ваші особисті дані іншим третім сторонам лише у тому разі, якщо зобов'язані це зробити за законом (напр., судам чи правоохоронним органам), якщо ви погодились надавати дані, або якщо надання даних дозволяється відповідними законами.\n\n8.	Країни, в яких буде здійснюватися обробка ваших даних\n\nМи та/або інші одержувачі ваших особистих даних, наведені вище, можемо знаходитись за межами Європейського економічного простору (напр., у Китайській Народній Республіці або Сполучених Штатах Америки). Таким чином, ваші особисті дані можуть оброблятись у країнах, де діють такі закони із захисту даних, які можуть надавати інший рівень захисту у порівнянні із законами вашої юрисдикції, і які, згідно GDPR, забезпечують недостатній рівень захисту особистих даних. У перелік країн, які забезпечують достатній рівень захисту даних згідно Європейського закону із захисту даних, включені такі країни, як Андора, Аргентина, Канада, Швейцарія, Фарерські острови, Гернсі, Держава Ізраїль, Острів Мен, Острів Джерсі, Нова Зеландія та Східна Республіка Уругвай. Одержувачі з США можуть мати часткову сертифікацію згідно Угоди про правила обміну конфіденційною інформацією між ЄС та США, і отже вважатися такими, що забезпечують достатній рівень захисту даних згідно Європейського закону із захисту даних. \n\nЗа необхідністю, ми вживемо відповідних заходів безпеки у тому, що стосується передавання даних одержувачам, які знаходяться за межами Європейського Союзу та не забезпечують достатній рівень захисту даних. Інформацію про відповідні заходи безпеки можна отримати, звернувшись до нас, як описано в Розділі 12 нижче.\n\n9.	Термін зберігання\n\nВаші особисті дані зберігаються так довго, як це необхідно для надання вам Сервісів. Для більшості даних це означає, що ми зберігатимемо їх протягом одного місяця. З метою дистанційної діагности та надання післяпродажного обслуговування ми можемо зберігати дані до десяти років. Коли ваші особисті дані більше не будуть нам потрібні для здійснення наших контрактних або юридичних зобов'язань, ми видалимо їх з наших систем і записів та/або вживемо заходів для належної анонімізації цих даних, щоб їх не можна було пов'язати з вами.\n\n10.	Ваші права\n\nЗгідно відповідних законів із захисту даних ви маєте право вимагати: доступ до ваших особистих даних, виправлення ваших особистих даних, видалення ваших особистих даних, обмеження обробки ваших особистих даних, забезпечення портативності даних, а також забороняти обробку ваших особистих даних. Майте на увазі, що згадані вище права можуть бути обмежені згідно відповідних національних законів із захисту даних. Докладніше про ці права читайте нижче в Додатку про ваші права.\n\nВи також маєте право подати скаргу у відповідний орган із нагляду за забезпеченням законодавства із захисту персональних даних.\n\nДля того щоб скористатися своїми правами, зверніться до нас, як описано в Розділі 12 нижче.\n\n11.	Зміни до повідомлення про конфіденційність\n\nДля покращення наших Сервісів ми можемо вносити зміни до цього повідомлення про конфіденційність – наприклад, через появу нових технологій або нових сервісів. Ми зберігаємо за собою право у будь-який момент вносити зміни або доповнювати це повідомлення про конфіденційність.\n\n12.	Контактна інформація та представник в країнах ЄС\n\nЯкщо у вас є будь-які питання стосовно повідомлення про конфіденційність або ви хочете поскаржитися на обробку нами ваших особистих даних, зверніться до нас, скориставшись наведеними нижче контактними даними:\n\nФорма зворотного зв'язку: www.tcl.eu/privacy/support\n\nНаш представник в країнах ЄС: Компанія TCL Europe, що має офіс за адресою 9-15 rue Rouget de L'Isle- 92130 Issy- Les-Moulineaux, Франція. Ви можете звернутись до компанії TCL Europe, скориставшись формою вище.\n\nВерсія: 2.0\n\nДодаток про ваші права\n\na.	Право на доступ: У вас може бути право отримати від нас підтвердження щодо того, чи обробляються ваші дані та, якщо це так, попросити надати доступ до ваших особистих даних. Інформація, яку ви можете запитати, включає, поміж іншого, мету обробки, категорії особистих даних, що обробляються, та одержувачів чи категорії одержувачів, яким були або будуть надані особисті дані. Проте таке право не є абсолютним і ваше право доступу може бути обмежене інтересами інших осіб.\n\nУ вас може бути право отримати копію особистих даних, що проходять обробку. За додаткові копії, які ви можете попросити, ми вимагатимемо розумну плату відповідно до адміністративних витрат. \n\nb.	Право на виправлення: У вас може бути право вимагати від нас виправлення неточних особистих даних про вас. Залежно від цілей обробки, у вас може бути право доповнити неповні особисті дані, включно із наданням доповнювальної заяви.\n\nc.	Право на видалення («право на забуття»): За певних обставин у вас може бути право вимагати від нас видалення ваших особистих даних і ми можемо бути зобов'язані видалити ці дані. \n\nd.	Право на обмеження обробки: За певних обставин у вас може бути право вимагати від нас обмеження обробки ваших особистих даних. У такому випадку відповідні дані будуть позначені і можуть оброблятися нами лише для певних цілей.\n\ne.	Право на портативність даних: За певних обставин у вас може бути право отримати ваші особисті дані, які ви надали нам, у структурованому, найуживанішому та придатному для використання на комп'ютері форматі, і у вас може бути право на передавання таких даних іншій стороні без жодних перешкод з нашого боку.\n\nf.	Право на оскарження:\n\nЗа певних обставин у вас може бути право, відповідно до вашої ситуації або якщо особисті дані обробляються з метою прямого маркетингу, у будь-який час оскаржити обробку ваших особистих даних нами і ми можемо бути зобов'язані припинити обробку ваших особистих даних.\n\nБільше того, якщо ваші особисті дані обробляються з метою прямого маркетингу, ви має право у будь-який час оскаржити обробку ваших особистих даних для здійснення такого маркетингу, що включає профілювання у тому обсязі, в якому воно пов'язане з прямим маркетингом. У такому випадку ваші особисті дані більше не будуть оброблятися нами з цією метою."];
var cookieNotice = ["\nМи поважаємо вашу конфіденційність при використанні вироблених нами телевізорів Smart TV та наших Сервісів. Файли cookie використовуються багатьма веб-сайтами та іншими інтернет-сервісами, тому ваш Smart TV приймає, зберігає та передає файли cookie, щоб забезпечити належну роботу цих веб-сайтів і сервісів. \n\nМи не використовуємо файли cookie під час надання вам Сервісів. Проте треті сторони (як-от постачальники застосунків сторонніх виробників) можуть використовувати файли cookie під час використання вами Smart TV для користування їхніми послугами. Це повідомлення про файли cookie може надати лише обмежену інформацію щодо файлів cookie третіх сторін. Для отримання інформації про файли cookie, що їх використовують треті сторони, та їх функції, читайте відповідне повідомлення про файли cookie цих третіх сторін. Тим не менш, у цьому повідомленні про файли cookie ми надаємо загальний опис файлів cookie, які можуть бути збережені на вашому Smart TV, та як вам керувати ними.\n\n1.	Що таке файли cookie?\n\nФайли cookie — це маленькі текстові файли, що можуть записуватись на ваш Smart TV. Коли ви здійснюєте доступ до веб-сайту або сервісу червоної кнопки телестанції, цей веб-сайт або сервіс може зберігати файл cookie на Smart TV. Упродовж наступних доступів файл cookie, щоб був встановлений на ваш Smart TV, надсилатиме інформацію стороні, що встановила цей файл cookie. Файли cookie дуже поширені та використовуються багатьма веб-сайтами і сервісами. Кожен файл cookie здебільшого містить ім'я домену, з якого цей файл надійшов, «термін дії» цього cookie та величину (зазвичай унікальний номер). Детальнішу інформацію про те, що таке файли cookie, і як вони працюють, можна знайти на www.allaboutcookies.org.\n\nФайли cookie поділяються на функціональні cookie та нефункціональні cookie. Функціональні cookie є такими, що є обов'язковими для надання вам сервісів. Нефункціональні cookie — це всі інші файли cookie.\n\n2.	Веб-сайти третіх сторін\n\nКоли ви відвідуєте веб-сайти або сервіси третіх сторін за допомогою Сервісів вашого Smart TV, такі веб-сайти або сервіси можуть зберігати на вашому Smart TV файли cookie, та можуть відстежувати і зберігати ваші дії під час використання цих веб-сайтів. Ми не замовляємо та не заохочуємо такі дії і не використовуватимемо таку інформацію. Докладніше про використання файлів cookie такими сторонами читайте в повідомленнях про файли cookie та конфіденційність цих веб-сайтів і сервісів.\n\n3.	Видалення файлів cookie\n\nІнтерфейс користувача вашого Smart TV дозволяє видаляти з вашого Smart TV усі файли cookie та інший локальний збережений вміст браузера. Дуже рекомендуємо видалити усі файли cookie та локально збережені налаштування перед продажем або утилізацією вашого Smart TV.\n\nВерсія: 2.0"];
var privacyPolicy = ["Встановіть нижче прапорець або прапорці , якщо хочете користуватися сервісами нашого Smart TV та пов'язаними сервісами. Для використання цих сервісів потрібна обробка ваших особистих даних, про що детально написано в повідомленні про конфіденційність: http://www.tcl.eu/en/","Увімкнути сервіс Smart TV, зберігання налаштувань сервісів та автоматичну аутентифікацію Smart TV. Якщо забрати цей прапорець, ви будете мати лише стандартний телевізор та HDMI.","Увімкнути автоматичне оновлення ПЗ. Встановіть цей прапорець, щоб встановлювати останні оновлення програмного забезпечення і, тим самим, забезпечувати найкращу роботу вашого виробу.","(Оновлення програмного забезпечення є важливими для належного функціонування вашого телевізора, оскільки вони надають нові функції і забезпечують надійну та безпечну роботу. Отже, ми рекомендуємо встановити цей прапорець.)","Встановіть нижче прапорець, якщо ви також погоджуєтесь з обробкою нами ваших особистих даних для наведених нижче цілей. Докладніше про обробку нами ваших особистих даних читайте в повідомленні про конфіденційність: http://www.tcl.eu/en/","Я погоджуюсь з обробкою моїх особистих даних (напр., час входу та виходу з T-Launcher) з метою покращення виробів TCL та надання більш якісного контенту та сервісів."];
var termsFirTitle = ["Умови користування","Заява щодо конфіденційності","Заява щодо Cookie"];
var termsSecTitle = ["Прочитайте положення та умови і погодьтесь.","Прочитайте та прийміть заяву щодо конфіденційності.","Прочитайте та прийміть заяву щодо cookie."];
var tickall = "Встановити всі прапорці";
var tickremindWords = "Встановіть прапорці, щоб скористатися сервісами Smart TV.";