var  all_country  = ["أستراليا","النمسا","بلجيكا","بلغاريا","كرواتيا","الجمهورية التشيكية","الدنمارك","فنلندا","فرنسا","ألمانيا","اليونان","المجر","إيطاليا","لوكسمبورغ","هولندا","النرويج","بولندا","البرتغال","رومانيا","روسيا","صربيا","سلوفينيا","إسبانيا","السويد","سويسرا","المملكة المتحدة","نيوزيلندا"," "/*Arab*/,"إستونيا"," "/*Hebrew*/,"لاتفيا","سلوفاكيا","تركيا","أيرلندا","اليابان","الفلبين","تايلاند","المالديف","أوروغواي","بيرو","الأرجنتين","تشيلي","فنزويلا","الإكوادور","كوستاريكا","باراغواي","بوليفيا","بليز","نيكاراغوا","غواتيمالا",  /*5*/ "الصين","تايوان","البرازيل","كندا","المكسيك","الولايات المتحدة","كوريا الجنوبية","أخرى","فييتنام"/*新添加的，底层结构体中没有*/,"أوكرانيا"/*新添加的，底层结构体中没有*/,"إيران","العراق"," ","كازاخستان","أوزباكستان"," ","قرغيزستان","الجزائر","مصر","تونس","تنزانيا","كينيا","باكستان","إندونيسيا","الكويت","السعودية","قطر","إسرائيل","لبنان","البحرين","أنغولا","الكونغو","الهند","تركمانستان","كولومبيا","منغوليا","بنجلاديش","نيبال","سيريلانكا","كوريا الشمالية","مولدافا","بولينيزيا","السلفادور"," ","فيجي","ليبريا","الأردن","ميانمار","غانا","جورجيا", /*10*/ "أرمينيا","عمان","اليمن","سوريا","فلسطين","أفغانستان","المغرب","بنين","ساحل العاج","نيجيريا","السودان","إثيوبيا","زامبيا"," ","جنوب أفريقيا","موزمبيق","ليبيا","ألبانيا","بيلاروسيا","أيسلندا","ليتوانيا","موريشيوس","دبي","الإمارات العربية المتحدة","طاجيكستان","البنغال","البوسنة والهرسك","قبرص","كوسوفو","مقدونيا","مالطا","الجبل الأسود","Cameroon","سنغافورة","ماليزيا","كاليدونيا الجديدة","Suriname","Jamaica","Curacao","Aruba","Antigua & Barbuda","St Lucia","Barbados","St Vincent","St Kitts & Nevis","Grenada","Trinidad & Tobago","Guyana","Puerto Rico","بانما", /*15*/ "Dominica","Cuba","Honduras","Haiti","Cambodia","أخرى","Dominican Republic","Bonaire","Somalia","أذربيجان",
    "Uganda","Rwanda","Guinea","Burundi","أبخازيا","Andorra","Anguilla","Antarctica","American Samoa","Aland Island",
    "Burkina-faso","Bermuda","Brunei","Caribbean Netherlands","Saint Barthélemy","Bahamas","Bhutan","Bouvet Island","Botswana","Cocos (Keeling) Islands",
    "Central African Republic","Cape Verde","Djibouti","Eritrea","Western Sahara","Falkland Islands","Federated States of Micronesia","Faroe Islands","Gabon","Cook Islands",
    "Gibraltar","Greenland","French Guiana","Guadeloupe","Equatorial Guinea","Guam","Guinea-Bissau","Heard Island and McDonald Islands","Isle of Man","British Indian Ocean Territory",
    /*20*/"Jersey","Kiribati","Comoros","Cayman Islands","Liechtenstein","Lesotho","Monaco","Saint Barthélemy","Madagascar","Mali",
    "Macao","Martinique","Mauritania","Montserrat","Malawi","Namibia","Niger","Norfolk Island","Nauru","Papua New Guinea",
    "Pitcairn Islands","Palau","Reunion Island","Solomon Islands","Seychelles","The Svalbard archipelago","Sierra Leone","San Marino","Senegal","South Sudan",
    "Sao Tome & Principe","Swaziland","Turks & Caicos Islands","Togo","Chad","Tokelau","Timor-Leste (East Timor)","Tonga","Tuvalu","Vatican City State",
    "British Virgin Islands","United States Virgin Islands","Wallis and Futuna","Samoa","Mayotte","Democratic Republic of the Congo","Guernsey","Gambia","Northern Mariana Islands","French Southern Territories",
    /*25*/"Niue","United States Minor Outlying Islands","Others"];
var all_language = ["التشيكية","Chamic","الدانمركية","Dargwa","Landdayak","الألمانية","الإنجليزية","أسباني","اليونانية","الفرنسية","الكرواتية","Sorbianupper","الإيطالية","المجرية","الهولندية","النرويجية","البولندية","البرتغالية","الروسية","الرومانية","السلوفينية","الصربية","الفنلندية","السويدية","البلغارية","السلوفاكية","الصينية","Chuukese","الغيلية","Gbaya","الويلزية","العربية","الأيرلندية","اللاتفية","العبرية","التركية","الإستونية","الهولندية"/*Netherlands*/,"الكورية","Kosraean","الهندية","Hittite","Hmong","اللغة الصينية الشمالية","الكانتونية","الماورية","الصوت الأصلي"/*Qaa*/,"غير محدد"/*Undetermined*/,"Ad","غير معروف","غير محدد","Abkhazian","Achinese","Acoli","Adangme","Adyghe","Afar","Afrihili","Afrikaans","Afro","Ainu","Akan","Akkadian","الألبانية","Aleut","Algonquian","Altaisouthern","Altaic","Amharic","Apache","Aramaic","Aragonese","Arapaho","Araucanian","Arawak","Armenian","Artificial","Assamese","Asturian","Athapascan","Austronesian","Australian","Avaric","Avestan","Awadhi","Aymara","أذربيجان","Aztec","Balinese","Baltic","Baluchi","Bambara","Bamileke","Banda","Bantu","Basa","Bashkir","الباسكية","Beja","Bemba",/*10*/"Bengali","Berber","Bhojpuri","Bihari","Bikol","Bini","Bislama","البوسنية","Braj","Breton","Buginese","Buriat","Burmese","Blin","البيلوروسية","Caddo","Carib","الكاتالانية","Caucasian","Cebuano","Celtic","Centralamericanindian","Chagatai","Chamorro","Chechen","Cherokee","Cheyenne","Chibcha","Chinookjargon","Choctaw","Chipewyan","Churchslavic","Chuvash","Coptic","Cornish","Corsican","Cree","Creek","Creolesandpidgins","Crimeantatar","Creolesandpidginsenglish","Creolesandpidginsfrench","Creolesandpidginsportuguese","Kashubian","Cushitic","Dakota","Delaware","Slavey","Dogrib","Dhivehi","Dinka","Divehi","Dogri","Dravidian","Sorbianlower","Duala","Dutchmiddle","Dyula","Dzongkha","Efik","Egyptian","Ekajuk","Elamite","Englishmiddle","Englishold","Angika","Eskimo","Esperanto","Ewe","Ewondo","Fang","Fanti","الفاروية","Fijian","Filipino","Finnougrian","Fon","Frenchmiddle","Frenchold","Frisiannorthern","Frisianeastern","الفريزية","Fulah","Friulian","Ga","الجاليكية","Ganda","Gayo","Geez","Georgian","Germanmiddlehigh","Germanoldhigh","Gorontalo","Germanic","Gilbertese","Gondi","Gothic","Grebo","Greekancient","Greenlandic",/*20*/"Guarani","Swissgerman","Gujarati","Gwichin","Haida","Haitiancreole","Hausa","Hawaiian","Herero","Hiligaynon","Himachali","Hirimotu","Hupa","Iban","الأيسلندية","Ido","Nuosu","Igbo","Ijo","Iloko","Indic","Indoeuropean","Ingush","الإندونيسية","Interlingua","Interlingue","Inuktitut","Inupiak","Iranian","Irishold","Irishmiddle","Iroquoian","اليابانية","Javanese","Lojban","Judeoarabic","Judeopersian","Kabyle","Kachin","Kamba","Kannada","Kanuri","Karakalpak","Karen","Kashmiri","Kawi","Kazakh","Circassian","Khasi","Khmer","Khoisan","Khotanese","Kikuyu","Kinyarwanda","Kirghiz","Kimbundu","Komi","Kongo","Konkani","Kpelle","Karachaybalkar","Karelian","Kru","Kuanyama","Kumyk","Kurdish","Kurukh","Kusaie","Kutenai","Ladino","Lahnda","Lamba","Langue","Lao","Latin","Luxembourgish","Lezghian","Limburgish","Lingala","الليتوانية","Lozi","Lubalulua","Lubakatanga","Luiseno","Lunda","Luo","Lushai","المقدونية","Madurese","Magahi","Maithili","Makasar","Malagasy","الماليزية","Moksha","Mandar","Malayalam","Maltese","Manchu","Mandingo",/*30*/"Manipuri","Manobo","Manx","Marathi","Mari","Marshall","Mirandese","Marwari","Masai","Mayan","Erzya","Mende","Micmac","Minangkabau","Miscellaneous","Mohawk","Moldavian","Monkmer","Mongo","المنغولية","Mossi","Multiple","Munda","Neapolitan","Nauru","Navajo","Ndebelenorth","Ndebelesouth","Ndongo","Germanlow","النيبالية","Newari","Nias","Nigerkordofanian","Nilosaharan","Niuean","Norwegianbokmal","Nogai","Norseold","Northamericanindian","Norwegiannynorsk","Nubian","Nyamwezi","Newariclassical","Nyanja","Nyankole","Nyoro","Nzema","Ojibwa","Oriya","Oromo","Osage","Ossetic","Otomian","Pahlavi","Palauan","Pali","Pampanga","Pangasinan","Panjabi","Papiamento","Papuanaustralian","الفارسية","Persianold","Phoenician","Philippine","Ponape","Prakrit","Provencalold","Pushto","Quechua","Rhaetoromance","Rajasthani","Rapanui","Rarotongan","رومانسي","Romany","Rundi","Aromanian","Salishan","Samaritanaramaic","Samisouthern","Saminorthern","سامي","Lulesami","Inarisami","Samoan","Skoltsami","Sandawe","Sango","Sanskrit","Sardinian","Sasak","Santali","Sicilian","Scots","Selkup","Semitic","Sranantongo","Serbocroatian",/*40*/"Serer","Sign","Shan","Shona","Sidamo","Siksika","Sindhi","Soninke","Singhalese","Sinotibetan","Siouan","Slavic","Siswant","Sogdian","Somali","Songhai","Sorbian","Walloon","Nko","Sothonorthern","Sothosouthern","Southamericanindian","Sukuma","Sumerian","Sudanese","Susu","Swahili","Swazi","Swize","Syriacclassical","Syriac","Tagalog","Tahitian","Tetum","Tajik","Tamashek","Tai","Tamil","Tatar","تليتكست","Telugu","Tereno","التايلاندية","Tibetan","Tigre","Tigrinya","Timne","Tivi","Klingon","Tokelau","Tlingit","Tonganyasa","Tongaislands","Truk","Tokpisin","Tsimshian","Tsonga","Tswana","Tumbuka","Tupian","Turkishottoman","Turkmen","Tuvinian","Tuvalu","Twi","Udmurt","Ugaritic","Uighur","الأوكرانية","Umbundu","Urdu","أوزباكستانية","Vai","Venda","الفيتنامية","Volapuk","Votic","Wakashan","Walamo","Waray","Washo","Wolof","Kalmyk","Xhosa","Yakut","Yao","Yap","Yiddish","Yoruba","Yupik","Zapotec","Blissymbolics","Zenaga","Zhuang","Zande","Zulu","Zuni","Zazaki","Valencian","تقاليد صينية",/*50*/"ChineseS","QAB","QAC","العربية مصر","*","*","Dagbani","Kasem","*"];
var offOn = ["إيقاف","تشغيل"];	
var okCancel = ["موافق","إلغاء"];	
var yesNo = ["نعم","لا"];	
var level = ["إيقاف","منخفض","مرتفع","متوسط"];	
var manualAuto = ["يدوي","تلقائي"];	
var homeShop = ["المنزل","متجر"];
var picPreset = ["قياسي","سطوع","طبيعي","فيلم","شخصى"];
var picColorTemp = ["بارد","طبيعي","دافئ","مخصص"];
var pic3dNavig = ["يدوي","تلقائي","شبه تلقائي"];	
var _3dOptions = ["الوضع ثلاثي الأبعاد","ثلاثي الأبعاد-إلى-ثنائي الأبعاد","التبديل بين اليسار واليمين","عمق الحقل"];	
var pic3DMode = ["إيقاف","ثنائي الأبعاد إلى ثلاثي الأبعاد","جنبًا إلى جنب","أعلى-و-أسفل","تداخل الخطوط"];	
var picEcoOptions = ["توفير الطاقة","مستشعر الضوء","تعتيم محلي","تعتيم مختلط"];	
var picGeoOptions = ["اعدادات PC","وضع أفقي","وضع رأسي","الساعة","مظهر"];	
var picAdWhiteBal = ["اكتساب اللون R","اكتساب اللون G","اكتساب اللون B","توازن R","توازن G","توازن B"];	
var souOptions = ["وضع الصوت","اتزان","تأخير الصوت","SRS TSHD","تحكم تلقائي في مستوى الصوت","نوع SPDIF","تأخير SPDIF","موضع التلفزيون","لغة الصوت","نوع الصوت","وصف صوتي","تحسين الصوت","Dolby Digital Plus","صوت محيطي"];	
var souSpdifType = ["تلقائي"/*Dolby*/,"PCM","إيقاف"];	
var colorSpace = ["تلقائي","أصلي","يدوي"];	
var souPresetPara = ["100Hz","500Hz","1.5KHz","5KHz","10KHz"];	
var chOptions = ["البحث عن قناة","قائمة القنوات","EPG","منظم القناة","تشخيصات القناة","التسجيل للعرض في وقتٍ آخر","الترجمة","تليتكست","نوع قائمة القنوات","خدمة البيانات","PVR"];	
var chDiagOptions = ["قوة الإشارة","جودة الإشارة","التردد (كيلو هرتز)","معرّف الخدمة","معرّف الشبكة","اسم الشبكة"];	
var chScanOptions = ["البلد/المنطقة","نوع البحث","بحث تلقائي","تحديث تلقائي","بحث يدوي تماثلي",["التثبيت اليدوي للكابل","بحث يدويDTV","توليف يدوي للقمر الصناعي"],"إعداد هوائي القمر الصناعي","تحديد الشبكة المفضلة","حذف قائمة القنوات","LCN"];
var favNetDes = "يرجى تحديد الشبكة المفضلة";	
var tuner = ["الكابل","الهوائي","قمر صناعي"];	
var passError = "كلمة المرور غير صحيحة.‎\nبرجاء إدخالها مرة أخرى!";	
var chType = [": ATV قنوات",": DTV قنوات"];	
var chScanStatus = ["الحالة: جارٍ المسح","الحالة: تم البحث","الحالة: تم إلغاء البحث","الحالة: خطأ في البحث"];	
var chScanPara = ["التردد (كيلو هرتز)","التعديل","معدل الرموز (رمز/ثانية)","معرّف الشبكة","النظام","بحث دقيق","قوة الإشارة","جودة الإشارة","وضع البحث","معرف القناة"];	
var chScanParaMHZ = ["التردد (ميجا هرتز)"];	
var chAtvManSys = ["أوروبا الغربية","أوروبا الشرقية","المملكة المتحدة","فرنسا"];	
var modulation = ["16QAM","32QAM","64QAM","128QAM","256QAM","تلقائي"];	
var chCleanDes = "هل تريد مسح قائمة القنوات؟";	
var chDeletDes = "هل تريد حذف القناة؟";	
var chOperator = ["Ziggo","UPC","أخرى"];	
var chScanType = ["DTV & ATV","DTV","ATV"];	
var chScanMode = ["مكتمل","متقدم","سريع"];	
var bookingModes = ["تسجيل","تذكير"];	
var dayName = ["الأحد","الاثنين","الثلاثاء","الأربعاء","الخميس","الجمعة","السبت"];	
var monthName = ["يناير", "فبراير","مارس","أبريل","مايو","يونيو","يوليو","أغسطس","سبتمبر","أكتوبر","نوفمبر","ديسمبر"];	
var filter = ["فرز","النوع","نوع فرعي"];	
var chEpgFirstGenre = ["فيلم","اخبارى","عرض","الرياضة","الأطفال","موسيقى","الفنون","اجتماعي","تعليم","الترفيه","خاص"];	
var chEpgSecondGenre = [["دراما","كاشف","مغامرة","خيال علمي","كوميديا","مسلسلات تلفزيونية","رومانسي","تقليدي","أفلام البالغين"," "," "," "],["الشؤون الجارية","النشرة الجوية","مجلات الأخبار","وثائقيات","مناقشات"," "," "," "," "," "," "," "],["عرض","عرض الألعاب","عرض متنوع","برنامج حواري"," "," "," "," "," "," "," "," "],["الرياضة","أحداث خاصة","مجلات رياضية","كرة القدم","التنس","الألعاب الجماعية","ألعاب القوى","رياضة السيارات","الرياضات المائية","الرياضات الشتوية","الفروسية","الرياضات القتالية"],["الأطفال","الأطفال ما قبل سن المدرسة","الترفيه من سن 6 إلى 14","الترفيه من سن 10 إلى 16","إعلامي","رسوم متحركة"," "," "," "," "," "," "," "],["موسيقى","روك","تقليدي","شعبي","جاز","موسيقي","باليه"," "," "," "," "," "],["الفنون","أداء الفنون","الفنون الجميلة","دين","ثقافة شعبية","أدب","فيلم","تجريبي","بث","وسائط جديدة","مجلات الآداب","الأزياء"],["اجتماعي","مجلات","اقتصاد","شخصيات استثنائية"," "," "," "," "," "," "," "," "],["تعليم","طبيعة","تكنولوجيا","طب","بلدان أجنبية","علوم اجتماعية","تعليم تكميلي","اللغات"," "," "," "," "],["هوايات وقت الفراغ","سياحة","صناعات يدوية","رياضة السيارات","صحة ولياقة","طهي","دعاية","بساتين"," "," "," "," "],["اللغة الأصلية","أسود وأبيض","غير منشور","بث حي"," "," "," "," "," "," "," "," "]];	
var chEpgFirstGenreLA = ["اخبارى","الرياضة","تربوي","مسلسلات طويلة","مسلسلات قصيرة","مسلسلات","عرض متنوع","عرض حي","المعلومات","هزلي","أطفال","جنسي","فيلم","يانصيب، مبيعات التلفاز، التسعير","مناقشة/مقابلة","أخرى"];	
var chEpgSecondGenreLA = [["اخبارى","تقرير","وثائقيات","سيرة ذاتية","أخرى","",""],    ["الرياضة","أخرى","","","","",""],["تربوي","أخرى","","","","",""],["مسلسلات طويلة","أخرى","","","","",""],["مسلسلات قصيرة","أخرى","","","","",""],["مسلسلات","أخرى","","","","",""],["قاعة احتفالات","عرض","موسيقي","مصنوع من","نسائي","عرض الألعاب","أخرى"],["عرض حي","أخرى","","","","",""],["طهي","الأزياء","البلد","صحة","سفر","أخرى",""],["هزلي","أخرى","","","","",""],["أطفال","أخرى","","","","",""],["جنسي","أخرى","","","","",""],["فيلم","أخرى","","","","",""],["يانصيب","مبيعات التلفاز","التسعير","أخرى","","",""],["مناقشات","مقابلة","أخرى","","","",""],["كرتون للكبار","تفاعلي","السياسة","دين","خدمات هندسية","أخرى",""]];	
var chOrganizer = ["تخطي القناة","فرز القناة","تعديل القناة","حذف القناة","تبديل قناة","إدراج قناة"];	
var chEditPara = ["اسم الشبكة","رقم القناة","اسم القناة:","التردد","نظام الألوان","نظام الصوت"];	
var chSatTitles = ["نوع القمر الصناعي","إعداد هوائي القمر الصناعي","تحديد قمر صناعي"];	
var chSatEidtOptions = ["اسم القمر الصناعي","الوضع","طاقة LNB","تردد LNB (ميجاهرتز)","إدخال الدايزك","نغمة 22 كيلوهرتز","تتابع النغمة","التردد (كيلو هرتز)","معدل الرموز (رمز/ثانية)","الاستقطاب","قوة الإشارة","جودة الإشارة","حالة القمر الصناعي"];	
var chSatAutoPromt = [["الكل","الشبكة"],["الكل","مجاني"]];	
var chSatAutoScanOptions = ["تحديد قمر صناعي","وضع البحث","القنوات"];	
var chSatPosition = ["A","B"];	
var chSatLNBFreq = ["عالمي",];	
var chSatDiSEqCInput = ["تعطيل","A","B","C","D"];	
var chSatTone22KHz = ["تلقائي","تشغيل","إيقاف"];	
var chSatToneBurst = ["تعطيل","تتابع النغمة A","تتابع النغمة B"];	
var chSatPolarization = ["أفقي","عمودي"];	
var chSatSetupOptions = ["نوع الهوائي","موالف","تردد النطاق"];	
var chSatAntennaType = ["كابل واحد","عالمي"];	
var chSatUserBands = ["نطاق المستخدم 1","نطاق المستخدم 2","نطاق المستخدم 3","نطاق المستخدم 4","نطاق المستخدم 5","نطاق المستخدم 6","نطاق المستخدم 7","نطاق المستخدم 8"];	
var chSatOthers = ["جهاز إرسال/استقبال"];	
var chSatSetupOthers = ["تعريف المستخدم"];	
var pleaseSelectSat = "يرجى تحديد الأقمار الصناعية أولاً!";	
var subOptions = ["الترجمة","لغة الترجمة الرقمية","لغة الترجمة الرقمية الثانية","نوع الترجمة"];	
var gingaOptions = ["خدمة بيانات تلقائية","قائمة خدمة البيانات"];	
var ttxOptionsCon = ["لغة صفحة فك الترميز","لغة نصوص المعلومات الرقمية"];	
var subType = ["طبيعي","ضعاف السمع"];	
var netIntf = ["شبكة الايثرنت","اللاسلكي"];	
var netConnDes = ["يقوم التلفزيون باختبار اتصال الشبكة.‎\nيرجى الانتظار","نجح اختيار الاتصال بالشبكة!","فشل اختيار الاتصال بالشبكة!"];	
var netSsidError = "طول SSID الصالح هو 1~32 حرفًا. يرجى التحقق من SSID.";	
var netOthers = ["الرقم السري"];	
var netWlessAutoDes = ["يرجى التأكد من تثبيت رمز PIN التالي في نقطة الوصول قبل النقر فوق \"موافق\".","يرجى الضغط على الزر الموجود على نقطة الوصول في غضون 120 ثانية قبل النقر على \"موافق\"."];	
var netConnRemind = ["كلمة المرور غير صحيحة!","اتصال. يرجى الانتظار!","نجح الاتصال وتم الحصول على عنوان IP!","فشل الاتصال، يرجى التحقق من الشبكة والمحاولة مرة أخرى!","يبحث التلفاز عن نقاط الوصول. ‎\nيرجى الانتظار","لا يوجد محول لاسلكي متصل بالتلفاز!"];	
var netWireIpOptions = ["إعدادات IP","نوع العنوان","عنوان IP","قناع الشبكة الفرعية","بوابة افتراضية","DNS أساسي","DNS ثانوي"];	
var netWireConnRemind = ["يرجى إدخال قيمة بين 0 و255.","تم الاتصال بنجاح!","يرجى كتابة عنوان صالح","تم الاتصال بنجاح!","فشل الاتصال!","اتصال. يرجى الانتظار!","يرجى إدخال قيمة بين 1 و223."];	
var netFlixOptions = ["إلغاء التنشيط","ESN","Netflix Version"];	
var netFlixDes = ["هل ترغب بالتأكيد في إلغاء التنشيط؟"," "/*Are you sure that you want to ESN?*/];	
var netUpdateTitle = "تحديث البرنامج";	
var netUpdateDialogTitle = "تحديث البرامج";	
var netBGDownloadTitle = "جارى التنزيل";	
var netUpdateLoadingPrompt = ["جاري البحث عن ترقية، يرجى الانتظار!","جاري تنزيل البرنامج... يرجى الانتظار!","يرجى عدم إيقاف تشغيل التلفاز أثناء تحديث البرنامج!",                            "يتم تنزيل تحديث البرنامج الإلزامي تلقائيًا في الخلفية!"];	
var netUpdatePrompt = ["تهانينا، لديك أحدث إصدار من البرنامج!","تم العثور على إصدار البرنامج الجديد XXXX. هل تريد التنزيل الآن؟ قد يستغرق ذلك بعض الوقت وفقًا لحالة شبكتك.","فشل تسجيل الدخول، يرجى التحقق والمحاولة مرة أخرى!","فشل استقبال البيانات، يرجى إعادة المحاولة لاحقًا!","فشل تحليل معلومات الترقية، قم بإيقاف التشغيل/التشغيل باستخدام وحدة التحكم عن بُعد!","فشل الاتصال، يرجى التحقق من الشبكة والمحاولة مرة أخرى!","تم تنزيل البرنامج بنجاح. هل ترغب في بدء تحديث تلفازك؟","تم فقد البيانات! فشل التنزيل!","فشلت عملية التحقق من ملف البرنامج، يرجى المحاولة مرة أخرى!","مشكلات الاتصال. يرجى التحقق والاتصال مرة أخرى!","فشل التحديث. يرجى إيقاف التشغيل/التشغيل باستخدام وحدة التحكم عن بُعد!","تم حذف ملف الترقية عن طريق الخطأ. يرجى إجراء الترقية باستخدام الشبكة مرة أخرى.","تم تنزيل البرنامج بنجاح في الخلفية. هل ترغب في إجراء الترقية؟"];	
var netUpdateButtonText = ["تنزيل", "تحديث", "لاحقًا", "مطلقًا", "موافق","استمرار"];	
var autoDetectPrompt = ["تم العثور على إصدار البرنامج الجديد XXXX. هل تريد التنزيل الآن؟ قد يستغرق ذلك بعض الوقت وفقًا لحالة شبكتك.","تم العثور على إصدار البرنامج الجديد XXXX. هل ترغب في التحديث الآن؟","تم إنهاء عملية الترقية باستخدام الشبكة في المرة الأخيرة. يتوجب عليك إجراء الترقية مرة أخرى.",                        "لم يتم الانتهاء من تنزيل إصدار البرنامج الجديد XXXX. هل ترغب في المتابعة الآن؟",                        "تم تنزيل البرنامج، هل ترغب في التحديث الآن؟","Software downloaded, do you want to update now? TV will update automatically next time if you skip now."];	
var sysOptions = ["الدليل الإلكتروني","لغة القائمة","المؤقت","قفل","إعدادات الإدخال","تحديث البرنامج","الموقع","وضع HbbTV","ملفات تعريف الارتباط","واجهة عامة","إعدادات متقدمة","إعادة ظبط المصنع","مؤشر LED","تشغيل فوري","الوضع التلقائى للمتجر","Area","وضع العرض التجريبي"];
var sysResetDes = "هل تريد بالتأكيد القيام بالإجراء المحدد؟";	
var sysMenuLangOptions = ["اللغة","لغة الصوت المفضلة","لغة الصوت المفضلة الثانية"];	
var sysTimerOptions = ["المنطقة الزمنية","اسم المنطقة","الساعة","مؤقت النوم","استعداد تلقائي", "منطقة البلد","Hijri"];	
var sysTimeZone = ["حسب البث","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00","GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30","GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00","GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00","GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00","GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00","GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];	
var sysTimeZoneLA = ["كمذيع","المنطقة 1","المنطقة 2","المنطقة 3","المنطقة 4","المنطقة 5"];	
var sysTimeZoneNA = ["نيوفاوندلاند","المحيط الأطلسي","شرقي","مركزي","جبل","المحيط الهادئ","ألاسكا","هاواي","ساموا"];	
var sysSleepTimer = ["إيقاف","10 دقائق","20 دقائق","30 دقائق","40 دقائق","50 دقائق","60 دقائق","90 دقائق","120 دقائق"];	
var sysStandby = ["إيقاف","4 ساعات","6 ساعات","8 ساعات"];	
var sysRegionName = ["مدريد","جزر الكناري"];	
var sysClockOptions = ["تزامن تلقائي","التاريخ","الوقت","مؤقت التشغيل","المؤقت","تشغيل القناة","مؤقت إيقاف التشغيل","المؤقت","التوقيت الصيفي"];	
var sysTimer = ["إيقاف","يومياً","مرة واحدة"];	
var sysInputSet = ["لا توجد تسمية","DVD","Blu-ray","HDD","DVDR","تسجيل عالي الدقة","ألعاب","مسجل فيديو","PC","‏STB رقمي","‏STB رقمي عالي الجودة","كاميرا","المسجّل","أخرى"];	
var sysAvVideoInput = ["تلقائي","RGB_CVBS","RGB","CVBS","S-Video"];	
var sysUpdate = ["من خلال USB","من خلال الشبكة","حسب القناة"];	
var sysUpdateDes = [" "," "," ","يتعذر العثور علي قنوات جديدة في البث!","تم العثور على إصدار البرنامج الجديد XXXX. هل ترغب في التحديث الآن؟","يرجى إدخال وحدة USB.","فشلت عملية التحقق من ملف البرنامج، يرجى المحاولة مرة أخرى!","جار التحديث. سيستغرق ذلك بعض الوقت ليكتمل، ومن ثم سيتم إعادة تشغيل التلفاز تلقائيًا!","تم تحديث البرنامج بنجاح.‎\nسيتم بعد ذلك إعادة تشغيل التلفاز تلقائيًا!","تم العثور على إصدار البرنامج الجديد XXXX. هل تريد التنزيل الآن؟ قد يستغرق ذلك بعض الوقت وفقًا لحالة شبكتك.","جارى التنزيل","تم تنزيل البرنامج بنجاح. هل ترغب في بدء تحديث تلفازك؟","فشل التحديث!","جاري البحث عن ملفات الترقية","تم تحديث البرنامج بنجاح.‎\nيرجى إعادة تشغيل التلفاز الآن."];	
var sysProductInfo = ["الإصدار الحالي","اسم المنتج","اسم الشركة المصنعة","اسم الهيكل"];	
var sysCiDes = ["لم يتم العثور على بطاقة CI."];	
var sysAdOptions = ["تسجيل (DivX(R","إلغاء تسجيل (DivX(R","T-Link","خطأ في التخويل","تأكيد إلغاء التسجيل","تأكيد الإيجار","انتهت صلاحية التأجير"];	
var sysRegistDes = ["يتعين عليك تسجيل جهازك لتشغيل مقاطع فيديو محمية بـ DivX(R)‎.","رمز التسجيل:","يمكنك التسجيل على الموقع http://vod.divx.com"];	
var sysDregistDes = ["رمز إلغاء التسجيل:","يمكنك إلغاء التسجيل على الموقع http://vod.divx.com","هل تريد متابعة التسجيل؟"];	
var mediaAuthorization = ["جهازك غير مخوّل بتشغيل هذا الفيديو المحمي بتنسيق DivX(R)‎."];	
var deregistrationConfrimation = ["جهازك مسجّل من قبل.","هل ترغب بالتأكيد في إلغاء التسجيل؟"];	
var rentalConfirmation = "استخدم إيجار DivX(R) XXXX من YYYY المشاهدات. هل ترغب في المتابعة؟";	
var rentalExpired = "استخدم إيجار DivX(R) XXXX من YYYY المشاهدات. انتهت صلاحية إيجار DivX.";	
var parentalRatingLA = ["تصنيف أبوي","تصنيف العمر","تقييم المحتوى"];	
var parentalRatingNA = ["تصنيف أبوي","حظر تصنيف غير المصنف","تصنيف العمر","تقييم المحتوى","الولايات المتحدة","كندا","إعدادات RRT","إعادة ضبط RRT"];	
var parentalRatingOptionUS = ["الولايات المتحدة","تقييم التلفاز","MPAA"];	
var sysTVRatingUS = ["TV-Y","TV-Y7","TV-PG","TV-14","TV-MA"];	
var sysMPAAUS = ["G","PG","PG-13","R","NC-17","X"];	
var parentalRatingOptionCanada = ["كندا","Canada Eng","Canada Fre"];	
var sysCanadaEng = ["C","C8+","G","PG","14+","18+"];	
var sysCanadaFre = ["G","8+","13+","16+","18+",""];	
var sysResetRRT = ["هل ترغب بالتأكيد في إعادة ضبط RRT؟"];	
var ageRatingOptions = ["L","10","12","14","16","18"];	
var contentRatingOptions = ["إيقاف","عقاقير","عنف","جنس","عنف وعقاقير","جنس وعقاقير","عنف وجنس","عنف وجنس وعقاقير"];	
var sysLockOptions = ["قفل قناة","قفل الفاصل الزمني","تصنيف أبوي","قفل الإدخال","قفل اللوحة الأمامية","قفل التثبيت","تغيير كلمة المرور","الحد الأقصى لمستوى الصوت","تنظيف الكل"];	
var sysTimeIntervals = ["نوع القفل","وقت البدء","وقت الانتهاء"];	
var sysRatingOptions = ["لا يوجد","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","مصنّف X (إسبانيا)"];	
var changePass = ["تغيير كلمة المرور","كلمة مرور جديدة","تأكيد كلمة المرور"];	
var changePassDes = ["كلمة المرور غير صحيحة.‎\nبرجاء إدخالها مرة أخرى!","كلمة المرور غير مطابقة.‎\nبرجاء إدخالها مرة أخرى!","تم تعيين كلمة المرور بنجاح!","هذا الرمز بسيط للغاية لا يمكن استخدامه ككلمة مرور.‎\nيرجى إدخال الرمز مرة أخرى!"];	
var sysPowerOnChOptions = "حدد الوضع";	
var sysPowerOnCh = ["الحالة الأخيرة","تحديد المستخدم"];	
var netWlessSecu = ["فتح","شبكة الويب","WPA/WPA2-PSK"];	
var netWlessSecu2 = ["لا يوجد","شبكة الويب","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK","غير مدعوم"];	
var netWlessSecu3 = ["لا يوجد","شبكة الويب","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)","غير مدعوم"];	
var netOptions = ["اتصال إنترنت","واجهة","إعدادات اللاسلكي","إعدادات IP","المعلومات","اختبار الاتصال","DLNA","جهاز التحكم عن بُعد الخاص بالتلفزيون","إعدادات Netflix","عرض WiFi","نوع العنوان","عنوان IP","Subnet mask","Default gateway","DNS أساسي","DNS ثانوي","إسم الشبكة","BSSID","يرجى إدخال SSID:","معرّف المستخدم"];
var chEditDes = ["رقم قناة مكرر!","اضغط على المفتاح الأحمر لحذف الحرف الحالي!","أرقام قنوات غير صالحة."];	
var chEpgNoProgram = "لا توجد معلومات برنامج الآن، يرجى البحث عن قنوات أولاً!";	
var chEpgWords = ["دليل البرنامج","لا توجد بيانات للبرنامج.","تم قفل القناة!","لا توجد تفاصيل للبرنامج.","لا يوجد عنوان برنامج."];	
var chEpgBooking = ["معلوملات الجدول", "رقم القناة","تاريخ البدء","وقت البدأ","وقت الانتهاء","نوع التكرار","نوع الجدول","إضافة جدول","استبدال","تغيير","إضافة/تعديل"];	
var epgHotKey = ["اليوم السابق","اليوم التالي","فرز","قائمة الجدول","إضافة جدول"];	
var chEpgBookRemind = ["وقت البدء غير صحيح","وقت الانتهاء غير صحيح","جدول زمني مكرر","تم الحفظ بنجاح.","تم الحذف بنجاح."];	
var chSchePara = ["قائمة الجدول","وقت البدأ","تاريخ البدء","عنوان البرنامج","اسم القناة","المدة","تكرار","جدول زمني","تحرير","حذف"];	
var dateTimer = ["مرة واحدة","يومياً","أسبوعيًا"];	
var scheduleDeleteReminds = "هل ترغب في حذف هذا الجدول الزمني؟";	
var scheduleNoLists = "لا توجد قائمة جدول. اضغط على مفتاح \"أحمر\" لإضافة واحد.";	
var chListWords = ["قائمة القنوات","تحديد قائمة","نوع البحث","إضافة إلى المفضلة","إزالة","حدد قائمة القنوات","حدد وضع البحث","تبديل"];	
var chListType = ["الكل","DTV","ATV","الراديو","مجاني","المفضلة"];	
var chAutoScanOptions = ["تحديد عامل تشغيل","نوع القناة","بحث تلقائي"];	
var souSoundType = ["غير صالح","أحادي","أحادي","إستريو","إستريو","SAP","SAP","مزدوج1","مزدوج2","مزدوج2","أحادي Nicam","ستريو Nicam","مزدوج1 Nicam","مزدوج2 Nicam","‏Nicam مزدوج","أحادي","LL","RR","LR"];	
var souPreset = ["موسيقى","فيلم","صوت","قياسي","شخصى"];
var picAdRgbMode = ["إيقاف","أحمر فقط","أخضر فقط","أزرق فقط"];	
var picAdOptions = ["خفض الضوضاء","خفض الضوضاء MPEG","وضع RGB","ضوء طبيعي","وضوح حركة LED","درجة لون البشرة","وضع الفيلم","وضع الألعاب","درجة حرارة اللون","توازن اللون الأبيض","تجميد الصورة","تمدد الأسود","مسح زائد","جاما","وضع HDMI","توازن اللون الأبيض 10 بكسل","موسع الألوان","تقليل الباهت","تقليل الاهتزاز","مساحة ألوان","وضوح الحركة"];	
var pic10Pwhite = ["الفاصل الزمني","أحمر","أخضر","أزرق","إعادة تعيين","اللون","أصفر","سماوي","أرجواني"];	
var picMotionClarity = ["وضع الحركة","تداخل الحركة","وضوح حركة LED","تقليل الباهت","تقليل الاهتزاز","إعادة تعيين"];	
var picMotionMode = ["فيلم","سلس","مسح","رياضة","العميل"];	
var picResetDes = "ستتم إعادة تعيين جميع الإعدادات. هل تريد بالتأكيد القيام بالإجراء المحدد؟";	
var pic10PReset = "هل ترغب بالتأكيد في إعادة تعيين توازن اللون الأبيض 10 بكسل؟";	
var picMotionReset = "هل ترغب في إعادة تعيين وضوح الحركة؟";	
var picColorSpaceReset = "هل ترغب بالتأكيد في إعادة تعيين مساحة الألوان؟";	
var picOptions = ["الإعداد المسبق للصورة","الإضاءة الخلفية","السطوع","التباين","تشبع اللون","تظليل","حدة","درجة حرارة اللون","حجم الصورة","تنسيق تلقائي","تعزيز الرياضة","3D","تنقل ثلاثي الأبعاد","إعدادات ECO","اعدادات PC","إعدادات متقدمة","إعادة تعيين الصورة","تعتيم","Micro Dimming"];	
var picSize = ["16:9 format", "4:3 format", "تنسيق 14:9", "Cinerama","16:9 تكبير/تصغير", "16:9 تكبير","14:9 تكبير/تصغير","تمديد التكبير","تكبير عريض","تكبير/تصغير 2","تكبير عريض 2","مطابقة أصلية للشاشة","نقطة بنقطة","الأصل","بانوراما"];	
var others = ["مستوى الصوت","بث","كلمة المرور","الحالة","حفظ","استبدال","بدء","خروج","بحث","حذف","لا يوجد","تلقائي","مسح","الأمان","اتصال","تحديث","اعد المحاولة","إيقاف","الإعدادات","القنوات","تحرير","إدراج","الإشارة","إنهاء","إستريو","صوت","المصدر","لا يوجد صوت","نصائح","إعادة تعيين","العميل","إعداد","تخزين","يدوي","إغلاق لوحة المفاتيح","وضع الأمان","كل يوم","قائمة PVR"];	
var direction = ["يسار","يمين","للأمام","للخلف"];	
var audioType = ["MPEG","DOLBY AUDIO"/*"AC3"*/,"MPEG4","AAC", "DOLBY AUDIO"/*"AC3P"*/,"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD"," "," "," "," "," "," ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2","HE-AAC_V4","غير معروف"];	
var soundChannels = ["غير معروف","أحادي","فرعي","أحادي مزدوج","إستريو","إستريو فرعي","إستريو محيطي بتقنية Dolby","محيطي 2CH","محيطي","3.0Ch","4.0Ch","5.0Ch","Lfe أحادي","Lfe أحادي مزدوج","Lfe إستريو","Lfe محيطي ذو قناتين","Lfe محيطي","3.1Ch","4.1Ch","5.1Ch","7.1Ch","إستيرو مشترك","Fmrdo أحادي","Fmrdo إستريو","Fm أحادي Nicam أحادي","Fm أحادي Nicam إستريو","Fm أحادي Nicam ثنائي","يسار","يمين","أخرى"];	
var prompts = ["اضبط إعداد الصورة الذي يلائم بيئة العرض لديك بشكل أفضل.",
                "ضبط مستويات السطوع. كلما كانت المسافة أقرب من 100 م، كانت أسطع.",
                "ضبط مستويات التباين. كلما كانت المسافة أقرب من 100 م، كانت اختلافات سطوع المناطق المظلمة في الصورة أكبر.",
                "ضبط مستويات درجة التشبع. كلما كانت المسافة أقرب من 100 م، كان اللون أغنى.",
                "ضبط مستويات الحدة. كلما كانت المسافة أقرب من 100 م، كانت التفاصيل أوضح.",
                "ضبط مستوي الاضاءة الخلفية. كلما كانت المسافة اقرب الي 100 كانت الشاشة اسطع.",
                "ضبط مستويات التظليل. يعدل هذا الإعداد درجات اللون.",
                "حدد تنسيق الصورة الذي يناسب البرنامج الذي يتم مشاهدته بشكل أفضل.",
                "تكوين خيارات توفير الطاقة.",
                "اضبط إعدادات هندسة الشاشة عند الاتصال بجهاز كمبيوتر شخصي.",
                "حدد المزيد من الإعدادات المتقدمة للصورة.",
                "إعادة تعيين جميع إعدادات الصورة إلى الإعدادات الافتراضية.",
                "حدد وضع الصوت الذي يناسب تفضيلك الشخصي.",
                "اضبط مستوى الصوت بين القناة اليسرى والقناة اليمنى.",
                "يوفر نظام استرداد الصوت بتقنية TruSurround HD أداءً صوتيًا نقيًا ودرجة وضوح ذات ترددات منخفضة وعالية.",
                "تنسيق واجهة رقمية يربط مخرج الصوت الرقمي في التلفاز بالأجهزة السمعية في المسارح المنزلية.",
                "حدد لغة الصوت التي تناسب تفضيلاتك الشخصية.",
                "تمكين ضعاف البصر من الاستمتاع بمشاهدة البرامج التلفزيونية.",
                "اختبر صورة وصوت وإشارة تلفازك.",
                "حدد نوع قائمة القنوات التي تناسب إشارة تلفازك.",
                "حدد لغة ترجمة البرنامج التي تعرض في الجزء السفلي من الشاشة.",
                "حدد البرنامج النصي والصور للقناة الحالية.",
                "Digital Living Network Alliance. استمتع بالموسيقى والصور ومقاطع الفيديو عبر الشبكة المنزلية من أجهزة أخرى، مثل جهاز الكمبيوتر الشخصي.",
                "اعرض محتوايات تليفزيونك الذكي علي التلفاز واستخدم الهاتف الذكي كوحدة تحكم عن بعد للتلفاز.",
                "اعرض المحتويات من جهاز يعمل بنظام التشغيل Android متوافق مع Miracast على شاشة تلفازك.",
                "حدد قفلً لتلفازك.",
                "حدد اسمًا لجهازك.",
                "حدد بيئة العرض التي تناسبك.",
                "استعادة جميع إعدادات النظام إلى الإعدادات الافتراضية.",
                "Switch off sports mode for more options.",
                "تحسين التباين البيئي",
                "وضع خاص للاستمتاع بالألعاب الرياضية",
                "استمتع بالمزيد من وظائف CEC."];
var initialTitle = ["مرحبا","إعدادات أولية"];
var initialPrompt = ["أدخل إعدادك الأولي الآن، وسيكون بانتظارك عالم من التجارب المثيرة!",
                    "يرجى تحديد اللغة:",
                    "يرجى تحديد البلد/المنطقة:",
                    "يرجى تحديد موقعك:",
                    "يرجى تحديد نوع اتصالك بالشبكة:",
                    "يرجى تحديد وضع اتصال الشبكة السلكية:",
                    "فشل الاتصال بـ xxxxxxxxx! يرجى توصيل الجهاز وفقًا للمخطط التالي أو اضغط على الزر الأيسر لإعادة الضبط.",
                    "متصل بـ xxxxxxxxx! يرجى الضغط على الزر الأيمن للمتابعة.",
                    "‏1) قد يتضمن تلفازك بالفعل محولاً لاسلكيًا مدمجًا‎ \n‏2) أو، إذا تم تضمين محول USB لاسلكي، فوصّله بتلفازك. ومن ثم يرجى تحديد وضع اتصال الشبكة اللاسلكية",
                    "جارى المسح . يرجى الإنتظار ...",
                    "لا يوجد محول لاسلكي متصل بالتلفاز!",
                    "يرجى التأكد من تثبيت رمز PIN التالي في نقطة الوصول قبل النقر فوق الزر \"التالي\" أدناه.",
                    "يرجى الضغط على زر الأمر الموجود على AP في غضون 120 ثانية قبل الضغط على زر الاتجاه الأيمن!",
                    "‏WPS (إعداد شبكة Wi-Fi المحمية)",
                    "‏PIN (رقم التعريف الشخصي)",
                    "‏PBC (تكوين زر الضغط)",
                    "ا يمكن الوصول إلى المحتويات التالية إلا من خلال الإتصال بالشبكة . هل ترغب فى تخطي إعداد الشبكة ؟",
                    "توجد تحديثات جديدة للبرنامج يمكنك تنزيلها، قد يستغرق هذا الأمر بعض الوقت استنادًا إلى حالة شبكتك.",
                    "يضمن لك تحديث برنامج تلفازك الاستمتاع بأحدث الميزات والخدمات.",
                    "لن تستمتع بأحدث الميزات والخدمات. هل تريد تخطي تحديث البرنامج؟",
                    "اضغط على زر الاتجاه الأيمن للمتابعة.",
                    "تجنب إيقاف تشغيل الطاقة أثناء التحديث حيث قد يؤدي هذا إلى إلحاق الضرر بالتلفاز.",
                    "إذا لم تكن ترغب في التحديث، فيرجى تحديد لا.",
                    "جارِ التحديث، يرجى الانتظار",
                    "يمكنك أيضًا تحديث البرنامج في النظام/تحديث البرنامج.",
                    "البلد التي حددتها تطلب تعيين كلمة مرور.‎\nيرجى تعيين رمز للتلفزيون الخاص بك وتأكيده.",
                    "هذا الرمز بسيط للغاية.‎\nيرجى استخدام أرقام مختلفة.",
                    "تهانينا! اكتمل الإعداد الأولي. يمكنك تعديل تكوينك من خلال القائمة الرئيسية والقوائم الفرعية ذات الصلة.",
                    "يرجى تحديد وضع الأمن:",
                    "يرجى تحديد وضع اتصال الشبكة اللاسلكية:",
                    "شبكة"];
var initNetCabAndDonRe = ["لا يوجد كابل شبكة متصل، يرجى توصيل كابل شبكة!","لا يوجد مهايئ لاسلكي أو لم يتم توفير مهايئ USB لاسلكي."];	
var initChPrompt = ["تثبيت قنوات التلفاز","يرجى تحديد نوع البحث الهوائي.","معالجة التوليف التلقائي...","تم العثور على القنوات الهوائية التالية:","يرجى تحديد نوع بحث الكابل.","يرجى تحديد مشغل واحد من القائمة التالية.","يرجى تكوين معلومات البحث","تم العثور على قنوات الكابل التالية:","يرجى تحديد مشغل واحد من القائمة التالية","يرجى تحديد أقمار صناعية للبحث فيها أو تحرير القمر الصناعي المحدد","يرجى تعيين معلمات القمر الصناعي","تم العثور على القنوات التالية، ويمكن أيضًا إجراء بحث على القنوات مجددًا في القناة/البحث عن قنوات"];	
var initClockPrompt = ["اطّلع على الوقت المذكور على الشبكة!","يرجى تعيين التاريخ والوقت:"];	
var initialOptions = ["البيئة","إعداد الشبكة","تحديث السوفت وير","تثبيت القناة","الساعة"];	
var initialHotkeys = ["الخلف","تحديد","التالي","أنا أتفق"];
var initLocations = ["المنزل","متجر","تسوق مع العرض التوضيحي"];
var initNets = ["سلكي","اللاسلكي","ليس لدي اتصال بالشبكة"];	
var initWireManuals = ["عنوان IP","قناع الشبكة الفرعية","بوابة افتراضية","DNS أساسي","DNS ثانوي"];	
var initSoftUpdates = ["تحديث الآن","التحديث لاحقًا"];	
var initChannelIns = ["استمرار","لا أرغب في تثبيت القنوات"];	
var initChScanTypes = ["DTV & ATV","DTV","ATV","لا أرغب في إجراء البحث"];	
var initChDvbts = ["قنوات ATV في وضع الهوائي:","قنوات DTV في وضع الهوائي:"];	
var initChDvbcs = ["قنوات ATV في وضع الكابل:","قنوات DTV في وضع الكابل:"];	
var initChDvbss = ["قنوات القمر الصناعي:"];	
var initChDvbSOther = ["لا أرغب في إجراء بحث على القمر الصناعي"];	
var initEndConnectedStatus = ["تم قطع الاتصال","تم توصيل WiFi","متصل سلكيًا"];	
var initEndInstallations = "تم تثبيت XXXX من القنوات";	
var initEndUpdate = ["تم التحديث"];	
var audioScenes = ["سطح المكتب","تركيب على الحائط"];	
var screenSavers = ["لا توجد قنوات، يرجى الضغط على مفتاح OK والبحث!","لا توجد إشارة!","مختلِط","البيانات فقط","برنامج الصوت","لا يوجد صوت وفيديو","غير متوفر","لا توجد نصوص معلومات","لا توجد بيانات للبرنامج.","تم قفل البرنامج!","البرنامج مقفل!‎\nاضغط على موافق وأدخل الرمز الخاص بك.","لا توجد تفاصيل للبرنامج.","برنامج ضار للصغار!‎\nالرجاء الضغط على موافق وإدخال الرمز الخاص بك.","تم قفل القناة!","القناة مقفلة!‎\nاضغط على موافق وأدخل الرمز الخاص بك.","الإدخال مقفل!‎\nاضغط على موافق وأدخل الرمز الخاص بك.","غير مدعوم!","هذه الخدمة غير متوفرة حاليًا","تم قفل الإدخال!","لا يوجد عنوان برنامج.","لا توجد وظيفة",    "لا توجد ترجمة"];
var channelNumberOverPromt = ["The number of search programs has exceeded,you can delete some programs and then retry!"];
var chBookingPromt = ["تحتوي القناة الحالية على تسجيل مجدول، سيبدأ التلفزيون التسجيل.","تم العثور على تسجيل مجدول.‎\n انتقل إلى XXXX للتسجيل","تحتوي القناة الحالية على تذكير.","تم العثور على تذكير مجدول.‎\n انتقل إلى XXXX"];	
var timeUnit = ["ثانية","دقيقة"];	
var ciPromt = ["تم تغيير بيانات الشبكة. للتحديث يمكنك إجراء مسح التحديث.",];	
var othersPromt = ["يرجى الانتظار...",];	
var menuOptions = ["صورة","الصوت","قناة","التلفاز الذكي","الشبكة","النظام","الدعم"];	
var optionOptions = ["الإعداد المسبق للصورة","وضع الصوت","تجميد الصورة","T-Link","التسجيل للعرض في وقتٍ آخر","PVR","قائمة الجدول","الإعدادات","عرض تجريبي"];	
var optionTLinkPromt = [["تشغيل الطاقة تلقائيًا","استعداد تلقائي","قائمة الدليل"],["تشغيل","استعداد","مستوى صوت مكبّر الصوت"]];	
var powerPromt = ["سيتوقف التلفاز عن التشغيل قريبًا!‎\n يرجى الضغط على أي مفتاح للإلغاء."];	
var ttxLanguage = ["أوروبا الغربية","أوروبا الشرقية","الروسية","العربية/العبرية","الفارسية","العربية","البيلوروسية","اليونانية","التركية"];	
var ttxOptions = ["كشف","تسلسل الصفحات الفرعية","اللغة","صفحة التنبيه","موجز الأخبار"];	
var weekday = ["الأحد","الاثنين","الثلاثاء","الأربعاء","الخميس","الجمعة","السبت"];	
var lcnConfflict = "هذا البرنامج لديه مشاكل في الاستقبال. هناك إصدار آخر متاح على القناة٪ d";	
var inShopMode = "تم تعيين تلفازك على وضع المتجر. لتعيين وضع المنزل، يرجى تحديد \"النظام\" وتغيير \"الموقع\" في القائمة.";	
var nitRefresh = "حدث تغيير في بيانات الشبكة. هل تريد إجراء فحص التحديث؟";	
var picHDMIMode = ["تلقائي","جرافيك","فيديو"];	
var glassRemind = ["يرجى توصيل النظارات ثلاثية الأبعاد بالتلفاز‎\n(اضغط مع الاستمرار على مفتاح الطاقة على النظارات ثلاثية الأبعاد).","تم توصيل نظارات 3D الخاصة بك إلى التلفزيون",""];	
var pvrRemind = ["لا تنزع محرك أقراص USB أو تفصل الطاقة"];	
var pvrConName = ["PVR","معلومات البرنامج:",["ملاحظة: لتسجيل قناة HD، حدد محرك الأقراص USB (السرعة> 5.0MB / ثانية). لتسجيل قناة SD، حدد محرك الأقراص USB (السرعة> 3.0MB / ثانية).","يتم حفظ الفيديو المسجل في المجلد  \"PVR\"."],"إيقاف","تسجيل","ساعة","دقيقة","المدة","نصائح","استخدم مفاتيح الأسهم لضبط مدة التسجيل."];	
var pvrDisRemind = "يرجى إدخال محرك أقراص USB للتسجيل.";	
var pvrRemindWords = ["هل ترغب في الإنهاء؟","هل ترغب في إيقاف التسجيل والبحث عن الملفات المسجلة؟","تم إزالة محرك أقراص USB.","لا توجد مساحة خالية كافية.","لا توجد ملفات مسجلة. بدء التسجيل.","‏PVR غير مدعوم في القناة المختلطة.","الميزة غير متوفرة","تم الحفظ بنجاح.","هل تريد إيقاف عملية التسجيل وتغيير مصدر الإدخال؟","سينهي التلفزيون التسجيل الحالي. هل ترغب في الإنهاء؟","يحتاج تسجيل PVR إلى إشارة تلفاز للعمل بشكل صحيح، يرجى التحقق من الإشارة."];	
var pvrChangeCh = ["هل ترغب في تغيير القناة؟","هل تريد إيقاف عملية التسجيل وتغيير القناة؟"];	
var pvrChangeToPIN8 = ["هل ترغب في تغيير المصدر إلى جهاز متصل بمدخل SCART؟",    "هل ترغب في إيقاف عملية التسجيل وتغيير المصدر إلى جهاز متصل بمدخل SCART؟"];	
var pvrChangeToCEC = ["هل ترغب في تغيير المصدر إلى جهاز متصل بمدخل HDMI؟",   "هل ترغب في إيقاف عملية التسجيل وتغيير المصدر إلى جهاز متصل بمدخل HDMI؟"];	
var pvrGuideJump = ["هل ترغب في إدخال EPG؟","هل تريد إيقاف عملية التسجيل والدخول إلى EPG؟"];	
var pvrMediaJump = ["هل ترغب في إدخال الوسائط المتعددة؟","هل ترغب في إيقاف عملية التسجيل، وإدخال الوسائط الاجتماعية؟"];	
var timeshiftExtra = ["هل تريد إيقاف التسجيل للعرض في وقتٍ آخر وتغيير القناة؟","هل ترغب في إيقاف التغيير الزمني، وتغيير المصدر إلى جهاز متصل بمدخل SCART؟","هل ترغب في إيقاف التغيير الزمني، وتغيير المصدر إلى جهاز متصل بمدخل HDMI؟","التسجيل للعرض في وقتٍ آخر غير مدعوم في القناة المختلطة.","هل تريد إيقاف التسجيل للعرض في وقتٍ آخر وإدخال EPG؟","هل ترغب في إيقاف التغيير الزمني، وإدخال الوسائط الاجتماعية؟","هل تريد إيقاف التسجيل للعرض في وقتٍ آخر وتغيير مصدر الإدخال؟","يرجى إدخال محرك أقراص USB للتسجيل.","حجم محرك أقراص USB غير كاف.","سيوقف التلفاز التغيير الزمني الحالي. هل ترغب في الإنهاء؟"];	
var timeshiftStatus = ["تسريع للخلف","إيقاف","عرض","إيقاف مؤقت","تسريع للأمام"];	
var pvrPowerOffRemind = ["التسجيل في وضع الاستعداد","وضع الإستعداد","يسجل التلفاز الآن، هل ترغب في حفظ التسجيل عندما يكون التلفاز في وضع الاستعداد؟"];	
var timeshiftInitTitle = "إعداد محرك أقراص USB";	
var timeshiftInitReminds = ["يستخدم هذا المعالج لإعداد محرك أقراص USB لإجراء التغيير الزمني. يرجى تحديد وضع الإعداد.", "للحصول على أداء أفضل، ننصح بتهيئة محرك أقراص USB. سيمحو هذا جميع البيانات.", "يرجى تحديد حجم الملف للتسجيل للعرض في وقتٍ آخر.", "تهيئة", "لا توجد مساحة خالية كافية.", "إنشاء ملف التغيير الزمني", "اختبار السرعة", "سرعة محرك أقراص USB بطيئة للغاية (< ‎ %fميجابايت/ثانية) بالنسبة إلى ميزة التغيير الزمني.", "محرك أقراص USB جاهز للتغيير الزمني. لكننا ننصح بتغييره (إلى سرعة > ‎ %f ميجابايت/ثانية) للاستماع بأداء أفضل.", "محرك أقراص USB جاهز للتغيير الزمني."];	
var timeshiftInitButtons = ["تنسيق","تخطي","إلغاء","موافق","إنهاء","خروج"];	
var timeshiftInitOther = ["سرعة محرك أقراص USB:","ميجابايت/ثانية"];	
var selectChoice = "هل تريد بالتأكيد القيام بالإجراء المحدد؟";	
var chAtvStore = "تخزين بتنسيق XXXX";	
var chEpgFirstGenreUK = ["فيلم","الأخبار والوقائع","ترفيهي","رياضة","الأطفال","تعليم","نمط الحياة","دراما"];	
var homePageTitleList = ["التطبيقات","التليفزيون","مقاطع الفيديو","الصفحة الرئيسية"];	
var homePageFavAndAllName = ["التطبيقات المفضلة","كل التطبيقات"];	
var homePageBackUp = ["الدليل الإلكتروني","GuideOn"];	
var homePageRemind = ["لا تتوفر الوظائف الكاملة إلا بعد الاتصال بالشبكة.","لا يحتوي تلفازك على أي قنوات حتى الآن. تصبح البرامج متوفرة بعد إجراء البحث عن قنوات.","لا توجد برامج","هل ترغب في البحث عن القنوات الآن؟"];	
var homePageHistory = ["السجل"];	
var miracastTitle = ["عرض WiFi","جهاز TCL"];	
var miracastRemind = ["يسمح لك عرض WiFi بمشاركة الشاشة والصوت الصادر من جهازك كتوصيل هاتف ذكي أو جهاز لوحي بتلفازك لاسلكيًا (على سبيل المثال بدون كابلات). يجعل ذلك من الممكن عرض ما يعرضه هاتفك الذكي أو جهازك اللوحي على تلفازك في الوقت نفسه. على سبيل المثال، يمكنك تشغيل أحد مقاطع الفيديو على هاتفك الذكي وعرضه في الوقت نفسه على تلفازك، أو استخدام جهازك اللوحي كأداة تحكم في الألعاب مع المحتوى المعروض على شاشة تلفازك الكبيرة.","أصبح عرض WiFi على التلفاز جاهزًا، يرجى بدء مشاركة شاشة جهازك مع التلفاز الآن.","اتصال. يرجى الانتظار!","فشل الاتصال!","فشل في التوصيل. يرجى التحقق!"];	
var homePageLittleWin = ["الإعدادات","الوسائط","القنوات المفضلة","التلفاز الذكي","EPG"];	
var hbbtvStopRemind = ["هل ترغب في إيقاف التشغيل؟"];	
var colorSystem = ["تلقائي","PAL","SECAM","NTSC"];	
var deviceTitleTipsText = "اضغط على ≡ للحصول على مزيد من المعلومات";	
var emptyListInfo = "لا يوجد محرك أقراص USB متصلاً بالتلفاز!";	
var optionVideoListArray_1 = ["الإعداد المسبق للصورة", "وضع الصوت", "وضع التشغيل", "حجم الصورة", "الوضع ثلاثي الأبعاد",   "التبديل بين اليسار واليمين", "عمق الحقل", "الترجمة", "مسار الصوت", "العنوان", "الفصل", "Info"];	
var optionVideoListArray_2 = ["الإعداد المسبق للصورة", "وضع الصوت", "وضع التشغيل", "حجم الصورة",   "الترجمة", "مسار الصوت", "العنوان", "الفصل", "Info"];	
var bottomTipsText = ["تشغيل/إيقاف مؤقت", "تسريع للخلف", "تسريع للأمام", "قائمة تشغيل", "الإعدادات"];	
var picturePresetArray = ["قياسي", "سطوع", "طبيعي", "فيلم", "يدوي"];	
var videoPlayModeArray = ["تكرار الكل", "تكرار واحدة", "طبيعي"];	
var screenModeHDArray = ["16:9", "4:3", "Cinerama", "تكبير عريض", "تكبير/تصغير 2", "تكبير عريض 2", "تمديد التكبير", "تلقائي"];	
var screenModeSDArray = ["16:9", "4:3", "Cinerama", "14:9 تكبير/تصغير", "16:9 تكبير/تصغير", "16:9 تكبير", "تلقائي"];	
var Mode3DArray = ["إيقاف", "ثنائي الأبعاد إلى ثلاثي الأبعاد", "جنبًا إلى جنب", "أعلى-و-أسفل", "الخط متداخل"];	
var videoOptionListArray = ["إيقاف", "المسار", "الترجمة", "العنوان", "الفصل"];	
var subMenuTitleText = "الترجمة";	
var langMenuTitleText = "لغة الصوت";	
var titleMenuTitleText = "العنوان";	
var mode3DMenuTitleText = "الوضع ثلاثي الأبعاد";	
var langInfoText = "المسار";	
var STOP_RESUME_INFO = "إيقاف استئناف";	
var playListName = "الاسم";	
var eb_tips = "نصائح";	
var ok_button = "موافق";	
var eb_info = ["حدث خطأ في فك ترميز الصوت.", "حدث خطأ في فك ترميز الفيديو.", "تنسيق الصوت غير مدعوم.",    "تنسيق الفيديو غير مدعوم.", "يتعذر فتح الملف.", "حدث خطأ في التشغيل، يرجى المحاولة مرة أخرى.",   "تنسيق الملف غير مدعوم.", "عذرًا! توقف المشغل عن العمل.",   "مسار الملف غير موجود أو غير صالح. ‎ \nأعد إدخال جهاز التخزين وحاول مرة أخرى.",   "هل ترغب في الاستمرار في البدء من نقطة‎ \n التشغيل السابقة؟"];	
var picturePlayErrorTips = ["فشل التحميل !!!", "الصورة كبيرة جدا !!!", "خطأ في الشبكة!!!", "Thread error!!!", "Param error!!!", "خطأ غير معروف!!!"];	
var frameTitleText = "جهاز جديد";	
var eb_quit_info = "هل تريد بالتأكيد الإنهاء؟";	
var eb_yes = "نعم";	
var eb_no = "لا";	
var offinfo = "إيقاف";	
var naInfo = "لاغي";	
var consoleInfoArray = ["تسريع للخلف", "تسريع للأمام", "تشغيل/إيقاف مؤقت", "قائمة تشغيل"];	
var cantOperateText = ["الوظيفة غير مدعومة."];	
var chapterChangeInfo = "تتاح الفصول من 1 إلى XXXX فقط.";	
var metaDataArray = ["العنوان / البيانات الوصفية:", "البيانات الوصفية للفصل:", "البيانات الوصفية الصوتية:", "البيانات الوصفية للترجمة:"];	
var metaTitleInfo = "العنوان";	
var metaChapterInfo = "الفصل";	
var videoLoadingInfo = "جار التحليل...";	
var listLoadingInfo = "جاري التحميل.....";	
var pgInfo = "تصنيف القانون:";	
var fileNameText = "الاسم";	
var fileDateText = "التاريخ";	
var fileSizeText = "الحجم";	
var fileDurationText = "المدة";	
var fileDirectorText = "المخرج";	
var fileCopyrightText = "حقوق النشر";	
var fileArtistText = "الفنان";	
var fileAlbumText = "الألبوم";	
var fileGenreText = "النوع";	
var fileYearText = "السنة";	
var fileGenreText = "النوع";	
var mainListArray = ["الكل", "صورة", "فيديو", "موسيقى"];	
var sortArray = ["الاسم", "التاريخ"];	
var parserArray = ["طبيعي", "تكرارى"];	
var emptyTipsInfo = "عذرًا. لم يتم العثور على ملف مدعوم.";	
var emptyFolderInfo = "عذرًا. لم يتم العثور على ملف مدعوم.";	
var sortName = "التصنيف حسب";	
var parserName = "محلل";	
var divx_str1 = "DivX(R) تسجيل";	
var divx_str2 = "DivX(R) الغاء تسجيل";	
var infor_str = "Info";	
var quickMenuEmptyText = "لا تتوفر خيارات.";	
var musicSoundPresetArray = ["قياسي", "فيلم", "موسيقى", "تنقية الصوت", "يدوي"];	
var musicInformationArray = ["الاسم", "الفنان", "الألبوم", "النوع:", "السنة:", "المدة:"];	
var playListName = "الاسم";	
var playTipsInfo = ["تقوم بتشغيل الملف الأول.", "تقوم بتشغيل الملف السابق."];	
var musicNameInfo = "الاسم";	
var musicArtistInfo = "الفنان";	
var musicAlbumInfo = "Info";	
var optionSoundPresetInfo = "وضع الصوت";	
var optionBGMInfo = "تشغيل في الخلفية";	
var optionAudioOnlyInfo = "صوت فقط";	
var optionInfoText = "Info";	
var remotePhoneConnecte = "‏XXXX متصل بالتلفاز!";	
var tvRemoteTitle = "جهاز التحكم عن بُعد الخاص بالتلفزيون";	
var tvRemoteDeveloper = "تم تطوير التطبيق بواسطة TCL";	
var tvRemoteDeviceTitle = "اسم الجهاز:";	
var remoteOption = ["مشاركة الوسائط","وحدة التحكم عن بُعد","مساعدة","حول","الاتصال الذكي"];	
var remotebottom = "يرجى تحميل  \"TV Remote\" إلى الهاتف الذكي الخاص بك";	
var remoteStage = ["Android","iOS"];	
var sharingReminds = ["مشاركة الصور ومقاطع الفيديو والموسيقى مع التلفاز من خلال الهاتف.","الخطوات: ‎\n‏   1. انقر فوق \"‎TV Remote\" على الهاتف. وصّل الهاتف بالتلفاز من خلال شبكة WiFi نفسها؛‎\n‏   2. انقر فوق \"مشاركة الوسائط\" لاستعراض ملفات؛‎\n‏   3. أرسل الوسائط إلى التلفاز لتشغيلها (باستخدام أحد الخيارات التالية)","أ) سحب وإسقاط المجلد / الملف إلى أيقونة التلفزيون في الجزء العلوي من الشاشة؛ \ n      ب) حرك الهاتف نحو التلفزيون لتشغيل الملف الأول؛ \ n      ج) تشغيل وسائل الإعلام على الهاتف وانقر على أيقونة TV sharing.","4. أثناء اللعب على شاشة التلفزيون، قم بهز الهاتف لتشغيل الملف السابق أو التالي."];	
var controlReminds = ["استخدم الهاتف كوحدة تحكم عن بعد لتشغيل التلفاز."," ","الخطوات: ‎\n‏   1. انقر فوق \"‎TV Remote\" على الهاتف. وصّل الهاتف بالتلفاز من خلال شبكة WiFi نفسها؛‎\n‏   2. انقر فوق \"وحدة التحكم عن بعد\" لتشغيل التلفاز."];	
var helpDeviceWords = "تفاعل الشاشة المتعدد";	
var helpBottom = "في عصر تكنولوجيا السحابة، والأجهزة الذكية مثل الهاتف والتلفزيون ترتبط بعضها بعضا. مشاركة وسائل الإعلام على شاشات متعددة مع عائلتك والتحكم في التلفزيون من خلال الهاتف!";	
var helpReminds = ["الإعدادات‎\n‏   1. نزّل \"‎TV Remote\" وثبته من Google Play أو Apple Store.‏\n   2.‏ وصّل الهاتف بالتلفاز من خلال شبكة WiFi نفسها."," ","الهتاف الموصى به‎\n‏   1. وحدة المعالجة المركزية: أعلى من 800 ميجاهرتز‎\n‏   2. التخزين: مساحة فارغة تقدر بـ 80 ميجابايت على الأقل"," ","إخلاء المسؤولية‎/n   إذا كان \"‎TV Remote\" غير متوفر على هاتفك، فيرجى الاتصال بالشركة المصّنعة للهاتف."];	
var helpButtons = ["السابق","التالي"];	
var aboutReminds = ["جهاز التحكم عن بُعد الخاص بالتلفزيون","تم تطوير التطبيق بواسطة TCL"];	
var aboutExit = "خروج";	
var smartReminds = ["التوصيل السريع والذكي بين التلفاز والهاتف."," ","الخطوات ‎\n‏   1. وصّل التلفاز والهاتف الذكي بشبكة الاتصال المحلية نفسها. انقر فوق \"‎TV Remote\" على الهاتف الذكي.‎\n‏   2. انقر فوق \"‎Smart Connect\" لمسح رمز QR‏.‎\n‏   3. مع إعداد التلفاز في وضع مشاهدة البث، اضغط على مفتاح INFO على وحدة التحكم عن بعد الخاصة بالتلفاز لمدة 4 ثوان، وسيظهر رمز QR على الشاشة بالكامل.",];	
var smartQRReminds = ["يرجى النقر فوق \"‎Smart Connect\" في \"‎TV Remote\" على هاتفك وامسح رمز QR لتوصيل التلفاز والهاتف بسرعة.","يحتوي رمز QR على معلومات حساب شبكة الاتصال المحلية. يرجى الحفاظ عليها في مكان آمن."];	
var consoleTipArray = ["السابق","التالي","وحدة التحكم","قائمة تشغيل"];	
var optionInfoArray = ["الإعداد المسبق للصورة","وضع التشغيل","المدة","التأثير","Info"];	
var playModeArray = ["طبيعي","تشغيل عشوائي","تكرار"];	
var durationArray = ["قصير (5 ثوان)", "متوسط (10 ثوان)", "طويل (15 ثانية)"];	
var effectArray = ["لا يوجد", "تدوير", "مسح إلى اليمين", "مسح إلى اليسار", "مسح لأعلى", "مسح لأسفل", "مربع داخل", "مربع خارج", "عشوائي"];	
var infoArray = ["الاسم:","حجم:","التاريخ:","الموقع"];	
var picturePresetBarTitleInfo = "الإعداد المسبق للصورة";	
var picturePresetBarArray = ["قياسي","سطوع","استوديو","فيلم","يدوي"];	
var upTipsInfo = "تحريك الصورة";	
var consoleTipsArray = ["وحدة التحكم","السابق","التالي","قائمة تشغيل","الإعدادات"];	
var pictureMoveTipsArray = ["اضغط على زر الاتجاه الأيمن مرة أخرى لتشغيل الصورة التالية","اضغط على زر الاتجاه الأيسر مرة أخرى لتشغيل الصورة السابقة","اضغط على زر الاتجاه لأسفل مرة أخرى لإظهار قائمة التشغيل"];	
var optionPvrListArray = ["الإعداد المسبق للصورة","وضع الصوت", "حجم الصورة", "الوضع ثلاثي الأبعاد", "الترجمة", "مسار الصوت", "Info"];	
var titleSpanFirstArray = ["التحكم والتوصيل","عمليات أساسية","التطبيقات","التليفزيون","الإعدادات","أسئلة متكررة"];	
var titleSpanSecondArray = [["وحدة التحكم عن بُعد","مفاتيح اللوحة","تنقل سهل","توصيل التلفزيون","توصيل التلفزيون","توصيل التلفزيون","اللاسلكي"],["المشغِّل","شريط الحالة","المصدر"],["جارى تشغيل التطبيقات","الوسائط","جهاز التحكم عن بُعد الخاص بالتلفزيون"],["ضبط القناة ومستوى الصوت","قائمة القنوات","EPG","تثبيت قناة","القنوات المفضلة"],["ضبط الصورة","ضبط الصوت","ضبط القناة","تحديث البرنامج","اللغة","القفل الابوى"],["أسئلة متكررة","أسئلة متكررة","استكشاف الأخطاء وإصلاحها","استكشاف الأخطاء وإصلاحها","الشروط والأحكام"]];	
var contentSpan1_1Array = [["الطاقة:","المصدر:","الإعدادات:","الخيار:","الخلف:","معلومات:","الرئيسية:","خروج:","القائمة:"],    ["تشغيل الطاقة أو وضع الاستعداد",        "حدد مصدر الإدخال",        "لعرض قائمة الإعدادات",        "لعرض قائمة الخيارات",        "للرجوع إلى القائمة أو الخروج من تطبيق قيد التشغيل.",        "إظهار معلومات النظام",        "للوصول إلى الصفحة الرئيسية للتلفاز الذكي",        "للرجوع إلى القائمة أو الخروج من تطبيق قيد التشغيل.",        "إظهار قائمة القنوات"]];	
var contentSpan1_2Array = ["القناة السابقة","القناة التالية","زيادة مستوى الصوت","خفض مستوى الصوت","ينتقل إلى الصفحة الرئيسية","تأكيد الخيار","وضع الاستعداد/تشغيل"];	
var contentSpan1_3Array = ["موافق/الدليل","القناة التالية","القناة السابقة","خفض مستوى الصوت","زيادة مستوى الصوت","متوفر كمفاتيح أسهم في بعض الوظائف."];	
var contentSpan1_4Array = ["شبكة اتصال محلية","HDMI ( MHL )‎","HDMI","HDMI ( ARC )‎","محول خرج AV","شبكة اتصال محلية","هاتف ذكي","‏PC/جهاز الاستقبال الرقمي العالمي/DVD","مكبر الصوت","مكبر الصوت/الشاشة","قد لا يحتوي تلفازك على جميع المقابس."];	
var contentSpan1_5Array = ["USB 2.0","USB 3.0","سماعة رأس","محول دخل AV","SPDIF","محول دخل صوت CMP","محول دخل CMP (YPbPr)‎","أجهزة USB","أجهزة USB","سماعة رأس","‏DVC/وحدة الألعاب/جهاز الاستقبال الرقمي العالمي/DVD","مكبر الصوت","‏DVC/وحدة الألعاب/جهاز الاستقبال الرقمي العالمي/DVD","قد لا يحتوي تلفازك على جميع المقابس."];	
var contentSpan1_6Array = ["واجهة عامة","SD","VGA","SCART","‏SCART مصغرة","ANTENNA IN","CI  CAM","بطاقة SD","PC","جهاز الاستقبال الرقمي العالمي/DVD","هوائي/كابل/قمر صناعي","قد لا يحتوي تلفازك على جميع المقابس."];	
var contentSpan1_7Array = ["جهاز لوحي","PC","موجه","الهاتف","التليفزيون"];	
var contentSpan1_8Array = ["تبديل الوظيفة / التشغيل","الضغط لفترة طويلة للذهاب إلى مؤقت النوم","للخلف","للأمام","Volume/Channel/Source"];	
var contentSpan2Array = [["اضغط على HOME لعرض الصفحة الرئيسية.","ثم اضغط على OK (موافق) لمشاهدة أحد برامجك المفضلة أو الدخول إلى التطبيق."],["إظهار التاريخ والشبكة والأجهزة وغير ذلك في الركن العلوي الأيمن من الشاشة."],["حدد مصدر الإدخال من الأجهزة المتصلة بالتلفاز من خلال المنافذ المختلفة، مثل TV وAV وHDMI وما إلى ذلك."]];	
var contentSpan3Array = ["استمتع بتطبيقاتك المفضلة واعرضها من خلال صفحة التلفاز الذكي.","يمكنك عرض الصور ومشاهدة مقاطع الفيديو وتشغيل الموسيقى من جهاز تخزين USB.","قم بتوصيل التلفزيون الخاص بك والهاتف الذكي أو الجهاز اللوحي بنفس شبكة LAN.","انقر فوق nScreen أو  علي TV Remote على الهاتف الذكي أو الجهاز اللوحي.","يمكنك مشاركة الصور ومقاطع الفيديو والموسيقى على شاشات متعددة مع عائلتك والتحكم في التلفزيون من خلال هاتفك الذكي."];	
var contentSpan4Array = [["اضغط على P+/P-‎ لتغيير القنوات.","اضغط على V+/V-‎ لضبط مستوى الصوت."],["اضغط على قائمة على وحدة التحكم عن بُعد لعرض قائمة القنوات.","اضغط على لأعلى/لأسفل لاختيار قناتك."],["دليل البرامج الإلكتروني (EPG) هو دليل على الشاشة يعرض برامج التلفاز المجدولة. يمكنك التنقل بين البرامج وتحديدها وعرضها وتسجيلها."],["بحث عن القنوات وتثبيتها."],["قم بإضافة قنواتك المفضلة أو تحريرها في قائمة القناة."]];	
var contentSpan5Array = ["استمتع ببرامجك المفضلة من خلال تطبيقات الفيديو."];	
var contentSpan6Array = [["اضغط على MENU (القائمة) لإظهار خيارات إعداد النظام.","أدخل إعدادات الصورة لضبط القيم."],["اضغط على MENU (القائمة) لإظهار خيارات إعداد النظام.","أدخل إعدادات الصوت لتعيين الخيارات."],["اضغط على MENU (القائمة) لإظهار خيارات إعداد النظام.","أدخل إعدادات القناة لتعيين الخيارات."],["قم بتحديث التلفزيون الخاص بك عند توفر إصدار جديد من البرنامج."],["يمكنك اختيار لغة القائمة المفضلة لديك."],["يمكِّن الأبوين من قفل القنوات أو البرامج غير المناسبة للأطفال."]];	
var contentSpan7_1Array = [["لا توجد صور، لا يوجد صوت","تحقق من عمل المنصهر أو دائرة القاطع.","قم بتوصيل جهاز كهربي آخر في مقبس الكهرباء للتأكد من عمله أو أنه قيد التشغيل.","قابس الطاقة غير متصل بمقبس الطاقة بشكل سليم.","تحقق من مصدر الإشارة."],["صورة عادية، لا يوجد صوت","اضغط على زر الصوت V+‎ لزيادة مستوى الصوت.","إعداد الصوت غير صحيح.","إشارة خطأ من البث."],["صوت عادي، لا توجد صورة","اضبط السطوع والتباين.","إشارة خطأ من البث.","تحقق مما إذا كان في وضع الصوت فقط."]];	
var contentSpan7_2Array = [["تداخل تردد الراديو","ينتج عن هذا التداخل تموجات متحركة أو خطوط قطرية، وفي بعض الحالات، فقدان تباين الصورة. ابحث عن مصدر تداخل الراديو وتخلص منه."],["بلا ألوان","اضبط إعدادات اللون.","حاول فتح قناة أخرى. قد يتم استقبال برنامج أبيض وأسود."],["جهاز التحكم عن بعد لا يعمل","استبدل البطاريات.","لم يتم تركيب البطاريات بشكل صحيح. لم يتم توصيل الطاقة الرئيسية للتلفزيون."]];	
var contentSpan7_3Array = [["لم يتم عرض محتوى جهاز USB","تحقق من أن جهاز تخزين USB متوافق مع التلفزيون.","تحقق من أن التلفزيون يدعم تنسيقات ملفات الصوت والصورة."],["عرض بدون صوت","مشغل التلفزيون لا يدعم تنسيق صوت مقطع الفيديو."],["لا يتم عرض الملفات بسلاسة","قد يقلل أداء جهاز USB من معدل نقل البيانات إلى التلفزيون."]];	
var contentSpan7_4Array = [["ما الذي يجب عليَّ الانتباه إليه، عند تحديث البرنامج","عدم انقطاع الطاقة عند تحديث البرنامج.","تجنب أي عمليات باستخدام وحدة التحكم عن بُعد عند تحديث البرنامج.","التحلي بالصبر لأن عملية تحديث البرنامج قد تستغرق وقتًا أطول قليلاً."],["لا توجد تغيرات جوهرية في واجهة التلفزيون بعد تحديث البرنامج.","في ظروف معينة، لن يعمل تحديث البرنامج على تحديث الوظائف وإضافة وظائف جديدة فحسب، بل سيعمل على تحسين أداء مجموعة التلفزيون، دون تغييرات جوهرية في الواجهة. أيضًا، قد تبقى واجهة التلفزيون سليمة في بعض الأحيان."]];	
var termsTitle = "الشروط والأحكام";	
var termsConditions = ["هذه المحتويات والخدمات (يُشار إليها إجمالاً \"التطبيق المرخَّص\") المتوفرة لك من خلال جهاز التلفزيون (هذا \"الجهاز\") مرخصة، وليست مباعة، لك لغرض الاستخدام بموجب هذه البنود والشروط فقط. يحتفظ موفرو التطبيق المرخَّص (كل \"موفر للتطبيق\") بكافة الحقوق غير الممنوحة لك بشكل صريح. ‎\n ‏1. نطاق الترخيص: ‎ \nيقتصر الترخيص الممنوح لك بخصوص التطبيق المرخَّص بواسطة موفر التطبيق ذي الصلة على ترخيص غير قابل للتحويل لاستخدام التطبيق المرخَّص على الجهاز الذي تمتلكه أو في حوزتك. لا يجوز توزيع أو توفير التطبيق المرخَّص على أي من الشبكات التي تسمح باستخدامه من جانب العديد من الأجهزة في وقت واحد. لا يجوز استئجار التطبيق المرخَّص أو تأجيره أو إقراضه أو بيعه أو إعادة توزيعه أو ترخيصه من الباطن. ‎\n تُقر وتوافق بأن التطبيق المرخَّص بالكامل وجميع المحتويات المضمَّنة بداخله والتي يمكن الوصول إليها من خلال هذا الجهاز تخص موفر التطبيق وأنها محمية بموجب قوانين الملكية الفكرية السارية. لا يجوز تعديل التطبيق المرخَّص أو نسخه أو فكه أو عكس البرمجة الخاصة به أو تفكيكه أو إعادة نشره أو تحميله أو نشره أو نقله أو ترجمته أو محاولة استخراج رمز المصدر الخاصة به أو إنشاء أعمال مشتقة منه أو غير ذلك من صور استغلال التطبيق المرخَّص أو أي من تحديثاته أو أي جزء منه. في حال خرقك لهذه القيود، فقد تخضع للمقاضاة أو التعرض لأضرار. تسري بنود الترخيص على أي ترقيات يقدمها موفر التطبيق والتي تحل محل و\أو تكون مكملة للتطبيق المرخَّص الأصلي، ما لم تكن تلك الترقية مصحوبة بترخيص منفصل، حيث تسري بنود ذلك الترخيص في تلك الحالة. أنت المسؤول الوحيد عن جميع وأي تكاليف (إن وُجدت) خاصة بترقية التطبيق المرخَّص. ‎\n ‏2. المواد الخاصة بطرف آخر:\n قد يُمكِّن التطبيق المرخَّص من الوصول إلى خدمات ومواقع ويب تابعة لموفر الخدمة وتابعة لطرف آخر (يُشار إليها إجمالاً \"الخدمات\"). تُدرك أنه بمجرد استخدام أي من الخدمات، فإنك قد تصادف محتويات قد تعتبر كريهة أو غير لائقة أو بغيضة، وقد يتم تعريف تلك المحتويات على أنها لغة بذيئة أو لا، وأن نتائج أي عملية بحث أو إدخال عنوان URL محدد قد تؤدي تلقائيًا وبدون قصد إلى إنتاج روابط أو مراجع إلى مواد بغيضة. وعلى الرغم من هذا، فأنت توافق على أن جهة تصنيع الجهاز (\"جهة تصنيع الجهاز\") ومزود التطبيق لن يتحملا أي مسؤولية تجاهك عن المحتويات التي تعتبر كريهة أو غير لائقة أو بغيضة بالنسبة لك. ‎\nوباستخدامك للخدمات، فأنت تقر وتوافق على أن جهة التصنيع ليست مسؤولة عن فحص أو تقييم المحتوى أو الدقة أو الاكتمال أو التوقيت أو الصلاحية أو الالتزام بحقوق الطبع أو القانونية أو الجودة أو أي جانب آخر من جوانب هذه الخدمات. لا تضمن الشركة المصنِّعة ولا تقر ولا تأخذ على عاتقها ولا يتحمل أية مسؤولية تجاهك أو تجاه أي شخص آخر بخصوص أي من تلك الخدمات. ‪ \nتقر وتوافق على أن الخدمات قد تحتوي على محتوى ومعلومات ومواد خاصة بالملكية (يُشار إليها إجمالاً \"المواد الخاصة بطرف آخر\") والتي تكون محمية بموجب قوانين الملكية الفكرية وغيرها من القوانين السارية، كما تقر وتوافق بأنك لن تستخدم تلك المواد الخاصة بطرف آخر بأي طريقة كانت إلا في إطار الاستخدام المسموح به للخدمات. توافق على عدم إعادة إنتاج أو تعديل أو استئجار أو تأجير أو إقراض أو بيع أو توزيع المواد الخاصة بطرف آخر أو إنشاء أعمال مشتقة من تلك المواد بأي طريقة، ولا يجوز لك استغلال الخدمات بأي طريقة كانت غير مصرح بها. كما توافق على عدم استخدام الخدمات بأي طريقة لمضايقة الغير أو الإساءة إليه أو ملاحقته أو تهديده أو النيل منه أو بأي طريقة تنتهك حقوقه أو تخرقها، وتقر بأن الشركة المصنِّعة ليست مسؤولة بأي طريقة عن قيامك بأي من تلك الأمور، أو عن أي رسائل أو عمليات إرسال تتضمن مضايقة أو تهديدًا أو قذفًا أو إساءة أو تكون غير قانونية، والتي قد تتلقاها نتيجة استخدامك لأي من تلك الخدمات. ‎\n ‏3. عدم وجود ضمان: ‎\n تُقر وتوافق بأنك المسؤول الوحيد عن استخدام التطبيق المرخَّص والخدمات. يُقدَم التطبيق المرخَّص والخدمات \"كما هي\" و\"حسب التوفر\" دون تقديم أي ضمان من أي نوع، سواء كان صريحًا أو ضمنيًا. تُخلي الشركة المصنِّعة مسؤوليتها صراحةً عن كافة الضمانات والشروط المتعلقة بالتطبيق المرخَّص والخدمات، سواء أكانت صريحةً أم ضمنيةً، بما في ذلك على سبيل المثال وليس الحصر ضمانات قابلية الترويج والجودة المرضية والملائمة لغرض معين والدقة والمتعة التامة وعدم التعدي على حقوق الطرف الآخر. لا تضمن الشركة المصنِّعة دقة أو صحة أو توقيت أو قانونية أو اكتمال أي من التطبيق المرخَّص أو الخدمات التي يتم توفيرها من خلال هذا الجهاز ولا تضمن تلبية الجهاز أو التطبيق المرخَّص أو الخدمات لمتطلباتك، أو أن يكون تشغيل التطبيق المرخَّص أو الخدمات بدون انقطاع أو خالٍ من الأخطاء أو أن يتم تصحيح عيوب التطبيق المرخَّص أو الخدمات. في حال ثبت أن التطبيق المرخص أو الخدمات معيبة، فأنت تتحمل كافة التكاليف المتعلقة بجميع عمليات الصيانة أو الإصلاح أو التصحيح اللازمة. ‎\nكما أنك تقر وتوافق على أن الخدمات والتطبيق المرخص يمكن أن يخضعا للتغيير أو التعليق أو الإزالة أو الإنهاء أو التوقف، كما يمكن أن يتم تعطيل الوصول في أي وقت بدون إخطار، ولا تقدم جهة التصنيع أي تصريح أو ضمان بأن أي محتوى أو خدمة مضمنة في الخدمات والتطبيق المرخص ستبقى متاحة لأي فترة من الوقت. يتم نقل تلك المحتويات والخدمات بواسطة طرف آخر عبر شبكات ووسائل نقل ليس للشركة المصنِّعة سيطرة عليها. دون تقييد عمومية ما سبق، تُخلي الشركة المصنِّعة مسؤوليتها صراحةً عن أي تغيير أو انقطاع أو تعطيل أو إزالة أو تعليق لأي محتوى أو خدمة يتم توفيرها من خلال الجهاز. يحتفظ موفر التطبيق وموفرو الخدمات الآخرين بحق تغيير أو تعليق أو إزالة أو تعطيل الوصول إلى أي تطبيق مرخص أو أي خدمة في أي وقت دون إخطار. ويمكن أن تضع الجهة المصنعة قيودًا على استخدام أو الوصول إلى خدمات أو تطبيق مرخص، في أي حال وبدون إخطار مسبق أو مسؤولية. ‎\n كما أن الجهة المصنعة لا تتحمل أي مسؤولية أو إلتزام عن خدمة العملاء المتعلقة بالتطبيق المرخص والخدمات. أي سؤال أو طلب خدمة متعلقة بالتطبيق المرخص والخدمات يجب توجيهه مباشرة إلى المزود المعني.‎\n ‏4. جمع واستخدام المعلومات‎\n أنت توافق على أن الجهة المصنعة ومزودي التطبيق ومزودي الخدمات يمكنهم استخدام البيانات التقنية والمعلومات ذات الصلة، ويشمل ذلك ولا يقتصر على المعلومات التقنية المتعلقة بالجهاز والنظام وبرنامج التطبيق والأجهزة الملحقة لتسهيل تقديم تحديثات البرنامج ودعم المنتج والخدمات الأخرى لك (إن وجد) فيما يتعلق بالجهاز والتطبيق المرخص. يجوز للشركة المصنِّعة وموفري التطبيق وموفري الخدمات الأخرى استخدام تلك المعلومات، طالما كان ذلك بشكل لا يحدد هويتك، وذلك بغرض تحسين منتجاتهم أو توفير خدمات أو تقنيات لك. ‎\n ‏5. عدم توفر ميزات معينة:\n نظرًا للقيود التي يفرضها موفر التطبيق، قد لا تتوافر ميزات وتطبيقات وخدمات معينة على هذا الجهاز (بما في ذلك الوحدات الطرفية الخاصة به) أو في كافة الأقاليم. كما قد تتطلب بعض الميزات الموجودة في هذا الجهاز أجهزة طرفية إضافية أو رسوم عضوية تُباع بشكل منفصل. ‎\n ‏6. تحديد المسؤوليات: ‎\n وفقًا للحد الذي يسمح به القانون الساري، لن تتحمل الشركة المصنِّعة، تحت أي ظرف من الظروف، بما في ذلك الإهمال، أي مسؤولية، سواء في العقد أو المسؤولية التقصيرية، عن أي أضرار أو أتعاب محاماة أو نفقات أو أي أضرار أخرى تنشأ أو تتعلق بأي معلومات مضمنة في الجهاز أو التطبيق المرخص أو أي خدمة من جانبك أو أي طرف آخر أو الأضرار الناتجة عن استخدام أي منها، حتى في حالة الإخطار بإمكانية حدوث تلك الأضرار."];	
var noChannelListRemind = ["لم يتم العثور على قنوات. تتوفر قائمة القنوات بعد البحث عن القنوات.","مسح القناة"];	
var closeSubtitleRemind = "ستتوفر هذه الوظيفة عندما تكون الترجمة قيد إيقاف التشغيل. هل ترغب في تعيينها الآن؟";	
var estickerTitles = ["صور حقيقية عالية الجودة","ألوان مفعمة بالحياة","حركة نابضة بالحياة","جودة صورة ديناميكية","الارتقاء بـ SR فائقة الجودة","جرب العالم ثلاثي الأبعاد","أداء أسرع","محتوى 4K رباعي","استمتع بعالم الإنترنت","الوصول إلى المزيد من المحتوى","أجهزة بحث رقمية متكاملة","توصيل جميع الأجهزة","مصادر 4K متعددة","محتوى USB","شبكة WIFI سريعة للغاية","عرض محتوى المحمول على التلفاز","محتوى جهاز المحمول","المحتوى المحلي","معتمد من قبل DivX","صورة سلسة","مزود بقنوات","TDT Premium"];	
var estickerDescriptions = ["تجربة مشاهدة متميزة بفضل الصور التي تحتوي على أربعة أضعاف تفاصيل الشاشة عالية الدقة وفائقة الدقة","يوفر التدرج اللوني المتعدد انفعالاً في كل مشهد يحتوي على الألوان الحمراء النابضة والألوان الخضراء الزمردية","اكتمال إطار 4K وتوجيه الإضاءة الخلفية للحد من مشكلات ضبابية الحركة","تم تعزيز وضوح الصورة الأصلية لإنتاج تعابير ديناميكية حقيقية مفعمة بتباين رائع","استمتع بعروض تلفاز وأقراص Blu-Ray المدهشة أكثر من أي وقت مضى بفضل تقنية الدقة الفائقة","استمتع بالتلفاز المزود بتقنية العرض الثلاثي الأبعاد بالفعل وشاهد محتوى ثلاثي الأبعاد متنوع","تجربة ترفيهية أكثر متعة باستخدام المعالج رباعي النواة للاستمتاع بتفاعل سلس وأداء متقدم","دعم ترميز HEVC (H.265)‎ للمستوى القادم من توزيعات الفيديو 4K","مجموعة كبيرة من التطبيقات على الإنترنت وخدمات VOD، ومتابعة برامج التلفاز، وتصف شبكة الإنترنت","اطلع على المزيد من الخدمات والمحتوى من الإذاعات المفضلة لديك","استمتع بالوصول إلى قنوات التلفاز بجودة عالية دون الحاجة إلى جهاز استقبال رقمي عالمي إضافي","سهولة الوصول إلى الكثير من المصادر الرقمية المتوفرة في المنزل","التلفاز مجهز لمواكبة المستقبل، ويمكنه تشغيل ملفات 4K 50/60 هرتز عبر HDMI 2.0 مع HDCP 2.2","عرض محتوى الفيديو أو الصور الموجودة على محرك الأقراص USB أو HDD أو كاميرا مباشرة على شاشة كبيرة بدقة 4K","يوفر أحدث جيل 2x2 MIMO والمحول القياسي سرعة وصول إلى شبكة الإنترنت متميزة","استمتع بعرض الصور ومقاطع الفيديو والتطبيقات من أجهزة المحمول على شاشة كبيرة بفضل تقنية مشاركة الشاشة","الصور والفيديو، والتطبيقات من الهاتف الذكي أو الكمبيوتر اللوحي يمكن عرضها على الشاشة الكبيرة","استمتع بعرض المحتوى المحلي مثل الصور ومقاطع الفيديو من أجهزة متصلة بالشبكة المحلية على شاشة كبيرة","شغل الأفلام التي اشتريتها أو استأجرتها والمحمية باستخدام DivX","إطار نحيف للغاية وتصميم نحيف جدًا","تم اختباره واعتماده من قبل Canal+‎","تم اختبار TDT Premium واعتماده"];	
var eManualTextArray = ["الدليل الإلكتروني","جميع الرسومات المضمنة مخصصة للعرض فقط."];	
var frontPanelRemind = "اللوحة الأمامية مقفلة.";	
var eRPRemind = "وضع المتجر لا يفي بمتطلبات ERP. هل تريد بالتأكيد تحديده؟";	
var noRelatedChannel = "لا توجد قناة ذات صلة";	
var option0624Name = ["BOP","BFS","حدث تلو الآخر","الحصول على معرّف المستخدم","BGM","إعادة تعيين الجميع","إعادة تعيين المتجر","NRM","‏DVB-T2 واختيار البلد","وضع HbbTV"];	
var DVBT2AndChoice = ["تشغيل","حسب البلد","إيقاف"];	
var hbbtvServiceRemind = "ستتوفر خدمة HbbTV قريبًا.";	
var insertWord = "إدراج";	
var viewDetail = "عرض التفاصيل";	
var remindOAD = "تحديث البرنامج. قد يوجد تحديث برامج جديد موصى به في قناة أخرى. إذا قبلت تنزيله، سيغير التلفاز القناة تلقائيًا. هل ترغب في القيام بهذا الآن؟";	
var LEDStatus = ["وميض", "طبيعي","إيقاف"];	
var netFlixRemind = "ستقطع هذه الوظيفة إمكانية الوصول إلى خدمات Netflix حتى تقوم بتسجيل الدخول مرة أخرى.";	
var ESNExplanation = "الرقم التسلسلي الإلكتروني";	
var resetShopRemind = "يتم إعادة تشغيل النظام الآن، يرجى عدم إيقاف تشغيل التلفاز";	
var initialSelectOption = "يرجى تحديد خيارًا واحدًا:";	
var databaseRemind = "تعرف النظام على قاعدة النظام على أنها قاعدة تالفة لبعض الأسباب غير المعروفة وأعاد إنشائها تلقائيًا، اضغط على موافق للمتابعة";	
var Deactivation = "إلغاء التنشيط";	
var oadFutureRemind = "تحديث البرنامج.‎ \nيتوفر برنامج جديد موصى به على ‎%s. قد يستغرق التحديث بعض الوقت وقد تتحول الشاشة إلى اللون الأسود. لا توقف تشغيل جهاز الاستقبال أثناء التحديث. عند قبول هذا التحديث، يرجى ترك جهاز الاستقبال قيد التشغيل في الوقت المجدول. هل ترغب في تلقي التحديث؟";	
var bt_title = "بلوتوث";	
var bt_soundOutPutName = "خرج الصوت";	
var bt_soundOutPutTV = "سماعات التلفاز";	
var bt_soundOutPutBT = "أجهزة بلوتوث";	
var bt_soundOutPutBT_TV = "‏Bluetooth والتلفاز";	
var bt_refreshBarName = "الأجهزة";	
var bt_settingTips_On = "تشغيل وظيفة البلوتوث ومسح الأجهزة.";	
var bt_settingTips_Finding = "جار البحث عن أجهزة...";	
var bt_settingTips_NoDevice = "لا يتوفر أي جهاز.";	
var bt_deviceList_State_NoConnect = "غير متصل";	
var bt_deviceList_State_Connecting = "يتم الآن الاتصال...";	
var bt_deviceList_State_Connected = "تم الاتصال";	
var bt_deviceList_State_Paired = "مقترن";	
var bt_deviceList_Conncect_Failed_Tips1 = "فشل إجراء الاتصال.";	
var bt_deviceList_Conncect_Failed_Tips2 = "يرجى التأكد من أن وظيفة XXX Bluetooth قيد التشغيل";	
var bt_deviceList_Conncect_Success = "متصل بجهاز Bluetooth.";	
var bt_deviceList_Disconncect_Success = "تم الفصل من جهاز Bluetooth.";	
var bt_deviceList_Disconnect = "هل ترغب بالتأكيد في الفصل من XXX؟";	
var bt_tipsTitle = "تلميح";	
var bt_bluetooth_Pairing_Title = "إقران Bluetooth";	
var bt_bluetooth_Input_Pin = "يرجى إدخال رمز PIN:";	
var bt_bluetooth_Output_Pin_Tip = "أدخل رمز PIN XXXX باستخدام لوحة المفاتيح.";	
var bt_bluetooth_Pin_Wrong_Tip = "رمز PIN غير صحيح";	
var bt_bluetooth_Remove_Pair_Title = "استعلام";	
var bt_bluetooth_Remove_Pair_Ask = "هل تريد نسيان هذا الجهاز؟";	
var audioDescriptionName = ["وصف صوتي","مستوى الصوت","مستوى صوت السماعة","سماعة رأس","مستوى صوت سماعة الرأس","مستوى صوت AD","جهاز BT","مستوى صوت جهاز BT","مكبر الصوت","مكبر الصوت"];	
var audioDescriptionOptions = ["إيقاف","طبيعي","وصف صوتي"];	
var volumeOffRemind = "يرجى تعيين XXX على \"تشغيل\" في قائمة الإعدادات.";	
var mEPSRemind = "وضع المتجر لا يتوافق مع متطلبات MEPS. هل تريد بالتأكيد تحديده؟";	
var parentRatingAUOptions = ["لا يوجد حظر", "قالب G والإصدار الأحدث (اختياري)", "حظر PG وما فوقها", "حظر M وما فوقها", "حظر MA وما فوقها", "حظر AV وما فوقها",  "حظر R وما فوقها", "حظر الكل"];	
var mEPSTips = ["وضع الصور الحالي لا يحقق متطلبات MEPS‎\n‏، يوصى بالوضع القياسي.",    "تلفازك على وضع المتجر.\nفيما يتعلق بوضع المنزل، يرجى الرجوع إلى قائمة الإعدادات."];	
var switchSourceRemind = "إدراج. هل تريد التبديل؟";	
var footballModeName = "وضع الرياضة";	
var resetStadium = "الإستاد";	
var atvSearchMenu = "البحث اليدوي في ATV";	
var dtvSearchMenu = "بحث DTV يدوي";	
var settingNoticeSourceName = "مصدر تلقائي";	
var smartTVOptions = ["بوابة التلفاز الذكي","HbbTV","شارك وشاهد","عرض WiFi","الشروط والأحكام",                            "الشبكة على وضع الاستعداد","إعادة ضبط التلفاز الذكي","Cookie policy","سياسة الخصوصية","حذف البيانات"];
var supportOptions = ["تطبيق Remote diagnosis","اتصل بنا"];	
var tvDoctor = ["تطبيق Remote diagnosis 2.0","لا يتوفر التطبيق إلا لتلفازك الذكي لتشغيل خاصية التشخيص وتحسين تجربة المنتج. سيتم تجميع بيانات تشغيل التلفاز ومعلومات الطراز من خلال هذا التطبيق وتحميلها على خادم، وسيتم استخدامها لحل المشكلة. لن يتم الوصول إلى معلوماتك الشخصية. تأكد من أن تلفازك متصل بشكل صحيح بشبكة الإنترنت.","تشخيص محلي","يرجى اتباع تعليمات موظفي الدعم بمجرد بدء التشخيص.","تطبيق Remote diagnosis","يرجى التأكد من أن موظفي الدعم متوفرون على الإنترنت.","الرقم التسلسلي:","&nbsp;&nbsp;&nbsp;&nbsp;User ID:","يتم الآن الاتصال...","متصل، يرجى الحفاظ على الشبكة متصلة.","تعذر الوصول إلى شبكة الإنترنت، ‎\nيرجى التحقق من اتصال الشبكة.","خروج"];	
var ClosedcaptionName = "تسمية توضيحية مغلقة";	
var sysCCOptions = ["وضع CC","‏CC تناظري","‏CC رقمي","فوق","تسمية توضيحية مغلقة"];	
var sysCCmodeOption = ["إيقاف", "تشغيل", "تشغيل عند كتم الصوت"];	
var sysanalogCCOption = ["إيقاف", "CC1", "CC2", "CC3", "CC4", "نص 1", "نص 2", "نص 3", "نص 4"];	
var sysdigitalCCOption = ["إيقاف", "خدمة 1", "خدمة 2", "خدمة 3", "خدمة 4", "خدمة 5", "خدمة 6", "خدمة 7", "خدمة 8"];	
var syssuperimposeOption = ["إيقاف", "خدمة 1", "خدمة 2", "خدمة 3", "خدمة 4", "خدمة 5", "خدمة 6", "خدمة 7", "خدمة 8"];	
var sysCCOPtionItems = ["CC Option","الوضع","نوع الخط","حجم الخط","نمط حافة الخط","لون حافة الخط","FG Color","BG Color","FG Opacity","BG Opacity"];	
var sysCCOtionMode = ["يدوي","افتراضي"];	
var sysCCOptionFontStyle = ["افتراضي","خط1","خط2","خط3","خط4","خط5","خط6","خط7"];	
var sysCCOptionFontSize = ["افتراضي","كبير","صغير","طبيعي"];	
var sysCCOptionFontEdgeStyle = ["افتراضي","لا يوجد","مرفوع","منخفض","الظل الأيسر","الظل الأيمن"];	
var sysCCOptionFontColor = ["افتراضي","أسود","أبيض","أحمر","أخضر","أزرق","أصفر","أرجواني","سماوي"];	
var sysCCOptionFontOpacity = ["افتراضي","خالص","وميض","نصف شفاف","شفاف"];	
var contactUsOption = ["اتصل بنا",    "يرجى الإتصال بنا إذا كنت تواجة مشاكل فى تشغيل الجهاز.",    "إتصل بنا",    "موقع الويب: يرجى زيارة",    "رقم خدمة العملاء:","معلومات المنتج","اسم الطراز:",    "إصدار البرنامج:","","معرّف المستخدم:","معرّف المشروع:",    "نوع العميل:","عنوان MAC اللاسلكي:","عنوان MAC السلكي:","Netflix ESN:","ابحث عن المعلومات على هاتفك الخلوي.",    "ثم حدد بلدك."];
var homePageWords = ["السجل", "بحث"];	
var titlePageWords = ["الرئيسية", "مقاطع الفيديو","التليفزيون","التطبيقات"];	
var videosPageWords = ["فيلم", "رياضة","موسيقى","شائع","ألعاب","تعليم","اخبارى"];	
var statusPageWords = ["USB","الإعدادات","WiFi","سلكي"];	
var searchPageWords = ["بحث", "عمليات البحث الشائعة:","برامج، أفلام، أشخاص..."];	
var resultSearchPageWords = ["نتائج حول"," ","يرجى تجربة كلمات مفتاحية أخرى.","عذرا، لم يتم العثور على أي فيديو"," "];	
var historyPageWords = ["السجل", "ضغط","لحذف السجل","حذف واحد","حذف الكل","أمس","اليوم","لم تشاهد أي مقطع فيديو حتى الآن.","تم حذف سجل المشاهدة بنجاح!"];	
var channelPageWords = ["عفوًا، لم يتم العثور على مقاطع فيديو حتى الآن."];	
var virtualRemoteValues = ["1","2","3","4","5","6","7","8","9",                          "تصغير","0","تكبير",                          "خروج","0","",                          "قائمة","0","نص",                          "الدليل","إدخال","خروج",                          "قائمة","الترجمة","Info",                          "إيقاف",                          "Info","قائمة","خروج",                          "خروج"                          ];	
var sportsModeInitReminds = ["يستخدم هذا المعالج لإعداد محرك أقراص USB لوضع الرياضة. يرجى تحديد وضع الإعداد.", "يرجى تحديد حجم الملف لوضع الرياضة.", "إنشاء ملف لوضع الرياضة", "سرعة محرك أقراص USB بطيئة للغاية (< ‎%f ميجابايت/ثانية) بالنسبة إلى ميزة وضع الرياضة.", "محرك أقراص USB جاهز لوضع الرياضة. لكننا ننصح بتغييره (إلى سرعة > ‎ %f ميجابايت/ثانية) للاستماع بأداء أفضل.", "محرك أقراص USB جاهز لوضع الرياضة."];	
var sportsModeExtra = ["هل ترغب في إيقاف وضع الرياضة، وتغيير القناة؟","هل ترغب في إيقاف وضع الرياضة، وتغيير المصدر إلى جهاز متصل بمدخل SCART؟","هل ترغب في إيقاف وضع الرياضة، وتغيير المصدر إلى جهاز متصل بمدخل HDMI؟","وضع الرياضة غير مدعوم على قناة متداخلة.","هل ترغب في إيقاف وضع الرياضة، والدخول إلى EPG؟","هل ترغب في إيقاف وضع الرياضة، والدخول إلى الوسائط؟","هل ترغب في إيقاف وضع الرياضة، وتغيير مصدر الإدخال؟","سيوقف التلفاز وضع الرياضة الحالي. هل ترغب في الإنهاء؟"];	
var remoteControlNote = "قد تختلف وحدة (وحدات) التحكم عن بُعد المرفقة مع الجهاز وفقًا للطراز.";	
var textArray = ["مستوى الصوت","قناة","المصدر","التشغيل/الطاقة","الدليل","إيقاف التشغيل بعد ثواني"];	
var guideArray = ["VOL-","VOL+","قناة-","قناة+","السابق","التالي"];	
var favChannelListRemind = ["لا توجد قنوات مفضلة. يرجى الذهاب إلى قوائم أخرى واستخدام \"المفتاح الأخضر\" لإضافة القنوات المفضلة لديك."];	
var proxySetting = ["إعدادات البروكسي","البورت"];	
var powerOffShop = ["يوصي لك استخدام وضع المتجر، سوف تفعل؟"];	
var tcastTextPageWords = ["تتوفر مجموعة كبيرة من الفيديوهات والتطبيقات","يمكنك التحكم بها بسهولة باستخدام وحدة التحكم عن بُعد","كما يمكنك مشاركة المحتويات المميزة على الشاشة الكبيرة."];	
var tcastOtherWords = ["امسح رمز QR ونزل تطبيق T-Cast","الشبكة متصلة بالتلفاز","اسم التلفاز","‎T-Cast"];	
var hbbtvWords = ["اعدادات HbbTV","HbbTV","ملفات تعريف الارتباط","ملفات تعريف ارتباط الطرف الثالث","Device ID","تتبع"];	
var hbbtvTrackingWords = ["موافق","لا","لا تهتم"];	
var eStickerTipWords = ["Storage is under 400M,would you like to delete the videos in Demo mode bo obtain more space?"];
var delEstickerVideoRemid = ["The video has been deleted successfully"];	
var clockPageWords = ["Local","Beijing","Tokyo","Hongkong","Taipei","سنغافورة","Paris","London","Moscow","New Delhi","Djakarta","New York","Rio","Press the \"OK\" key","It can not be added!"];	
var smartKeyWords = ["Wireless Display","Enjoy Music","مؤقت النوم","World Clock","Soundbar ready","WiFi","PVR","وضع الرياضة"];	
var recommendWords = ["Recommend"];	
var onlyListenRemindWords = ["Enter Audio Only Mode","Press any key except volume key to exit!"];
var selectSatRemind = "يمكنك تحديد 20 قمرًا صناعيًا كحد أقصى!";
var emailWord = "البريد الإلكتروني:";
var cookiePolicyTitle = "سياسة ملفات الارتباط –    خدمات التلفزيون الذكي على الإنترنت";
var cookiePolicyConditions = ["تحترم الشركة خصوصيتكم عند إستخدام التليفزيونات الذكية المُصَّنعة من قبيل الشركة وكذلك الخدمات التي تقدمها. وتستخدم العديد من المواقع الإلكترونية وخدمات الإنترنت الأخرى تقنية ملفات الارتباط، وسيقوم جهاز التليفزيون الذكي الخاص بكم بقبول ملفات الارتباط وتخزينها وإرسالها لضمان أن هذه المواقع والخدمات تعمل بشكل صحيح. كما تستخدم الشركة  تقنية ملفات الارتباط عند تقديم خدماتها إليكم. تقدم الشركة في هذه سياسة المتعلقة باستخدام ملفات الارتباط وصفاً لملفات الارتباط الموجودة على جهاز التليفزيون الذكي الخاص بكم وكيف يمكنكم إدارتها. \nبرجاء العلم أن جميع البيانات الشخصية التي تجمعها الشركة  و/أو تتولى معالجتها من خلال ملفات الارتباط أو بمساعدتها تخضع لسياسة الخصوصية، ويتعين عليكم قراءة سياسة استخدام تقنية ملفات الارتباط مع سياسة الخصوصية.\n1-	ما هو ملف الارتباط؟\nملفات الارتباط هي ملفات نصية صغيرة قد تُوضع على جهاز التليفزيون الذكي الخاص بكم. عندما يتم الدخول إلى موقع إلكتروني أو خدمة الزر الأحمر في أي محطة تلفزيون، قد يقوم الموقع الإلكتروني أو الخدمة  بتخزين ملف ارتباط في جهاز التليفزيون الذكي. وعند الدخول إلى الموقع أو القناة الخاصة بالمحطة بعد ذلك، يرسل ملف الارتباط المُخَّزن على جهازكم معلومات إلى الطرف الذي قام بوضع ملف الارتباط فيه. إن ملفات الارتباط شائعة إلى حد كبير وتستخدمها عدد من المواقع والخدمات. عادةً ما يضم كل ملف ارتباط النطاق الذي جاء منه الملف و\"مدة بقائه\"، ورقم (غالباً رقم مميز). ويمكنكم زيارة الرابط الآتي للحصول على شرح أكثر دقة عن ملفات الارتباط وكيفية عملها www.allaboutcookies.org.\nويمكن تصنيف ملفات الارتباط إلى ملفات ارتباط وظيفية وملفات ارتباط غير وظيفية. ملفات الارتباط الوظيفية عبارة عن ملفات ارتباط مطلوبة بشدة لغرض تقديم خدمات التليفزيون الذكي لكم وبالنسبة للمواقع الإلكترونية والخدمات الأخرى المحتوى الملائم للتلفزيون الذكي. ملفات الارتباط غير الوظيفية فهي تضم جميع ملفات الارتباط الأخرى.\nتتعلق سياسة ملفات الارتباط هذه بملفات الارتباط التي نتولى وضعها، وكذلك ملفات الارتباط الإعلانية التي قد يضعها طرف ثالث من خلال خدماتنا على جهاز التليفزيون الذكي الخاص بكم. ولا توجد ثمة علاقة بين سياسة ملفات الارتباط هذه وملفات الارتباط التي قد يتم وضعها عند استخدامكم خدمات التليفزيون الذكي للدخول إلى مواقع طرف ثالث أو خدماته أو تطبيقاته. فيما يخص ملفات الارتباط المذكورة، نحيلكم إلى سياسات ملفات الارتباط الخاصة بذلك الطرف الثالث. مع ذلك، فإن سياسة ملفات الارتباط هذه تقدم لكم شرحاً لطريقة حذف ملفات الارتباط تلك. (انظر القسم 4 أدناه)\n2- 	ما هي ملفات الارتباط غير الوظيفية التي نستخدمها؟\nالإعلان: من الممكن تقديم إعلانات داخل مقاطع الفيديو أو إعلانات عرض إلى جهاز التلفزيون الذكي الخاص بكم عند استخدام خدمات جهاز التليفزيون الذكي. من الممكن أن تكون هذه الإعلانات مقدمة من قِبلنا أو من قِبل طرف ثالث من خلال خادم الإعلانات الخاص بنا أو بالتنسيق معه، ويؤدي خادم الإعلانات دوراً تنسيقياً مركزياً فيما يتعلق بعرض مثل تلك الإعلانات. سيقوم خادم الإعلانات الخاص بنا أو خادم الإعلانات الخاص بالطرف الثالث بوضع ملفات ارتباط على جهاز التليفزيون الذكي الخاص بكم. عن طريق ملف الارتباط هذا، سيسجل خادم الإعلانات المعلومات الخاصة بما إذا تم عرض إعلان على جهاز التلفزيون الذكي الخاص بك أو ما إذا نقر شخص ما يستخدم جهاز التلفزيون الذكي الخاص بك على الإعلان. إننا نستخدم المعلومات المحفوظة في ملف الارتباط الإعلاني ذلك لتذَكُّر الإعلانات التي عُرضت على جهاز التلفزيون الذكي الخاص بكم، لكي نستطيع ضمان عدم عرض العديد من الإعلانات نفسها على أي جهاز تليفزيون ذكي بعينه، ولكي نتمكن من تسوية اتفاقياتنا التجارية مع شركائنا الإعلانيين. إننا لن نقوم بإستخدام هذه المعلومات لعرض إعلانات مستهدفة. علاوة على ذلك، يجوز للطرف الثالث استخدام نظامنا الإعلاني لتقديم إعلانات على جهاز التلفزيون الذكي الخاص بكم ووضع ملفات ارتباط على جهازكم عند عرض مثل تلك الإعلانات.\nتتضمن ملفات الارتباط هذه، ضمنه أمور أخرى، معلومات حول الإعلانات المعروضة، ومعلومات حول أي تطبيق أو نطاق يتم عرض مثل تلك الإعلانات عليه، وعنوان بروتوكولات الإنترنت الخاص بكم، بالإضافة إلى معلومات أخرى. يتم هذا بغرض تذكُّر عدد المرات التي يُعرض فيها إعلان بعينه، ولتجنب عرض الإعلان ذاته لعدد مرات زائد عن الحد. يجوز للمعلنين الخارجيين من الطرف الثالث قد يضعون إعلانات لهم أن يستخدموا ملفات الارتباط لتتّبع نشاطهم عبر المواقع الإلكترونية المتعددة ولعرض إعلانات تتوافق مع تفضيلاتك الشخصية.\n3- 	المواقع الإلكترونية الخاصة بطرف ثالث\nعندما تزور المواقع الإلكترونية أو خدمات طرف ثالث من خلال خدمات التليفزيون الذكي المتاحة على جهازك، من المحتمل أن تضع مثل تلك المواقع أو الخدمات ملفات ارتباط على جهاز التليفزيون الذكي الخاص بكم، وأن تتعقب مثل تلك المواقع تفاعلك عليها وتخزَّنه. نحن لا نطلب هذه الأنشطة ولا نشجعها ولن نستخدم مثل تلك المعلومات. يرجى الرجوع إلى سياسات الخصوصية وملفات الارتباط الخاصة بتلك المواقع والخدمات للمزيد من المعلومات حول استخدام تلك الأطراف لملفات الارتباط تلك.\n4-	حذف ملف إرتباط\nتتيح لك واجهة المستخدم في جهاز التليفزيون الذكي الخاص بكم حذف جميع ملفات الارتباط وغيرها من ذاكرة المتصفح الخاصة بكم من جهاز التلفزيون الذكي. ننصحكم بشِّدة بحذف جميع ملفات الارتباط والإعدادات المخزنة في جهازكم قبل بيع الجهاز أو التخلي عنه.\n5-	التواصل معنا\nإذا كان لديكم أي أسئلة أو ملاحظات بشأن سياسة ملفات الارتباط الخاصة بنا أو استخدامنا لتقنية ملفات الارتباط، يمكنكم مراسلتنا عبر البريد الإلكتروني على service.support@tcl.com\nالنسخة: 1.0 \n"];
var privacyPolicyTitle = "سياسة الخصوصية – خدمات التلفزيون الذكي على الإنترنت";
var privacyPolicyConditions = ["نحن نحترم خصوصيتك عند التعامل مع بياناتك الشخصية. إن سياسة الخصوصية هذه تصف الهيئة المسؤولة عن تجميع ومعالجة واستخدام البيانات الشخصية التي نحصل عليها منك فيما يتعلق باستخدام خدمات التلفزيون الذكي الخاصة بنا (\"الخدمات\")، ماهي أنواع البيانات الشخصية التي نجمعها عنك وما نفعله بها وحقوقك فيما يتصل باستخدامنا للبيانات الشخصية.\n1-	وحدة التحكم في البيانات\nيتم جمع، معالجة واستخدام بياناتك الشخصية التي يتم جمعها منك عند استخدام الخدمات من قبل شنزهن تي سي إل نيو تكنولوجي كومباني ليمتد رقم 5، اندستريال افنيو (م)، بمنطقة شيكو الصناعية، بمدينة شنزهن، مقاطعة جوانجدونج، الصين (\"الشركة\"). يُرجى ملاحظة، مع هذا، أننا غير مسؤولين عن كافة أنشطة معالجة البيانات الموضحة أدناه. إلا أننا أدرجنا وصفاً لتلك الأنشطة في سياسة الخصوصية الخاصة بنا لأن هذه المعالجة تتصل باستخدامك للتلفزيون الذكي.\n2-	الموافقة على معالجة البيانات\nيتطلب جمع بعض بياناتك الشخصية، معالجتها أو استخدامها موافقتك.\nإذا وافقت على استخدام بياناتك الشخصية لغرض تحسين الخدمات، فموافقتك تكون بالصياغة التالية:\n\"أوافق على جمع ومعالجة واستخدام توقيت فتح جهازي وقائمة قنوات التلفزيون الرقمية وقائمة القنوات المفضلة وأوقات الزيارة والقنوات التي تتم مشاهدتها لأغراض تحليل عادات المستخدم لتحسين الخدمات و/أو لتحليل كم عدد مستخدمي الشركة عبر الإنترنت في اليوم/الشهر/السنة ولمشاركة هذه المعلومات مع محطات التلفزيون.\"\nإذا وافقت على استخدام بياناتك الشخصية للإعلانات المصممة لاهتماماتك، فتكون لموافقتك الصياغة الآتية:\n\"أوافق على جمع نوع العميل الخاص بي والدولة ومعالجتهما واستخدامها لغرض استلام إعلانات ملائمة.\"\nتعد الموافقك اختيارية وستظل قادراً على الاستفادة من الخدمات إذا لم توافق. إلا أنه يُمكن أن ترى إعلانات ومحتوى آخر غير مصممة لتفضيلاتك. بغض النظر عن موافقتك، تحتفظ الشركة بالحق في جمع البيانات أعلاه ومعالجتها وإستخدامها للحد الذي يسمح به القانون المعمول به.\nيجوز لك سحب موافقتك على أيٍ من المذكور أعلاه مستقبلاً في أي وقت. يُمكنك الاعتراض على استخدام بياناتك الشخصية في التسويق أو في أبحاث السوق والآراء أو تصميم الخدمات لاحتياجاتك. من أجل سحب موافقتك و/أو الاعتراض عليها، يُرجى تغيير إعدادات الخصوصية في جهاز تلفازك الذكي وفقاً لذلك.\n3-	البيانات الشخصية المُجمعة\nبغض النظر عن موافقتك، تجمع الشركة وتعالج وتخزن وتستخدم البيانات من الفئات التالية:\nمُعرٍف الجهاز: يُخزٍن تلفزيونك الذكي رقم مميز ثابت يُمكننا من التعرف عليه وتوثيقه متى استخدمت الخدمات. ويُطلق على هذا الرقم مُعرف الجهاز. سيتم توفير مُعرف الجهاز لشريك الخدمة لتقديم الخدمات لك. نقدم كذلك معرف الجهاز لشركاء في المحتوى محددين لأغراض التوثيق. يستخدم شركاء المحتوى معرف الجهاز لتوثيق تلفزيونك الذكي للوصول إلى الخدمات التي يقدمها شريك المحتوى.\nعنوان برتوكول الإنترنت وعنوان ماك: سَيُخصص لتلفزيونك الذكي عنوان لبتروكول الإنترنت عند الدخول على الإنترنت. يُحال إلينا عنوان البروتوكول ونعالجه في كل مرة يطلب فيها التلفزيون الذكي معلومات أو بيانات من الخدمات. إذا كان تلفزيونك الذكي خلف جهاز توجيه (على سبيل المثال شبكة محلية أو شبكة لاسلكية محلية في المنطقة)، فمن الممكن أن نحصل على عنوان برتوكول الإنترنت لجهاز التوجيه ذلك ونعالجه. عنوان ماك هو رقم مميز مخصص لكل واجهة شبكة لتلفزيونك الذكي. سنحصل على عنوان ماك ونعالجه عندما يطلب التلفزيون الذكي معلومات أو بيانات من الخدمات.\nبيانات طلب الخدمة: كلما قمت بتوصيل تلفزيونك الذكي بالإنترنت وتشغيل التلفزيون، فسيتصل أوتوماتيكاً بالخدمات والتي يُديرها شريك الخدمة لدينا. سيُوثق تلفزيونك الذكي حينها كجهاز معتمد للدخول إلى الخدمات. لأغراض التوثيق، تُخزن الخدمات واحداً أو أكثر من المعرفات الرقمية المميزة المتعلقة بتلفزيونك الذكي. عند التوصيل بالخدمات، سوف ينقل التلفزيون الذكي عنوان برتوكول الإنترنت المخصص له وينقل معلومات جهاز معينة (موديل التلفزيون الذكي وإصدار البرنامج) لبحث ما إذا كانت تحديثات البرنامج متوفرة.\nإعدادات الخدمة: يُمكنك تنظيم الترتيب الذي يتم فيه عرض التطبيقات من قبل الخدمات يدويًا كجزء من الوظائف العادية للخدمات. سيُخزن شريك الخدمة لدينا الترتيب الخاص بك والتفضيلات الأخرى التي قد تقوم بإعدادها أثناء استخدام الخدمات. ستكون هذه المعلومات متصلة بمُعرف الجهاز.\nمعلومات خاصة بالجهاز: يخزن التلفزيون الذكي العديد من المعلومات عنه وعن تكوينه. تتضمن هذه المعلومات نوع التلفزيون الذكي وإصدار  نظام التشغيل للتلفزيون الذكي ومستوى دقة اللوحة ومُعرف المشروع (أي المعلومات المتعلقة بملفات التكوين) ووكيل المستخدم واسم المتصفح وإصدار المتصفح واللغة والدولة التي تم إعدادها في التلفزيون الذكي. سنستخدم هذه المعلومات وسنوفرها لشريك الخدمة وشركاء المحتوى الخاصين بنا.\nالإعلان: يجوز للخدمات تقديم الإعلانات. نقدم نحن هذه الإعلانات أو تقدمها أطراف ثالثة باستخدام مخزون الإعلانات الذي نحدده. تُقدم كافة الإعلانات عن طريق خادم الإعلانات أو من خلاله والذي يقوم بدور تنسيقي في تقديم الإعلانات. يجوز لخادم الإعلانات الخاص بنا أو بطرف ثالث أن يقوم بإعداد ملف تعريف الارتباط بالتلفزيون الذكي. يُرجى الرجوع إلى سياسة تعريف ملفات الارتباط لمزيد من المعلومات بشأن ملفات تعريف الارتباط هذه.\nالخدمة وحركة سير شريك المحتوى: عند استخدامك للخدمات، سيطلب تلفزيونك بيانات من الخدمات عبر الإنترنت. كجزء من هذه الطلبات، عنوان بروتوكول الإنترنت كما هو موضح أعلاه كما سيتم نقل اللغة والدولة التي أُعدت على تلفزيونك الذكي إلى شريك المحتوى الخاص بنا. سيعالج شريك المحتوى لدينا البيانات ذات الصلة وفقاً لسياسة الخصوصية الخاصة به.\nاستخدام الشاشة الثانية: إذا استخدمت تطبيق الشاشة الثانية الخاصة بنا، ستجمع وتعالج أجهزة الخوادم لدينا الضوابط التي تقوم بتفعيلها على التطبيق والدولة وإعدادات اللغة وقائمة قنوات التلفزيون الرقمية وقائمة القنوات المفضلة وقوائم الجدول الزمني ومُعرف الجهاز والقناة الحالية وإصدار البروتوكول وعنوان بروتوكول الإنترنت الخاصين بتلفزيونك الذكي. ستقوم أجهزة الخوادم لدينا بالتحكم بتلفزيونك الذكي كما توجه أنت في تطبيق الشاشة الثانية.\nتلفزيون البث الهجين ذو الحزم العريضة – \"الزر الأحمر\": يجوز لمحطات التلفزيون (\"المحطات\") أن تُرسل معلومات إضافية من خلال إشارتهم التلفزيونية. إذا استلم التلفزيون الذكي تعليمات محددة في مثل تلك المعلومات الإضافية وإذا كان التلفزيون مُتصل بالإنترنت، فسيقوم التلفزيون بتحميل صورة أو صفحة صغيرة من الموقع الإلكتروني للمحطة ويعرضها مع المعلومات لتضغط على \"الزر الأحمر\" في جهاز التحكم الخاص بك إذا كنت تريد استخدام خدمات إضافية من التي تقدمها المحطة. يحدث هذا في كل مرة تقوم فيها بالحذف. سيحول التلفزيون الذكي عند تحميل الصورة من موقع المحطة بعض البيانات الشخصية، أي قائمة قنوات التلفزيون الرقمية والقناة الحالية وجدول معلومات الحدث ووقت التلفزيون وعنوان بروتوكول الإنترنت الخاص بتلفزيونك الذكي وملفات تعريف الارتباط المُخزنة على تلفزيونك الذكي (إن وُجدت). تُعد المحطة مسؤولة عن تجميع هذه البيانات ومعالجتها و/أو استخدامها. إضافةً إلى ذلك، يجوز للمحطة جمع بيانات شخصية أخرى عنك إذا استخدمت الخدمات الإضافية التي تقدمها المحطة من خلال الزر الأحمر (مثل مقاطع الفيديو التي تشاهدها عند الطلب والأخبار التي تقرأها وما إلى ذلك).\n4-	الأغراض التي نعالج بياناتك الشخصية و/أو نستخدمها من أجلها\nنحن نعالج البيانات المُجمعة للأغراض التالية:\n•	تقديم الخدمات: نستخدم عنوان بروتوكول الإنترنت وعنوان ماك ومُعرف الجهاز وإصدار نظام تشغيل التلفزيون الذكي ونوع عميل تلفزيونك الذكي ومستوى دقة لوحته ومعرف المشروع (أي المعلومات المتعلقة بملفات التكوين) وقائمة القنوات الرقمية الخاصة بك والقنوات التي شاهدتها والمنطقة الزمنية والدولة وإعدادات اللغة ليوفر لتلفزيونك الذكي الدخول إلى الخدمات والخدمات التي يقدمها شركاء المحتوى. تتضمن الأغراض، (على سبيل المثال لا الحصر)، التوثيق وتقديم خدمات قائمة على الموقع (مثلاً: توقعات الطقس)؛ وإساءة المعاملة والتعامل مع الحوادث الأمنية ورصد توافر الخدمات وتقديم خدمات النسخ الاحتياطي من تفضيلات المستخدم.\n•	التوثيق: نستخدم عنوان بروتوكول الإنترنت وعنوان ماك لأغراض التوثيق.\n•	تحديثات البرامج: في كل مرة يتم فيها تشغيل تلفزيونك الذكي، سيزودنا بعنوان بروتوكول الإنترنت ومعرف الجهاز وإصدار البرنامج ونوع عميل تلفزيونك الذكي ومُعرف المشروع (أي ملفات التكوين) ومُعرف المستخدم والرقم التسلسلي لتزويدك تحديثات البرامج المناسبة.\n•	تحسين الخدمات: نستخدم بيانات الاستخدام المجمعة ومجهولة المصدر (أي البيانات المتعلقة بتفاعلك مع الخدمات) لتحسين انطباع المستخدم عن الخدمات.\n•	عرض الإعلانات: نستخدم المعلومات في ملفات تعريف الارتباط الخاصة بالإعلان للسماح للنظام بالدخول على أي من الإعلانات التي عرضت على تلفزيونك الذكي لضمان عدم تلقيك الكثير من الإعلانات المتشابهة ونكون قادرين على تسوية ترتيباتنا التجارية مع شركاء الإعلانات لدينا. يُمكن للمعلنيين الخارجيين اللذين يعرضون الإعلانات على الخدمات أو مواقع شركاء المحتوى بعد التنسيق مع خادم الإعلانات لدينا استخدام ملفات تعريف الارتباط لتتبعك عبر المواقع الإلكترونية المتعددة وعرض الإعلانات التي تعكس تفضيلاتك الشخصية.\n•	تحسين الإعلانات: نستخدم البيانات المتعلقة بمشاهدات الإعلان والنقرات على الإعلانات لتحسين تجربة الإعلان للمستهلكين في الخدمة.\n•	الخصومات: نوفر معرف الجهاز لشركاء محتوى مختارين لتمكين هؤلاء الشركاء من التعرف على إلى أي حد يُمكنهم توفير دخول مجاني لك على عناوين مقاطع فيديو عند الطلب من باقتهم.\n•	إنفاذ القانون: قد يُطلب منا تقديم معلومات لجهات تطبيق القانون المختصة أو للمحاكم. وإذا قمنا بذلك، فسنقوم به فقط بمقتضى صك قانوني مُلزم مثل مذكرة أو حكم قضائي والذي يطلب منا التعاون مع الجهات ذات الصلة.\nيمكن استخدام الخدمات بأسماء مستعارة إلا إذا تطلبت خدمات معينة تقديم اسمك و/أو عنوان بريدك الإلكتروني.\n5-	فئات المستلمين \nتُشارك الشركة  بياناتك الشخصية المجمعة خلال استخدامك للخدمات مع الأطراف الثالثة التالية فقط:\n•	مع الأطراف الثالثة من موردي خدمات التلفزيون الذكي إذا طلبت أنت مثل تلك الخدمات (مثال أن تبدأ تشغيل تطبيق النتفليكس على تلفزيونك الذكي، يجوز لنا مشاركة عنوان بروتوكول الإنترنت وعنوان ماك وإصدار البرنامج واسم موديل التلفزيون مع نتفليكس).\n•	مع شركاء محتوى طرف ثالث، في حال ما إذا طلبت محتوى معين يقدمه شركاء المحتوى هؤلاء (مثال لكي يُقدم لك خدمة تلفزيون جوليف أي بي، فقد نشارك نوع عميل تلفزيونك وعنوان بروتوكول الإنترنت وإعدادات اللغة مع الجهة القانونية التي تقدم خدمة جوليف).\n•	إلى الحد الذي وافقت عليه في مشاركة بيانات شخصية معينة مع الأطراف الثالثة أعلاه، تشارك الشركة بياناتك الشخصية مع الأطراف الثالثة المذكورة تلك.\n•	مع مزودي خدمة من مصادر خارجية كمعالجين للبيانات لمساعدة الشركة في تقديم الخدمات.\nتُشارك الشركة بياناتك الشخصية مع الغير فقط في حال كانت مضطرة لذلك على أساس المتطلبات القانونية (مثال المحكمة أو سلطات الإدعاء الجنائي)، فقد وافقت على المشاركة المعنية أو أن تكون المشاركة قانونية بموجب القانون المعمول به.\n6-	الدول التي ستُعالج فيها 	بياناتك\nقد تقع الشركة و/أو بعض من مستلمي بياناتك الشخصية الموضحين أعلاه خارج المنطقة الاقتصادية الأوروبية (أي الدول التالية: جمهورية الصين الشعبية والولايات المتحدة الأمريكية). ولذلك يُمكن لبياناتك أن تُعالج في دول لا يُعترف بأنها توفر مستوى كاف من الحماية للبيانات الشخصية وفقاً لتوجيه البرلمان والمجلس الأوروبي/46/95 ئي سي بتاريخ 24 أكتوبر لعام 1995 بشأن حماية الأفراد فيما يتعلق بمعالجة البيانات الشخصية وحرية تحرك مثل تلك البيانات.\n7-	حقوقك\nيُمكنك التواصل مع الشركة  لتلقي معلومات حول بياناتك الشخصية التي تعالجها الشركة و/أو لممارسة حقوقك القانونية بشأن الدخول على بياناتك الشخصية وتصحيحها وحذفها ومنعها. و/أو الاعتراض على معالجة بياناتك لأغراض التسويق و/أو البحث التسويقي وأبحاث الرأي.\n8- 	التغييرات التي تطرأ على سياسة الخصوصية\nلتحسين خدماتنا، يجوز أن نطلب إدخال تعديلات على سياسة الخصوصية هذه، على سبيل المثال عن طريق تنفيذ تقنيات جديدة أو تقديم خدمات جديدة. إننا نحتفظ بالحق في تغيير سياسة الخصوصية أو الإضافة إليها في أي وقت.\n9-	بيانات الاتصال\nإذا كان لديكم أي أسئلة حول سياسة الخصوصية أو ترغبون في التقدم بشكوى بشأن تعاملنا مع بياناتكم الشخصية، يرجى التواصل معنا عن طريق إستخدام أي من وسائل الإتصال التالية:\nالبريد الإلكتروني: \nservice.support@tcl.com \nالنسخة: 1.0\n"];
var privacyPolicyTerms = [
    "تمكين خدمة التلفاز الذكي",
    "أوافق على تجميع ومعالجة واستخدام وقت تشغيل جهازي، وقائمة قنوات التلفاز الرقمي، وقائمة القنوات المفضلة، ووقت الزيارة، والقنوات التي تمت مشاهدتها لأغراض تتعلق بتحليل عادات المستخدم من أجل تحسين الخدمات و/أو تحليل عدد مستخدمي TCL على الشبكة في اليوم/الشهر/العام ولمشاركة هذه المعلومات مع محطات التلفاز.",
    "تمكين خدمة التوصية.",
    "تمكين تطبيق الشاشة الثانية لأجهزة المحمول",
    "تمكين تحديثات البرنامج التلقائية.",
    "تمكين خدمة FreeviewPlay."
];
var privacyPolicyTips = [
    "سيتم تعطيل جميع خدمات التلفاز الذكي.",
    "يتم توفير خدمة HbbTV من خلال قنوات التلفاز عند تعطيل استخدام الموالف المدمج.",
    "سيتم تعطيل المحتوى وخدمة التوصية ببرنامج تلفاز.",
    "سيتم تعطيل تطبيق الشاشة الثاني.",
    "لن يبحث التلفاز تلقائيًا عن وجود تحديثات ووظائف جديدة للبرنامج.",
    "سيتم تعطيل محتوى FreeviewPlay."
];
var privacyPolicyRemind = "يرجى وضع علامة في خانة الاختيار المقابلة في الإعداد.";
var set = "تعيين";
var copyShopDemoTips = ["متصل بـ USB، هل ترغب في نسخ مقطع الفيديو إلى القرص المحمول؟","نسخ مقطع الفيديو إلى القرص المحمول","تم نسخ الفيديو بنجاح!","حدث خطأ أثناء نسخ مقطع الفيديو!"];
var activateTVWords = ["تفعيل تلفازك","يرجى إدخال رمز التحقق.","استمتع بالمزيد من الخدمات بعد تفعيل تلفازك.","امسح رمز QR ضوئيًا للحصول على رمز التحقق.","يمكنك أيضًا الحصول على رمز التحقق كما يلي:","اتصل على الرقم 1800588880،  ومن ثم أدخل الرقم التسلسلي للحصول على رمز التحقق.","مركز العملاء","يرجى تسجيل المعلومات، وستحصل على خدمة الضمان."];
var dataDeletionWords = ["حذف بيانات خدمة التلفاز الذكي الخاصة بك من خوادم الواجهة الخلفية.","ملاحظات: سيتم حذف البيانات المتعلقة بمستخدم التلفاز الذكي الخاص بك في غضون شهر واحد بعد تحديد هذا العنصر. يرجى ملاحظة أن الحذف لا يؤثر على البيانات المحلية المُخزنة في تلفازك.","لم يعد يتم إرسال تقرير بالبيانات إلى خادم تلفازك الذكي.","ملاحظات:  لن يتم بعد ذلك إرسال بياناتك المتعلقة باستخدام خدمات التلفاز الذكي إلى الخادم بعد تحديد هذا العنصر. لن يتلقى تلفازك الخدمات الموصى بها.","إذا كنت ترغب في معرفة المزيد، يرجى زيارة موقع الويب www.tcl.eu"];
var miracastWords = ["اتصال لاسلكي","مشاركة محتوى هاتف أندرويد على التلفاز","انقر للاتصال","لا تتوفر هذه الوظيفة إلا على هاتف يعمل بنظام تشغيل أندرويد"];
var miracastTips = ["خطوات التوصيل","فتح إعدادات النظام","المزيد من طرق الاتصال \n / اتصالات لاسلكية أخرى","اختر العرض اللاسلكي","انقر للاتصال \n قيد انتظار العثور عليه"];
var eWarrantyCardWords=["E-warranty Card","The date of activation:"];