
var all_country 	= ["Αυστραλία","Αυστρία ","Βέλγιο","Βουλγαρία","Κροατία","Τσεχία","Δανία","Φινλανδία","Γαλλία","Γερμανία",
						"Ελλάδα","Ουγγαρία","Ιταλία","Λουξεμβούργο ","Ολλανδία","Νορβηγία","Πολωνία","Πορτογαλία","Ρουμανία","Ρωσία",
						"Σερβία","Σλοβενία","Ισπανία","Σουηδία","Ελβετία ","Ηνωμένο Βασίλειο","Νέα Ζηλανδία"," "/*Arab*/,"Εσθονία"," "/*Hebrew*/,
						"Λετονία","Σλοβακία","Τουρκία","Ιρλανδία","Japan","Φιλιππίνες","Thailand","Maldives","Uruguay","Peru",
    					"Argentina","Chile","Venezuela","Ecuador","Costa Rica","Paraguay","Bolivia","Belize","Nicaragua","Guatemala",
						"Κίνα","Taiwan","Brazil","Canada","Mexico","United States","South Korea","Ρουμανία","Vietnam"/*新添加的，底层结构体中没有*/,"Ουκρανία"/*新添加的，底层结构体中没有*/,
    					"Iran","Iraq"," ","Kazakhstan","Uzbekistan"," ","Kyrgyzstan","Algeria","Egypt","Tunisia",
   						"Tanzania","Kenya","Pakistan","Indonesia","Kuwait","Saudi Arabia","Qatar","Israel","Lebanon","bahrain",
    					"Angola","Congo","India","Turkmenistan","Colombia","Mongolia","Bangladesh","Nepal","Sri Lanka","North Korea",
						"Μολδαβία","Polynesia","EI Salvador"," ","Fiji","Liberia","Jordan","Myanmar","Ghana","Georgia",
    					"Armenia","Oman","yemen","Syria","Palestine","Afghanistan","Morocco","benin","IvoryCoast","Nigeria",
    					"Sudan","Ethiopia","Zambia"," ","South Africa","mozambique","Libya","Αλβανία","Belarus","Iceland",
						"Λιθουανία","Mauritius","Dubai","UAE","Tajikistan","Bengal","Βοσνία-Ερζεγοβίνη","Κύπρος","Κόσσοβο","ΠΓΔΜ",
						"Μάλτα","Μαυροβούνιο","Cameroun","Singapore","Malaysia","NewCaledonia","Suriname","Jamaica","Curacao","Aruba",
						"Antigua & Barbuda","St Lucia","Barbados","St Vincent","St Kitts & Nevis","Grenada","Trinidad & Tobago","Guyana","Puerto Rico","Panama",
    					"Dominica","Cuba","Honduras","Haiti","Cambodia","Zimbabwe","Dominican Republic","Bonaire","Somalia","Azerbaijan",
    					"Uganda","Rwanda","Guinea","Burundi","Abkhazia","Andorra","Anguilla","Antarctica","American Samoa","Aland Island",
    					"Burkina-faso","Bermuda","Brunei","Caribbean Netherlands","Saint Barthélemy","Bahamas","Bhutan","Bouvet Island","Botswana","Cocos (Keeling) Islands",
    					"Central African Republic","Cape Verde","Djibouti","Eritrea","Western Sahara","Falkland Islands","Federated States of Micronesia","Faroe Islands","Gabon","Cook Islands",
    					"Gibraltar","Greenland","French Guiana","Guadeloupe","Equatorial Guinea","Guam","Guinea-Bissau","Heard Island and McDonald Islands","Isle of Man","British Indian Ocean Territory",
					/*20*/"Jersey","Kiribati","Comoros","Cayman Islands","Liechtenstein","Lesotho","Monaco","Saint Barthélemy","Madagascar","Mali",
    					"Macao","Martinique","Mauritania","Montserrat","Malawi","Namibia","Niger","Norfolk Island","Nauru","Papua New Guinea",
    					"Pitcairn Islands","Palau","Reunion Island","Solomon Islands","Seychelles","The Svalbard archipelago","Sierra Leone","San Marino","Senegal","South Sudan",
    					"Sao Tome & Principe","Swaziland","Turks & Caicos Islands","Togo","Chad","Tokelau","Timor-Leste (East Timor)","Tonga","Tuvalu","Vatican City State",
    					"British Virgin Islands","United States Virgin Islands","Wallis and Futuna","Samoa","Mayotte","Democratic Republic of the Congo","Guernsey","Gambia","Northern Mariana Islands","French Southern Territories",
					/*25*/"Niue","United States Minor Outlying Islands","Others"];
				
var all_language 	= ["Τσέχικα","*","Δανέζικα","*","*","Γερμανικά","Αγγλικά","Γαλλικά","Ελληνικά","Ισπανικά",
						"Κροατικά","*","Ιταλικά","Ουγγαρέζικα","Ολλανδικά","Νορβηγικά","Πολωνικά","Πορτογαλικά","Ρώσικα","Ρουμανικά",
						"Σλοβένικα","Σερβικά","Φινλανδικά","Σουηδικά","Βουλγαρικά","Σλοβάκικα","Chinese","*","Κέλτικα","*",
						"Ουαλικά","Αραβικά ","Ιρλανδικά","Λετονικά","*","Τούρκικα","Εσθονικά","Ολλανδικά"/*Netherlands*/,"Κορεατικά","*",
						"Χίντι","*","*","Μανταρίνι","Καντώνα","Μαορί","Αρχικός ήχος"/*Qaa*/,"Μη προσδιορισμένο "/*Undetermined*/,"*","Άγνωστο",
						"Μη προσδιορισμένο ","*","*","*","*","*","*","*","*","*",
						"*","*","*","Αλβανικά","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","Βασκικά","*","*",
						"*","*","*","*","*","*","*","Βοσνιακά","*","*",
						"*","*","*","*","bělorusky","*","*","Καταλανικά","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Γαλικιακά","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Ισλανδικά","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","Ιαπωνικά","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Λιθουανικά",
						"*","*","*","*","*","*","*","Σλαβομακεδονικά","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Αισθηματικό","*","*","*","*",
						"*","*","*","Σάμη","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Teletext",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","Ουκρανικά","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","ChineseTraditional","*"];
var offOn			= ["Εκτός Λειτουρ.","Εντός Λειτουρ."];
var okCancel		= ["ΟΚ","Ακύρωση"];
var yesNo			= ["ΝΑΙ","ΟΧΙ"];
var level			= ["Εκτός Λειτουρ.","Χαμηλό","Υψηλός","Μεσαίο"];
var manualAuto		= ["Εγχειρίδιο","Αυτόματος"];
var homeShop		= ["Σπίτι","Κατάστημα"];
var picPreset		= ["Πρότυπο","Dynamic","Φυσική","Κινηματογράφος","Προσωπική"];
var picColorTemp	= ["Ψυχρό","Κανονικά","Θερμό","Χρήστης"];
var pic3dNavig		= ["Εγχειρίδιο","Αυτόματος","Ημιαυτόματα"];
var _3dOptions		= ["Λειτουργία 3D","3D σε 2D","Διακόπτης Α-Δ","Βάθος πεδίου"];
var pic3DMode       = ["Εκτός Λειτουρ.","2D σε 3D","Σε παράθεση","Μισό πάνω-Μισό κάτω","Εναλλαγή γραμμών"];
var picEcoOptions	= ["Εξοικονόμηση ενέργειας","Αισθητ. Φωτός","Τοπική βαθμ. εξασθένιση","Μικτή μείωση φωτεινότητας"];
var picGeoOptions	= ["Γεωμετρία","Ο. Θέση","Κ. Θέση","Ρολόι","Φάση"];//Geometry 无翻译
var picAdWhiteBal	= ["Έμφαση R","Έμφαση G","Έμφαση B","Αντιστάθ. R","Αντιστάθ. G","Αντιστάθ. B"];
var souOptions		= ["Επαναφορά ηχητ. Ρυθμίσεων","Ισορροπία","Καθυστέρηση ήχου","SRS TSHD","Αυτόμ. ρύθμ. έντασ.",
						"Τύπος SPDIF","SPDIF Καθυστέρηση","Τοποθέτηση τηλεόρασης","Γλώσσα ήχου","Ηχητικό κανάλι",
						"Ηχητική περιγραφή","Ενίσχυση μπάσων","Dolby Digital Plus"];
var souSpdifType	= ["Αυτόματος"/*Dolby*/,"PCM","Εκτός Λειτουρ."];
var colorSpace      = ["Αυτόματος","Εγγενής","Χρήστης"];
var souPresetPara	= ["100Hz","500Hz","1.5KHz","5KHz","10KHz"];
var chOptions		= ["Σάρωση Καναλιού","Λίστα καναλιών","EPG","Οργάνωση καναλιών","Διαγνωστικός έλεγχος καναλιού",
						"χρον. μετατόπιση","Υπότιτλοι","Teletext","Τύπος λίστας καναλιών"];//Channel diagnostics 、Channel organizer 无翻译
var chDiagOptions	= ["Ισχύς Σήματος","Ποιότητα Σήματος","Συχνότητα (KHz)","ID Συντήρησης","ID Δικτύου","Όνομα Δικτύου"];
var chScanOptions	= ["Χώρα / Περιοχή","Κατάσταση συντονισμού","Αυτόματη αναζήτηση","Αυτόματη ενημέρωση","Αναλ. χειροκ. σάρ.",
						["Χειροκίν. σάρωση καλωδ.","Χειροκ. Σάρωση Κεραίας","Μη αυτόμ. συντονισμός δορυφόρου"],"Ρύθμιση δορυφορικής κεραίας","Επιλογή αγαπημένου δικτύου","Εκκαθαρίστε τη λίστα καναλιών","LCN"];
var favNetDes		= "Επιλέξετε το αγαπημένο σας δίκτυο";
var tuner			= ["Καλώδιο","κεραία","Δορυφόρος"];//Satelite 无翻译
var passError		= "Λάθος κωδικός πρόσβασης.\nΕισάγετε ξανά!";
var chType			= ["Αναλογ. κανάλια: ","Ψηφιακά κανάλια: "];
var chScanStatus	= ["Κατάσταση: Σάρωση","Κατάσταση: Σάρωση ολοκληρώθηκε","Κατάσταση: Η σάρωση ακυρώθηκε","Κατάσταση: Σφάλμα σάρωσης"];
var chScanPara		= ["Συχνότητα (KHz)","Διαμόρφωση","Ρυθμός Μετάδ.  (Ksym/s)","ID Δικτύου","Σύστημα",
						"Μικρορύθμιση","Ισχύς Σήματος","Ποιότητα Σήματος","Λειτουρ. Σάρωσης","Αναγνωριστικό καναλιού"];
var chScanParaMHZ      = ["Συχνότητα (MHz)"];
var chAtvManSys		= ["ΔΥΤ. ΕΥΡ.","ΑΝΑΤ. ΕΥΡ.","ΗΒ","Γαλλία"];
var modulation		= ["16QAM","32QAM","64QAM","128QAM","256QAM","Αυτόματος"];
var chCleanDes		= "Θέλετε να καθαρίσετε τη λίστα καναλιών;";
var chDeletDes		= "Θέλετε να  διαγράψετε το κανάλι;";
var chOperator		= ["Ziggo","UPC","Άλλα"];
var chScanType		= ["Ψηφιακά & Αναλογικό","Ψηφιακά","Αναλογικά"];
var chScanMode		= ["Πλήρης","Μπροστά","Γρήγορο"];
var bookingModes	= ["Εγγραφή","Υπενθύμιση"];
var dayName			= ["Κυρ","Δευτ","Τρίτ","Τετ","Πέμ","Παρ","Σάβ"];
var monthName		= ["Ιαν.", "Φεβ.","Μάρ.","Απρ.","Μάιος","Ιούν.","Ιούλ.","Αύγ.","Σεπ.","Οκτ.","Νοέμ.","Δεκ."];
var filter			= ["Suodin","Τύπος","Υποκατηγορία"];
var chEpgFirstGenre	= ["Κινηματογράφος","News","Σόου","Σπορ","Παιδικά","Μουσική","Τέχνες","Κοινωνικά","Εκπαίδευση","Χόμπυ","ΕΙΔΙΚΟ"];
var chEpgSecondGenre= [["Δράμα","Αστυνομικό","Περιπέτεια","Επιστημονική φαντασία","Κωμωδία","Σαπουνόπερα","Αισθηματικό","Σοβαρό","Ταινία μόνο για ενηλίκους"," "," "," "],
						["Επικαιρότητα","Πρόβλεψη καιρού","Μαγκαζίνο επικαιρότητας","Ντοκιμαντέρ","Συζήτηση"," "," "," "," "," "," "," "],
						["Σόου","Τηλεπαιχνίδι","Βαριετέ","Τοκ σόου"," "," "," "," "," "," "," "," "],
						["Σπορ","Ειδικά συμβάντα","Αθλητικό μαγκαζίνο","Ποδόσφαιρο","Τένις",
							"Ομαδικά σπορ","Αθλητικά","Μοτοσικλέτα","Σπορ του νερού","Χειμερινά σπορ",
							"Ιππασία","Πολεμικά σπορ"],
						["Παιδικά","Παιδικό προσχολικής ηλικίας","Ψυχαγωγικό από 6 έως 14 ετών","Ψυχαγωγικό από 10 έως 16 ετών","Ενημερωτικό","Κινούμενα σχέδια"," "," "," "," "," "," "," "],
						["Μουσική","Rock","Σοβαρό","Παραδοσιακή","Τζαζ","Μιούζικαλ","Μπαλέτο"," "," "," "," "," "],
						["Τέχνες","Θεατρικές τέχνες","Καλές τέχνες","Θρησκεία","Λαϊκός πολιτισμός",
							"Λογοτεχνία","Ταινίες","Πειραματικό","Μετάδοσης (Broadcast)","Νέα μέσα επικοινωνίας",
							"Καλλιτεχνικό Μαγκαζίνο","Μόδα"],
						["Κοινωνικά","Περιοδικά","Οικονομικά","Αξιοσημείωτοι άνθρωποι"," "," "," "," "," "," "," "," "],
						["Εκπαίδευση","Φύση","Τεχνολογία","Ιατρική","Ξένες χώρες","Κοινωνικές επιστήμες","Συνεχή εκπαίδευση","Γλώσσες"," "," "," "," "],
						["Χόμπι","Τουρισμός","Χειροτεχνία","Αυτοκίνητα-μοτοσυκλέτες","Καλοζωία και υγεία","Μαγειρική","Διαφήμιση","Κηπουρική"," "," "," "," "],
						["Γλώσσα πρωτότυπου","Ασπρόμαυρο","Αδημοσίευτο","Ζωντανή μετάδοση"," "," "," "," "," "," "," "," "]];
var chOrganizer		= ["Παράλειψη καναλιού","Ταξινόμηση καναλιών","Επεξεργ. καναλιού","Διαγραφή καναλιού","ανταλλαγής κανάλι","κανάλι ένθετο"];
var chEditPara 		= ["Όνομα Δικτύου","Αριθμός καναλιού","Όνομα καναλιού","Συχνότητα","Σύστημα χρωμάτων","Σύστημα ήχου"];
var chSatTitles		= ["Τύπος δορυφόρου","Ρύθμιση δορυφορικής κεραίας","Επιλογή δορυφόρου"];
var chSatEidtOptions= ["Όνομα δορυφόρου","Θέση","LNB ισχύς","Συχνότητα LNB (MHz)","Είσοδος Diseqc",
						"Τόνος 22KHz","ριπή τόνου","Συχνότητα (KHz)","Ρυθμός Μετάδ.  (Ksym/s)","Πόλωση",
						"Ισχύς Σήματος","Ποιότητα Σήματος","Κατάσταση δορυφόρου"];
var chSatAutoPromt	= [["Όλα","Δίκτυο"],
						["Όλα","Δωρεάν"]];
var chSatAutoScanOptions=["Επιλογή δορυφόρου","Λειτουρ. Σάρωσης","Кανάλια"];
var chSatPosition	= ["A","B"];
var chSatLNBFreq	= ["Καθολικό",];
var chSatDiSEqCInput= ["Απενεργοποίηση","A","B","C","D"];
var chSatTone22KHz	= ["Αυτόματος","Εντός Λειτουρ.","Εκτός Λειτουρ."];
var chSatToneBurst	= ["Απενεργοποίηση","ριπή τόνου A","ριπή τόνου B"];
var chSatPolarization= ["Οριζόντια","Κατακόρυφη"];
var chSatSetupOptions=["Τύπος κεραίας","Τιούνερ","Ζώνη συχνοτήτων"];
var chSatAntennaType= ["Απλό καλώδιο","Καθολικό"];
var chSatUserBands	= ["Ζώνη χρήστη 1","Ζώνη χρήστη 2","Ζώνη χρήστη 3","Ζώνη χρήστη 4","Ζώνη χρήστη 5","Ζώνη χρήστη 6","Ζώνη χρήστη 7","Ζώνη χρήστη 8"];
var chSatOthers		= ["Αναμεταδότης"];
var chSatSetupOthers= ["Ορίζεται από το χρήστη"];
var pleaseSelectSat = "Επιλέξτε δορυφόρους πρώτα!";
var subOptions		= ["Υπότιτλοι","Γλώσσα ψηφ. υπότιτλων","2η Γλώσσα ψηφ. Υπότιτλων ","Τύπος υπότιτλων"];
var ttxOptionsCon      = ["Αποκωδ. Γλώσσας σελίδας ","Γλώσσα ψηφ. Teletext"];
var subType			= ["Κανονικά","Ασθενή Ακοή"];
var netIntf     	= ["Ethernet ","Ασύρματη"];
var netConnDes		= ["Η τηλεόραση δοκιμάζει τη σύνδεση δικτύου.\nΠεριμένετε",
						"Η δοκιμή σύνδεσης δικτύου ολοκληρώθηκε!",
						"Η δοκιμή σύνδεσης δικτύου απέτυχε."];
var netSsidError	= "Ένα έγκυρο όνομα SSID αποτελείται από 1 έως 32 χαρακτήρες. Ελέγξτε το SSID.";
var netOthers		= ["Κωδικός PIN   "];
var netWlessAutoDes	= ["Βεβαιωθείτε ότι ο παρακάτω κωδικός PIN είναι εγκατεστημένος στο Σημείο Πρόσβασης, πριν επιλέξετε OK.",
						"Πατήστε το κουμπί στο Σημείο Πρόσβασης εντός 120 δευτερολέπτων, πριν επιλέξετε OK."];
var netConnRemind	= ["Λάθος κωδικός πρόσβασης.",
						"Σύνδεση. Παρακαλώ περιμένετε!",
						"Επιτυχία σύνδεσης. Αποκτήθηκε IP!",
						"Αποτυχία συνδέσμου",
						"Η TV σαρώνει για ΣΠ. Παρακαλώ περιμένετε!",
						"Δεν υπάρχουν ασύρματες συσκευές συνδεμένες στην TV σας!"];
var netWireIpOptions= ["Ρύθμιση IP","Τύπος διεύθυνσης","Διεύθυνση IP","Μάσκα υποδικτύου","Προεπιλεγμένη πύλη","Πρωτεύων DNS","Δευτερεύων DNS"];
var netWireConnRemind= ["Εισάγετε μια τιμή μεταξύ 0 και 255.",
						"Συνδέθηκε με επιτυχία!",
						"Πληκτρολογήστε μια έγκυρη διεύθυνση",
						"Συνδέθηκε με επιτυχία!",
						"Αποτυχία σύνδεσης!",
						"Σύνδεση. Παρακαλώ περιμένετε!",
						"Πληκτρολογήστε μια τιμή μεταξύ 1 και 223."];
var netFlixOptions	= ["Απενεργοποίηση","ESN","Έκδοση Netflix"];
var netFlixDes	 	= ["Είστε βέβαιοι ότι θέλετε απενεργοποίηση;"," "/*Are you sure that you want to ESN?*/];
var netUpdateTitle 	= "Ενημέρωση Λογισμ.";
var netUpdateDialogTitle = "Ενημέρωση λογισμικού";
var netBGDownloadTitle 	= "Γίνεται λήψη";
var netUpdateLoadingPrompt= ["Γίνεται αναζήτηση για αναβαθμίσεις. Παρακαλώ περιμένετε!",
							"Γίνεται λήψη λογισμικού... Παρακαλώ περιμένετε!",
							"ΜΗΝ απενεργοποιείτε την τηλεόραση κατά την αναβάθμιση του λογισμικού!",
                            "Οι σημαντικές ενημερώσεις λογισμικού εγκαθίστανται αυτόματα παρασκηνιακά!"];
var netUpdatePrompt= ["Συγχαρητήρια, η έκδοση του λογισμικού σας είναι η πιο πρόσφατη!",
						"Βρέθηκε η νέα έκδοση λογισμικού XXXX. Θέλετε να κάνετε λήψη τώρα; Αυτό μπορεί να διαρκέσει λίγο διάστημα, ανάλογα με την κατάσταση του δικτύου σας.",
						"Αποτυχία σύνδεσης!",
						"Η λήψη δεδομένων απέτυχε. Προσπαθήστε ξανά αργότερα!",
						"Αποτυχία XML ενημέρωσης ανάλυσης!",
						"Αποτυχία συνδέσμου",
						"Η λήψη του λογισμικού ήταν επιτυχής. Θέλετε να ξεκινήσετε την αναβάθμιση;",
						"Απώλεια δεδομένων!Αποτυχία λήψης!",
						"Αποτυχία ελέγχου του πακέτου, δοκιμάστε ξανά!",
						"Το δίκτυο δεν λειτουργεί κανονικά. Ελέγξτε το και επανασυνδεθείτε ξανά…",
						"Αποτυχία ενημέρωσης. Επανεκκινήστε την τηλεόραση!",
						"Το αρχείο αναβάθμισης διαγράφηκε απροσδόκητα. Επαναλάβετε την αναβάθμιση μέσω δικτύου.",
						"Η λήψη του λογισμικού ολοκληρώθηκε με επιτυχία στο παρασκήνιο. Θέλετε να γίνει αναβάθμιση;"];
var netUpdateButtonText = ["Λήψη", "Ενημέρωση", "Αργότερα", "Ποτέ", "ΟΚ","Συνέχεια"];
var autoDetectPrompt = ["Βρέθηκε η νέα έκδοση λογισμικού XXXX. Θέλετε να κάνετε λήψη τώρα; Αυτό μπορεί να διαρκέσει λίγο διάστημα, ανάλογα με την κατάσταση του δικτύου σας.",
						"Βρέθηκε η νέα έκδοση του λογισμικού XXXX. Θέλετε να κάνετε ενημέρωση τώρα;",
						"Η διαδικασία αναβάθμισης μέσω δικτύου ματαιώθηκε την τελευταία φορά. Θα πορέπει να επαναλάβετε την αναβάθμιση.",
                        "Η λήψη της νέας ενημέρωσης λογισμικού XXXX δεν ολοκληρώθηκε. Θέλετε να συνεχίσετε;",
                        "Έγινε λήψη λογισμικού. Θέλετε να κάνετε ενημέρωση τώρα;"];
var sysOptions		= ["Ηλεκ. Εγχειρίδιο","Γλώσσα μενού ","Χρονοδιακόπτης","Κλείδωμα","Ρυθμίσεις Εισαγωγής",
						"Ενημέρωση Λογισμ.","Τοποθεσία","Λειτουργία HbbTV","Cookies","Κοινή διεπαφή",
						"Ρυθμίσεις για προχωρημένους","Επαναφορά shop","Ένδειξη LED","Άμεση ενεργοποίηση","Αυτόματη λειτουργία καταστήματος","Area","Λειτουργία επίδειξης"];
var sysResetDes		= "Είστε σίγουρος;";
var sysMenuLangOptions=["Γλώσσα","Προτιμώμενη γλώσσα ήχου","2η προτιμώμενη γλώσσα ήχου"];
var sysTimerOptions	= ["Ζώνη ώρας","Όνομα περιοχής","Ρολόι","Χρον/πτης ύπνου","Αυτόματη αναμονή", "Country region"];

var sysTimeZone		= ["Ως παρουσιαστής","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00",
						"GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30",
						"GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:01","GMT +8:01",
						"GMT +9:00","GMT +9:30","GMT +10:01","GMT +11:01","GMT +12:00",
						"GMT +12:45","GMT +13:01","GMT -12:00","GMT -11:00","GMT -10:00",
						"GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00",
						"GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];
var sysSleepTimer	= ["Εκτός Λειτουρ.","10 λεπτά","20 λεπτά","30 λεπτά","40 λεπτά","50 λεπτά","60 λεπτά","90 λεπτά","120 λεπτά"];
var sysStandby		= ["Εκτός Λειτουρ.","4 Ώρες","6 Ώρες","8 Ώρες"];
var sysRegionName	= ["Μαδρίτη","Κανάρια"];
var sysClockOptions	= ["Αυτόμ. συγχρονισμός","Ημερομηνία","Ώρα","Χρονοδιακ. ενεργ.","Χρονοδιακόπτης",
						"Ενεργοποίηση καναλιού","Χρονοδιακ. απενερ.","Χρονοδιακόπτης"];
var sysTimer		= ["Εκτός Λειτουρ.","Καθημερινά","Μια φορά"];

var sysInputSet		= ["Χωρίς Ετικέτα","DVD","Blu-ray","HDD","DVDR",
						"HD rec.","Παιχνίδι","VCR","PC","Ψηφιακό STB",
						"HD ψηφ STB","Κάμερα","Συσκ. Εγγραφ.","Άλλο"];
var sysAvVideoInput	= ["Αυτόματος","RGB_CVBS","RGB","CVBS","S-Video"];
var sysUpdate		= ["Μέσω USB","Μέσω Δικτύου","Ανά κανάλι"];
var sysUpdateDes	= [" ",
						" ",
						" ",
						"Δεν είναι δυνατή η εύρεση νέου λογισμικού στον αέρα!",
						"Βρέθηκε η νέα έκδοση του λογισμικού XXXX. Θέλετε να κάνετε ενημέρωση τώρα;",
						"Τοποθετήστε την κάρτα μνήμης USB.",
						"Αποτυχία ελέγχου του πακέτου, δοκιμάστε ξανά!",
						"ΜΗΝ αποσυν. το USB dongle και μην απεν. την TV κατά την ενημέρ. του υλ/κού!!",
						"Το λογισμικό ενημερώθηκε με επιτυχία.\nΘα γίνει επανεκκίνηση της τηλεόρασης!",
						"Βρέθηκε η νέα έκδοση λογισμικού XXXX. Θέλετε να κάνετε λήψη τώρα; Αυτό μπορεί να διαρκέσει λίγο διάστημα, ανάλογα με την κατάσταση του δικτύου σας.",
						"Γίνεται λήψη",
						"Η λήψη του λογισμικού ήταν επιτυχής. Θέλετε να ξεκινήσετε την αναβάθμιση;",
						"Αποτυχ ενημέρ!",
						"Αναζήτηση αρχείων αναβάθμισης",
						"Η ενημέρωση του λογισμικού ολοκληρώθηκε.\nΕπανεκκινήστε την τηλεόραση τώρα."];
var sysProductInfo	= ["Τρέχουσα Έκδοση","Όνομα προϊόντος","Όνομα κατασκευαστή","Όνομα πλαισίου"];
var sysCiDes		= ["Δεν εμφαν. κάρτα CI."];
var sysAdOptions	= ["Εγγραφή σε DivX(R)","Απενεργοποίηση DivX(R)","T-Link","Authorization Error","Επιβεβαίωση κατάργησης καταχώρησης",
						"Επιβεβαίωση ενοικίασης","Η ενοικίαση έληξε"];
var sysRegistDes	= ["Θα πρέπει να δηλώσετε τη συσκευή σας για την προβολή προστατευμένων βίντεο DivX",
						"Κωδικός εγγραφής:",
						"Εγγραφείτε στο http://vod.divx.com"];
var sysDregistDes	= ["Κωδικός απενεργοποίησης:",
						"Για απενεργοποίηση μπείτε στο http://vod.divx.com",
						"Θέλετε να συνεχίσετε με την εγγραφή σας;"];
var mediaAuthorization = ["Η συσκευή σας δεν είναι εξουσιοδοτημένη να αναπαράγει αυτό το βίντεο με προστασία DivX(R)."];
var deregistrationConfrimation = ["Έχετε ήδη δηλώσει τη συσκευή σας.","Είστε σίγουρος/η ότι επιθυμείτε να διαγραφείτε;"];
var rentalConfirmation = "Χρησιμοποιήθηκαν XXXX από τις YYYY προβολές στην ενοικίαση DivX(R). Συνέχεια;";
var rentalExpired 	= "Η ενοικίαση DivX(R) έχει χρησιμοποιηθεί XXXX από τις YYYY φορές. Η ενοικίαση DivX έχει λήξει.";

var parentalRatingNA		= ["***","***","***","***","***","***","***","***"];
var parentalRatingOptionUS		= ["***","***","***"];
var sysTVRatingUS=["***","***","***","***","***"];
var sysMPAAUS=["***","***","***","***","***","***"];
var parentalRatingOptionCanada		= ["***","***","***"];
var sysCanadaEng=["***","***","***","***","***","***"];
var sysCanadaFre=["***","***","***","***","***",""];
var sysResetRRT=["***"];
var sysLockOptions	= ["Φραγή καναλιού","Κλείδωμα χρον. διαστήματος","Γονική διαβάθμιση","Φραγή εισόδου","Κλείδωμα μπροστινού πίνακα","Κλείδ. Εγκατ.",
						"Αλλαγή κωδ. πρόσβ.","Μεγ. Ένταση","Καθάρισε όλα"];
var sysTimeIntervals= ["Τύπος κλειδώμ.","Ώρα έναρξης","Ώρα λήξης"];
var sysRatingOptions= ["Κανένα","4","5","6","7","8","9","10","11","12",
						"13","14","15","16","17","18","Ακατάλληλο (Ισπανία)"];
var changePass		= ["Αλλαγή κωδ. πρόσβ.","Νέος κωδ. πρόσβ.","Επιβ. κωδ. πρόσβ."];
var changePassDes	= ["Λάθος κωδικός πρόσβασης.\nΕισάγετε ξανά!",
						"Ο κωδικός πρόσβασης δεν ταιριάζει.\nΕισάγετε ξανά!",
						"Η ρύθμιση κωδ. πρόσβασης ολοκληρώθηκε!",
						"Η ρύθμιση αυτού του κωδικού ως κωδικό πρόσβασης είναι πολύ απλή.\nΠληκτρολογήστε ξανά!"];
var sysPowerOnChOptions= "Επιλογή λειτουργίας";
var sysPowerOnCh	= ["Τελευταία κατάσταση","Επιλογή χρήστη"];
var netWlessSecu    = ["Άνοιγμα","WEP","WPA/WPA2-PSK "];
var netWlessSecu2	= ["Κανένα","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK ","Δεν υποστηρίζεται"];
var netWlessSecu3	= ["Κανένα","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)","Δεν υποστηρίζεται"];
var netOptions		= ["Σύνδεση Διαδικτύου","Διασύνδεση","Ασύρματες ρυθμίσεις","Ρυθμίσεις IP","Πληροφορίες",
						"Δοκιμή σύνδεσης","DLNA","Τηλεχειριστήριο","Ρυθμίσεις Netflix","Εμφάνιση Wifi  ",
						"Τύπος διεύθυνσης","Διεύθυνση IP","Μάσκα υποδικτύου","Προεπιλεγμένη πύλη","Πρωτεύων DNS",
						"Δευτερεύων DNS","SSID","BSSID","Εισάγετε SSID:","Αναγνωριστικό χρήστη"];
var chEditDes		= ["Διπλός αριθμός καναλιού!","Πατήστε το κόκκινο πλήκτρο για να διαγράψετε τον τρέχοντα χαρακτήρα!","Μη έγκυροι αριθμοί καναλιών."];
var chEpgNoProgram	= "Δεν υπάρχουν πληροφορίες προγράμματος. Επιλέξτε κανάλια πρώτα!";
var chEpgWords		= ["Οδηγός Προγράμματος","Δεν υπάρχουν δεδομένα προγράμματος.","Το κανάλι είναι κλειδωμένο!","Δεν υπάρχουν λεπτομέρειες για το πρόγραμμα.","Δεν υπάρχει τίτλος προγράμματος."];
var chEpgBooking	= ["Programarea meciului", "Αριθμός καναλιού","Ημερομηνία Έναρξης","Ώρα έναρξης","Ώρα λήξης",
						"Τύπος Επανάληψης","Τύπος προγράμματος","Προσθ.","Αντικατάσταση","Αλλαγή",
						"Προσθήκη/Τροποποίηση"];
var epgHotKey		= ["Προηγ. μέρα","Επόμενη μέρα","Suodin","Λίστα προγράμματος","Προσθ. προγράμματος"];
var chEpgBookRemind	= ["Εσφαλμένη ώρα έναρξης","Εσφαλμένος χρόνος λήξης","Διπλός προγραμματισμός","Αποθηκεύθηκε Επιτυχώς.","Διαγράφηκε με επιτυχία."];
var chSchePara		= ["Λίστα προγράμματος","Ώρα έναρξης","Ημερομηνία Έναρξης","Τίτλος προγράμματος","Όνομα καναλιού",
						"Διάρκεια","Επανάληψη","Προγραμματισμός","Επεξεργασία","Διαγραφή"];
var dateTimer		= ["Μια φορά","Καθημερινά","Εβδομαδιαία"];
var scheduleDeleteReminds="Θέλετε να διαγράψετε αυτό το πρόγραμμα;";
var scheduleNoLists	= "Δεν υπάρχει λίστα προγράμματος. Πατήστε το \"Κόκκινο\" πλήκτρο για να προσθέσετε ένα.";
var chListWords		= ["Λίστα καναλιών","Επιλογή λίστας","Κατάσταση συντονισμού","Προσθήκη σε Αγαπημένα","Διαγραφή  ",
						"Επιλογή λίστας καναλιών","Επιλογή λειτουργίας συντονιστή","Εναλλαγή"];
var chListType		= ["Όλα","Ψηφιακά","Αναλογικά","Ράδιο","Δωρεάν","Αγαπημένα"];
var chAutoScanOptions=["Επιλογή χειριστή","κανάλι τύπου","Αυτόματη αναζήτηση"];
var souSoundType	= ["Μη έγκυρο","Μονοφων.","Μονοφων.","Στερεοφωνικό","Στερεοφωνικό",
						"SAP","SAP","Διπλό 1","Διπλό 2","Διπλό 2",
						"Nicam mono","Nicam stereo","Nicam dual1","Nicam dual2","Nicam διπλό",
						"Μονοφων.","LL","RR","LR"];
var souPreset		= ["Μουσική","Κινηματογράφος","Καθαρισμός φωνής","Πρότυπο","Προσωπική"];
var picAdRgbMode	= ["Εκτός Λειτουρ.","Κόκκινο μόνο","Πράσινο μόνο","Μπλε μόνο"];
var picAdOptions	= ["Ελάττωση Θορύβου","MPEG-Nr.","RGB mode","Dynamic Contrast","LED σαφήνειας κίνησης",
						"Τόνος δέρματος","Λειτουργία Φιλμ","Λειτουργ. Παιχνιδιού","Θερμοκρ. χρώματος","Ισορροπία λευκού",
						"Πάγωμα","Μαύρο Stretch","Υπερ-σάρωση","Gamma","Λειτουργία HDMI","10P ισορροπία λευκού","Επέκταση χρώματος",
						"Μείωση θαμπάδας","Εξάλειψη τρεμοπαίγματος ","Χρωματικό διάστημα","Σαφήνεια κίνησης "];
var pic10Pwhite     = ["Ενδιάμεσο","Κόκκινο","Πράσινο","Μπλε","Επαναφορά","Χρώμα","Κίτρινο","Κυανό","Ματζέντα"];
var picMotionClarity = ["Λειτουργία κίνησης ","Παρεμβολή κίνησης ","LED σαφήνειας κίνησης","Μείωση θαμπάδας","Εξάλειψη τρεμοπαίγματος ","Επαναφορά"];
var picMotionMode   = ["Ταινίες","Απαλή","Διαγραφή","Αθλητικά","Πελάτης"];
var picResetDes		= "Θα γίνει επαναφορά όλων των ρυθμίσεων και οι ατομικές σας ρυθμίσεις θα διαγραφούν. Θέλετε σίγουρα να εκτελέσετε την επιλεγμένη λειτουργία;";
var pic10PReset     = "Είστε βέβαιοι ότι θέλετε να επαναφέρετε τη λειτουργία 10P ισορροπία λευκού;";
var picMotionReset  = "Θέλετε να επαναφέρετε τις ρυθμίσεις της σαφήνειας κίνησης;";
var picColorSpaceReset    = "Θέλετε σίγουρα να επαναφέρετε τις ρυθμίσεις του χρωματικού διαστήματος;";
var picOptions		= ["Λειτουργία εικόνας",
						"Φωτισμός οθόνης","Φωτεινότητα","Αντίθεση","Κορεσμός","Χροιά","Ευκρίνεια","Θερμοκρ. χρώματος","Λειτουργία οθόνης","Αυτόματη μορφή",
						"Αθλητικά","3D","Πλοήγηση 3D","ECO Pυθμίσεις","Γεωμετρία",
						"Ρυθμίσεις για προχωρημένους","Επαναφορά εικόνας","μικρο-εξασθένιση"];
var picSize			= ["16:09", "Μορφή 4:3", "Μορφή 14:9  ", "Cinerama",
						"16:9-Zoomaus  ", "16:9-Zoomaus ylös","14:9-Zoomaus","Kapea zoomaus","Laaja zoomaus",
						"Zoomaus 2","Laaja zoomaus 2","Στην αρχική οθόνη","Piste pisteeltä","Αρχική","Πανοραμική"];
var others			= ["Ένταση","Μετάδοση","Κωδικός πρόσβασης","Κατάσταση","Αποθήκευση","Αντικατάσταση","Έναρξη","Έξοδος","Αναζήτηση","Διαγραφή",
						"Κανένα","Αυτόματο","Σάρωση","Ασφάλεια","Σύνδεση","Ανανέωση","Επανάληψη","Παύση","Pυθμίσεις","Кανάλια",
						"Επεξεργασία","Εισαγωγή","σήματος!","Τέλος","Στερεοφωνικό","Ήχος","Πηγή","Δεν υπάρχει ήχος","Συμβουλές","Επαναφορά",
						"Πελάτης","Ρύθμιση","Καταχώρηση","Χρήστης","Κλείσιμο πληκτρολογίου","Λειτουργία ασφαλείας","Καθημερινά","Λίστα PVR  "];
var direction		= ["Αριστερά","Δεξιά","Πάνω","Κάτω"];
var audioType 		= ["MPEG","DOLBY AUDIO"/*"AC3"*/,"MPEG4","AAC", "DOLBY AUDIO"/*"AC3P"*/,
						"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD",
						" "," "," "," "," ",
						" ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2",
						"HE-AAC_V4","Άγνωστο"];
var soundChannels   = ["Άγνωστο","Μονοφων.","Υπό","Διπλό μονοφωνικό","Στερεοφωνικό","Stereo Sub","Stereo Dolby Surround","Surround 2 ΚΑΝΑΛΙΩΝ","Surround","3.0Ch","4.0Ch","5.0Ch","Μονοφωνικό Lfe","Διπλό Μονοφωνικό Lfe","Στερεοφωνικό Lfe","Surround 2Ch Lfe","Surround Lfe","3.1Ch","4.1Ch","5.1ΚΑΝ","7.1ΚΑΝ","Μεικτό στερεοφωνικό  ","Fmrdo Μονοφωνικό","Fmrdo Στερεοφωνικό","Fm Μονοφωνικό Nicam Μονοφωνικό","Fm Μονοφωνικό Nicam Στερεοφωνικό","Fm Μονοφωνικό Nicam Διπλό","Αριστερά","Δεξιά","Άλλα"];
var prompts			= ["Ρυθμίστε την εικόνα που ταιριάζει καλύτερα στο περιβάλλον σας.",
						"Ρυθμίστε το επίπεδο της φωτεινότητας. Όσο πιο κοντά στην τιμή 100, τόσο φωτεινότερο.",
						"Ρυθμίστε το επίπεδο της αντίθεσης. Όσο πιο κοντά στο 100, τόσο μεγαλύτερη είναι η αντίθεση φωτεινού-σκούρου.",
						"Ρυθμίστε το επίπεδο του κορεσμού. Όσο πιο κοντά στο 100, τόσο πιο έντονο είναι το χρώμα.",
						"Ρυθμίστε το επίπεδο της οξύτητας. Όσο πιο κοντά στο 100, τόσο πιο έντονες είναι οι λεπτομέρειες.",
						"Ρυθμίστε το επίπεδο του οπίσθιου φωτισμού. Όσο πιο κοντά στο 100, τόσο πιο φωτεινή είναι η οθόνη.",
						"Ρυθμίστε το επίπεδο της απόχρωσης. Η ρύθμιση αλλάζει τους χρωματικούς τόνους.",
						"Επιλέξτε μορφή προβολής που ταιριάζει καλύτερα στο πρόγραμμα που προβάλλεται.",
						"Διαμορφώστε επιλογές εξοικονόμησης ενέργειας.",
						"Ρυθμίζει τη γεωμετρία της οθόνης όταν συνδέεται σε συσκευή υπολογιστή.                                              ",
						"Επιλέξτε περισσότερες ρυθμίσεις εικόνας για προχωρημένους.",
						"Επαναφέρετε όλες τις ρυθμίσεις εικόνας στις προεπιλογές.",
						"Επιλέξτε μια λειτουργία ήχου που ανταποκρίνεται στην προσωπική σας προτίμηση.",
						"Προσαρμόστε την εξισορρόπηση έντασης μεταξύ αριστερού και δεξιού καναλιού.",
						"Το σύστημα ήχου TruSurround HD προσφέρει πλούσιο ήχο και διαύγεια σε χαμηλές και υψηλές συχνότητες.",
						"Ψηφιακή διεπαφή για τη σύνδεση της εξόδου του ψηφιακού ήχου της τηλεόρασης στον εξοπλισμό του συστήματος οικιακού κινηματογράφου. ",
						"Επιλέξτε τη γλώσσα ήχου που ανταποκρίνεται στην προσωπική σας προτίμηση.",
						"Ενεργοποίησης λειτουργίας για άτομα με προβληματική όραση, για να μπορούν να απολαύσουν τηλεοπτικό πρόγραμμα.",
						"Ελέγξτε την εικόνα της τηλεόρασης, τον ήχο και το σήμα.",
						"Επιλέξτε τον τύπο λίστας καναλιών που ανταποκρίνεται στο τηλεοπτικό σας σήμα.",
						"Επιλογή γλώσσας υποτίτλων που εμφανίζονται στο κάτω μέρος της οθόνης.",
						"Προβολή κειμένου και εικόνων τρέχοντος καναλιού.",
						"Digital Living Network Alliance. Απολαύστε μουσική, φωτογραφίες και βίντεο μέσω του οικιακού δικτύου από άλλες συσκευές , όπως έναν υπολογιστή.",
						"Προβάλετε το περιεχόμενο από το smartphone σας στην τηλεόραση και χρησιμοποιήστε το smartphone ως τηλεχειριστήριο για την τηλεόραση.",
						"Απολαύστε περιεχόμενο από συσκευή Android συμβατή με Miracast στην οθόνη της τηλεόρασης.",
						"Εφαρμόστε ένα κλείδωμα στην τηλεόρασή σας.",
						"Επιλέξτε ένα όνομα για τη συσκευή σας.",
						"Επιλέξτε το περιβάλλον παρακολούθησης.",
						"Επαναφέρετε όλες τις Ρυθμίσεις Συστήματος στις προεπιλογές.",
    					"Switch off sports mode for more options.",
    					"Βελτίωση της περιβαλλοντικής αντίθεσης",
    					"Μια ειδική λειτουργία για την απόλαυση αγώνων",
    					"Απολαύστε περισσότερες λειτουργίες CEC."];
var initialTitle	= ["Καλώς ήρθατε","Αρχική εγκατάσταση"];
var initialPrompt	= ["Ολοκληρώστε την Αρχική Διαμόρφωση. Σας περιμένει ένας κόσμος συναρπαστικών περιπετειών!",
						"Επιλέξτε τη γλώσσα σας:",
						"Επιλέξτε τη χώρα / περιοχή σας:",
						"Επιλέξτε την τοποθεσία σας:",
						"Επιλέξτε τον τύπο σύνδεσης του δικτύου:",
						"Επιλέξτε λειτουργία σύνδεσης ενσύρματου δικτύου:",
						"Η σύνδεση στο xxxxxxxxx απέτυχε! Συνδέστε τη συσκευή σύμφωνα με το παρακάτω διάγραμμα ή επιλέξτε Left (Αριστερά) για επαναφορά.",
						"Συνδέθηκε στο xxxxxxxxx! Επιλέξτε Right (Δεξιά) για να συνεχίσετε. ",
						"1)Η τηλεόρασή σας μπορεί να διαθέτει ήδη ένα ενσωματωμένο ασύρματο προσαρμογέα\n 2)Εάν παρέχεται ασύρματος προσαρμογέας USB , συνδέστε τον στην τηλεόρασή σας.Στη συνέχεια, επιλέξτε τη λειτουργία σύνδεσης σε ασύρματο δίκτυο",
						"Σάρωση. Παρακαλώ περιμένετε...",
						"Δεν υπάρχουν ασύρματες συσκευές συνδεμένες στην TV σας!",
						"Βεβαιωθείτε ότι το παρακάτω PIN έχει εγκατασταθεί στο ΣΠ πριν κάνετε κλικ στην επιλογή «Επόμενο».",
						"Πατήστε το πλήκτρο στο AP εντός 120 δευτερολέπτων πριν πατήσετε Right (δεξιά) !",
						"WPS (Ρύθμιση προστατευμένου Wi-Fi)",
						"PIN(Προσωπικός Αριθμός Αναγνώρισης)",
						"PBC(Διαμόρφωση με πάτημα κουμπιού)",
						"Το παρακάτω περιεχόμενο είναι διαθέσιμο όνο με σύνδεση στο δίκτυο. Θέλετε να παρακάμψετε τη Ρύθμιση Δικτύου;",
						"Υπάρχουν νέες ενημερώσεις λογισμικού για λήψη. Μπορεί να πάρει μερικά λεπτά ανάλογα με την κατάσταση του δικτύου.",
						"Με την ενημέρωση του λογισμικού τηλεόρασης διασφαλίζεται ότι μπορείτε να απολαμβάνετε τις πιο πρόσφατες δυνατότητες και υπηρεσίες.",
						"Δε θα έχετε την ευκαιρία να αξιοποιήσετε τις νέες λειτουργίες και τις υπηρεσίες. Θέλετε σίγουρα να παρακάμψετε την Ενημέρωση λογισμικού;",
						"Πατήστε το δεξί πλήκτρο για να συνεχίσετε.",
						"Μη σβήσετε την τηλεόραση όσο διαρκεί η ενημέρωση. Μπορεί να προκαλέσει βλάβη στην τηλεόραση. ",
						"Εάν δεν θέλετε να κάνετε ενημέρωση, επιλέξτε ΟΧΙ.",
						"Ενημέρωση, παρακαλώ περιμένετε",
						"Μπορείτε επίσης να ενημερώσετε το λογισμικό από το μενού ΣΥΣΤΗΜΑ/ΝΗΜΕΡΩΣΗ ΛΟΓΙΣΜΙΚΟΥ.",
						"Η επιλεγμένη χώρα ζητάει ρύθμιση κωδικού πρόσβασης.\nΡυθμίστε τον κωδικό για την τηλεόρασή σας και επιβεβαιώστε τον.",
						"This code is too simple.\nPlease use different digits.",
						"Συγχαρητήρια. Η διαμόρφωση ολοκληρώθηκε. Μπορείτε να αλλάξετε τη διαμόρφωση από το Κεντρικό μενού και τα αντίστοιχα υπομενού. ",
						"Επιλέξτε τη λειτουργία ασφάλειας:",
						"Επιλέξτε λειτουργία σύνδεσης ασύρματου δικτύου:",
						"Δίκτυο"];
var initNetCabAndDonRe = ["Δεν έχει συνδεθεί καλώδιο δικτύου. Συνδέστε ένα καλώδιο δικτύου!","Δεν παρέχεται ασύρματος προσαρμογέας ή ασύρματος προσαρμογέας USB."];
var initChPrompt = ["Ρύθμιση τηλεοπτικού καναλιού","Επιλέξτε τύπο σάρωσης κεραίας.","Επεξεργασία αυτόματου συντονισμού...","Εντοπίστηκαν τα παρακάτω κανάλια:","Επιλέξτε τύπο σάρωσης για Καλωδιακά.","Επιλέξτε πρόγραμμα από την παρακάτω λίστα.","Διαμορφώστε τις πληροφορίες σάρωσης","Βρέθηκαν τα παρακάτω Καλωδιακά κανάλια:","Επιλέξτε έναν πάροχο υπηρεσίας από την παρακάτω λίστα","Επιλέξτε Δορυφορικά για να σαρώσετε ή να επεξεργαστείτε τα επιλεγμένα δορυφορικά κανάλια","Ρυθμίστε τις παραμέτρους των δορυφορικών καναλιών","Εντοπίστηκαν τα παρακάτω κανάλια. Μπορείτε να εκτελέσετε σάρωση ξανά από το μενού Κανάλι/Σάρωση καναλιών. "];
var initClockPrompt = ["Ρύθμιση ώρας από το δίκτυο!",
						"Ρυθμίστε την ώρα και την ημερομηνία:"];
var initialOptions	= ["Περιβάλλον","Ρύθμιση δικτύου","Ενημέρωση Λογισμ.","Εγκατάσταση καναλιών","Ρολόι"];
var initialHotkeys	= ["Επιστροφή","Επιλογή","Επόμενο","Συμφωνώ"];
var initLocations	= ["Σπίτι","Κατάστημα","Επίδειξη λειτουργίας καταστήματος"];
var initNets		= ["Ενσύρματα","Ασύρματη","Δεν έχω σύνδεση δικτύου"];
var initWireManuals	= ["Διεύθυνση IP","Μάσκα υποδικτύου","Προεπιλεγμένη πύλη","Πρωτεύων DNS","Δευτερεύων DNS"];
var initSoftUpdates = ["Ενημέρωση τώρα","Ενημέρωση αργότερα"];
var initChannelIns	= ["Συνέχεια","Δεν θέλω να ρυθμίσω κανάλια "];
var initChScanTypes	= ["Ψηφιακά & Αναλογικό","Ψηφιακά","Αναλογικά","Δεν επιθυμώ να εκτελέσω σάρωση"];
var initChDvbts		= ["Κανάλια Antenna ATV:","Κανάλι Antenna DTV:"];
var initChDvbcs		= ["Καλωδιακά αναλογικά τηλεοπτικά κανάλια:","Καλωδιακά ψηφιακά τηλεοπτικά κανάλια:"];
var initChDvbss		= ["Δορυφορικά κανάλια:"];
var initChDvbSOther	= ["Δεν επιθυμώ να εκτελέσω σάρωση για δορυφορικά"];
var initEndConnectedStatus= ["Αποσυνδέθηκε","Συνδέθηκε σε WiFi  ","Συνδέθηκε ασύρματα"];
var initEndInstallations= "Ρυθμίστηκαν κανάλια XXXX ";
var initEndUpdate	= ["Έγινε ενημέρωση"];

var audioScenes 	= ["Επιφάνεια εργασίας","Επιτοίχια στήριξη"];			
var screenSavers	= ["Δεν βρέθηκαν κανάλια, πατήστε το πλήκτρο ΟΚ και κάντε σάρωση!",
						"Δεν υπάρχει σήμα!",
						"Κωδικοποιημένο",
						"Μόνο δεδομένα",
						"Ηχητικό πρόγραμμα",
						"Δεν υπάρχει ούτε ήχος ούτε εικόνα",
						"Μη διαθέσιμη",
						"Χωρίς teletext",
						"Δεν υπάρχουν δεδομένα προγράμματος.",
						"Το πρόγραμμα είναι κλειδωμένο!",
						"Το πρόγραμμα είναι κλειδωμένο!\nΠιέστε ΟΚ και εισάγετε τον κωδικό σας.",
						"Δεν υπάρχουν λεπτομέρειες για το πρόγραμμα.",
						"Το πρόγραμμα είναι ακατάλληλο για ανηλίκους.\nΠατήστε OK και πληκτρολογήστε τον κωδικό σας.",
						"Το κανάλι είναι κλειδωμένο!",
						"Κλειδωμένο Κανάλι!\nΠιέστε OK και εισάγετε τον κωδικό σας.",
						"Είσοδος Κλειδωμένη!\nΠιέστε ΟΚ και εισάγετε τον κωδικό σας.",
						"Δεν υποστηρίζεται!",
						"Η υπηρεσία αυτή δεν είναι διαθέσιμη αυτή τη στιγμή",
						"Κλειδ είσοδος!",
						"Δεν υπάρχει τίτλος προγράμματος.",
						"Χωρίς Λειτουργία",
    					"Χωρίς Υπότιτλοι"
						];
var channelNumberOverPromt = ["The number of search programs has exceeded,you can delete some programs and then retry!"];
var chBookingPromt	= ["Έχει προγραμματιστεί να γίνει εγγραφή από το συγκεκριμένο κανάλι. Η τηλεόραση  θα ξεκινήσει να κάνει εγγραφή. ",
						"Βρέθηκε μια προγραμματισμένη εγγραφή.\n Μεταβείτε στο XXXX για να πραγματοποιήσετε εγγραφή",
						"Το τρέχον κανάλι έχει μια υπενθύμιση.",
						"Βρέθηκε μια προγραμματισμένη υπενθύμιση.\n Μεταβείτε στο XXXX"];
var timeUnit		= ["δευτ.","ελάχ"];
var ciPromt			= ["Οι ρυθμίσεις του δικτύου έχουν αλλάξει. Για να κάνετε ενημέρωση, εκτελέστε σάρωση ξανά. ",];
var othersPromt		= ["Περιμένετε...",];
var menuOptions		= ["Εικόνα","Ήχος","Kανάλι","Smart TV","Δίκτυο","Σύστημα","Υποστήριξη"];
var optionOptions	= ["Λειτουργία εικόνας","Επαναφορά ηχητ. Ρυθμίσεων","Πάγωμα","T-Link","χρον. μετατόπιση","PVR","Λίστα προγράμματος","Pυθμίσεις","*"];
var optionTLinkPromt= [["Αυτόματη ενεργοποίηση","Αυτόματη αναμονή","Μενού οδηγού"],
						["Ενεργοποίηση","Αναμονή","Τόμος Ενισχυτή"]];
var powerPromt		= ["Η τηλεόραση θα απενεργοποιηθεί σύντομα! Πατήστε οποιοδήποτε πλήκτρο για ακύρωση."];
var ttxLanguage		= ["ΔΥΤ. ΕΥΡ.","ΑΝΑΤ. ΕΥΡ.","Ρώσικα","Αραβικά/Εβραϊκά","Περσικά","Αραβικά ","bělorusky","Ελληνικά","Τούρκικα"];
var ttxOptions		= ["Εμφάνιση","Κυκλική κίνηση Υποσελίδων","Γλώσσα","Ξυπνητήρι","Σύντομα Νέα"];
var weekday         = ["Κυριακή","Δευτέρα","Τρίτη","Τετάρτη","Πέμπτη","Παρασκευή","Σάββατο"];
var lcnConfflict	= "Προβληματική λήψη προγράμματος.";
var inShopMode		= "Η τηλεόρασή σας είναι στη λειτουργία Αγορών. Για να επιστρέψετε την Κεντρική λειτουργία, επιλέξτε ‘Σύστημα’ και αλλάξτε ‘Τοποθεσία’ από το μενού. ";
var nitRefresh		= "Τα στοιχεία του δικτύου άλλαξαν. Να γίνει ενημέρωση σάρωσης;";
var picHDMIMode     = ["Αυτόματος","γραφικών","Εικόνα"];

var glassRemind    	= ["Συνδέστε τα γυαλιά σας 3D με την τηλεόραση\n(Πατήστε το κουμπί της τροφοδοσίας στα γυαλιά 3D).","Τα γυαλιά σας 3D έχουν συνδεθεί με την τηλεόραση",""];
var pvrRemind 		= ["Μην αποσυνδέετε τη συσκευή USB και μην το βγάλετε από την πρίζα"];
var pvrConName   	= ["PVR","Πληροφορίες προγράμματος:",["Note: If you record the HD channel, please to select  the  disk(of speed >5.0MB/sec), and to select the disk (of speed >3.0MB/sec) when you want to record the SD channel.","Εγγραφέν βίντεο αποθηκεύθηκε στον \"PVR\" φάκελο."],"Παύση","Εγγραφή","ώρα","Λεπτό","Διάρκεια","Συμβουλές","Χρησιμοποιήστε τα βελάκια για να ρυθμίσετε τη διάρκεια της εγγραφής."];
var pvrDisRemind 	= "Συνδέστε USB stick για εγγραφή.";
var pvrRemindWords  = ["Θέλετε να βγείτε από το πρόγραμμα;",
							"Θέλετε να σταματήσετε την εγγραφή και να εξερευνήσετε τα αρχεία που έχουν εγγραφεί;",
							"Έχει γίνει εξαγωγή του δίσκου.",
							"Δεν υπάρχει αρκετός ελεύθερος χώρος.",
							"Δεν υπάρχουν εγγραφές. Ξεκινήστε εγγραφή. ",
							"Η λειτουργία PVR δεν ξεκινά σε κρυπτογρ κανάλι",
							"Λειτουργία μη διαθέσιμη",
							"Αποθηκεύθηκε Επιτυχώς.",
							"Να διακοπεί η διαδικασία εγγραφής και να αλλάξετε πηγή εισόδου;",
							"Η εγγραφή του τηλεοπτικού προγράμματος θα σταματήσει. Θέλετε σίγουρα να βγείτε από το πρόγραμμα;",
							"Η εγγραφή PVR λειτουργεί μόνο με καλό τηλεοπτικό σήμα. Ελέγξτε τη δύναμη του σήματος."];
var pvrChangeCh 	= ["Θέλετε να αλλάξετε κανάλι;",
							"Θέλετε να διακόψετε τη διαδικασία εγγραφής και να αλλάξετε κανάλι;"];
var pvrChangeToPIN8	= ["Θέλετε να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή SCART;",
				    		"Θέλετε να διακόψετε την εγγραφή και να αλλάξετε την πηγή εισόδου στην υποδοχή SCART;"];
var pvrChangeToCEC  = ["Θέλετε να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή HDMI;",
				  			 "Θέλετε να διακόψετε την εγγραφή και να αλλάξετε την πηγή εισόδου στην υποδοχή HDMI;"];
var pvrGuideJump    = ["Θέλετε να μπείτε στη λειτουργία EPG;",
							"Να διακοπεί η διαδικασία εγγραφής και να μπείτε στο EPG;"];
var pvrMediaJump    = ["Θέλετε να μπείτε στη λειτουργία Media;",
							"Να διακοπεί η διαδικασία εγγραφής και να μπείτε στο Media;"];
var timeshiftExtra	= ["Θέλετε παύση αλλαγής ώρας,αλλαγή καναλιού;",
						"Θέλετε να σταματήσετε τον προγραμματισμό, και να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή SCART;",
						"Θέλετε να σταματήσετε τον προγραμματισμό, και να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή HDMI;",
						"Η λειτ μετατόπισης χρον δεν ξεκινά σε κρυπτ κανάλι",
						"Θέλετε να σταματήσετε τον προγραμματισμό, και να μπείτε στη λειτουργία EPG;",
						"Θέλετε παύση αλλαγής ώρας, και αλλαγή από τύπο τηλεόρασης σε USB;",
						"Θέλετε παύση αλλαγής ώρας,αλλαγή πηγής τροφοδοσίας;",
						"Συνδέστε USB stick για εγγραφή.",
						"Το μέγεθος του δίσκου δεν είναι αρκετό.",
						"Ο προγραμματισμός της τηλεόρασης θα σταματήσει. Θέλετε να βγείτε από το πρόγραμμα;"];
var timeshiftStatus	= ["Γρήγορη κίνηση προς τα πίσω","Παύση","παίζω","Παύση  ","Γρήγορη κίνηση μπροστά"];
var pvrPowerOffRemind= ["Αναμονή για εγγραφή","Αναμονή","Η τηλεόραση κάνει εγγραφή τηλεοπτικού προγράμματος. Θέλετε να συνεχίσει να γίνεται εγγραφή όταν η τηλεόραση είναι σε κατάσταση αναμονής;"];
var timeshiftInitTitle= "Εγκατάσταση Δίσκου";
var timeshiftInitReminds= ["Χρήση αυτού του οδηγού για εγκατάσταση δίσκου USB για αλλαγή ώρας. Επιλέξτε τύπο εγκατάστασης.",
						 "Για καλύτερη απόδοση, συνιστούμε να διαμορφώσετε το USB δίσκο. Θα διαγράψει όλα τα δεδομένα.",
						 "Επιλέξτε το μέγεθος αρχείου για αλλαγή ώρας.",
						 "Μορφοποίηση",
						 "Δεν υπάρχει αρκετός ελεύθερος χώρος.",
						 "Δημιουργία αρχείου αλλαγής ώρας",
						 "Δοκιμή ταχύτητας",
						 "Η ταχύτητα δίσκου είναι πολύ αργή (<%f MB/sec) για ενεργοποίηση λειτουργίας αλλαγής ώρας!",
						 "Ο δίσκος είναι έτοιμος για αλλαγή ώρας. Αλλά προτείνουμε να αλλάξετε δίσκο (ταχύτητας>%f MB/sec) για καλύτερη απόδοση.",
						 "Ο δίσκος είναι έτοιμος για αλλαγή ώρας. "];
var timeshiftInitButtons= ["Μορφή","Προσπέραση","Ακύρωση","ΟΚ","Τέλος","Έξοδος"];
var timeshiftInitOther=["Ταχύτ. Δίσκου:","MB/sec"];

var selectChoice	= "Είστε σίγουρος;";
var chAtvStore		= "Αποθήκευση ως XXXX";
var chEpgFirstGenreUK= ["Κινηματογράφος","Νέα και Ειδήσεις","ΨΥΧΑΓΩΓΙΚΑ","Αθλητικά","Παιδικά","Εκπαίδευση","Κοινωνικά","Δράμα"];
var homePageTitleList = ["ΕΦΑΡΜΟΓΕΣ","TV","ΒΙΝΤΕΟ","Αρχική σελίδα"];
var homePageFavAndAllName  = ["Αγαπημένες εφαρμογές","Όλες οι εφαρμογές"];
var homePageBackUp = ["Ηλεκ. Εγχειρίδιο","Λειτουργία GuideOn"];
var homePageRemind   = ["Η πλήρης λειτουργικότητα θα είναι διαθέσιμη μετά τη σύνδεση στο δίκτυο","Η τηλεόρασή σας δεν έχει αποθηκευμένα κανάλια. Τα προγράμματα θα είναι διαθέσιμα μετά την σάρωση των καναλιών. ","Κανένα πρόγραμμα","Να γίνει αναζήτηση καναλιών τώρα;"];
var homePageHistory = ["Ιστορικό"];
var miracastTitle = ["Εμφάνιση Wifi  ","Συσκευή TCL  "];
var miracastRemind=["Το Εμφάνιση Wifi σας επιτρέπει να μοιράζεστε ασύρματα την οθόνη και τον ήχο της συσκευής σας, όπως ένα smartphone ή tablet, με την τηλεόρασή σας (δηλ. χωρίς καλώδια). Αυτό καθιστά εφικτό να προβάλλετε στην τηλεόρασή σας, ταυτόχρονα, ό,τι εμφανίζεται στο smartphone ή το tablet. Για παράδειγμα, μπορείτε να ξεκινήσετε ένα βίντεο στο smartphone και να το εμφανίσετε ταυτόχρονα στην τηλεόρασή σας ή να χρησιμοποιήσετε το tablet ως χειριστήριο παιχνιδιού, προβάλλοντας περιεχόμενο στη μεγάλη οθόνη της τηλεόρασή σας.","Η ασύρματη σύνδεση τηλεόρασης στην τηλεοπτική συσκευή είναι έτοιμη. Ξεκινήστε την κοινή χρήση της οθόνης της συσκευής σας με την τηλεόραση τώρα.","Σύνδεση. Παρακαλώ περιμένετε!","Αποτυχία σύνδεσης!","Η σύνδεση απέτυχε. Ελέγξτε ξανά!"];
var homePageLittleWin = ["Pυθμίσεις","Πολυμέσα","Αγαπ. Κανάλια","Smart TV","EPG"];

var hbbtvStopRemind  = ["Θέλετε να  σταματήσετε την αναπαραγωγή;"];
var colorSystem = ["Αυτόματος","PAL","SECAM","NTSC"];
var deviceTitleTipsText = "Πατήστε ≡ για περισσότερες πληροφορίες. ";
var emptyListInfo = "Καμία συνδεδεμένη συσκευή στην τηλεόραση !";
var optionVideoListArray_1 = ["Λειτουργία εικόνας", "Επαναφορά ηχητ. Ρυθμίσεων", "Κατάσταση αναπαραγωγής", "Λειτουργία οθόνης", "Λειτουργία 3D", 
							  "Διακόπτης Α-Δ", "Βάθος πεδίου", "Υπότιτλοι", "Μουσική υπόκρουση", "Τίτλος", "Κεφάλαιο", "Πληροφορίες"];
var optionVideoListArray_2 = ["Λειτουργία εικόνας", "Επαναφορά ηχητ. Ρυθμίσεων", "Κατάσταση αναπαραγωγής", "Λειτουργία οθόνης", 
							  "Υπότιτλοι", "Μουσική υπόκρουση", "Τίτλος", "Κεφάλαιο", "Πληροφορίες"];
var bottomTipsText = ["Αναπαρ/Παύση", "Γρήγορη κίνηση προς τα πίσω", "Γρήγορη κίνηση μπροστά", "Λίστα αναπαραγωγής", "Pυθμίσεις"];
var picturePresetArray = ["Πρότυπο", "Dynamic", "Φυσική", "Κινηματογράφος", "Προσωπική"];
var videoPlayModeArray = ["Επανάληψη όλων", "Επανάληψη ενός", "Κανονικά"];
var screenModeHDArray = ["16:9", "4:3", "Cinerama", "Laaja zoomaus", "Zoomaus 2", "Laaja zoomaus 2", "Kapea zoomaus", "Αυτόματο"];
var screenModeSDArray = ["16:9", "4:3", "Cinerama", "14:9-Zoomaus", "16:9-Zoomaus  ", "16:9-Zoomaus ylös", "Αυτόματο"];
var Mode3DArray = ["Εκτός Λειτουρ.", "2D σε 3D", "Σε παράθεση", "Μισό πάνω-Μισό κάτω", "Εναλλαγή γραμμών"];
var videoOptionListArray = ["Εκτός Λειτουρ.", "Κομμάτι", "Υπότιτλοι", "Τίτλος", "Κεφάλαιο"];
var subMenuTitleText = "Υπότιτλοι";
var langMenuTitleText = "Γλώσσα ήχου";
var titleMenuTitleText = "Τίτλος";
var mode3DMenuTitleText = "Λειτουργία 3D";
var langInfoText = "Κομμάτι";
var STOP_RESUME_INFO = "Διακοπ-Συνέχιση";
var playListName = "όνομα  ";
var eb_tips = "Συμβουλές";
var ok_button = "ΟΚ";
var eb_info = ["Σφάλμα κωδικοποίησης ήχου.", "Σφάλμα κωδικοποίησης βίντεο. ", "Το αρχείο ήχου δεν υποστηρίζεται. ", 
			   "Μορφή βίντεο δεν υποστηρίζονται.", "Δε μπορεί να ανοίξει αυτό το αρχείο.", "Σφάλμα αναπαραγωγής. Δοκιμάστε ξανά.",
			   "Η μορφή του αρχείου δεν υποστηρίζεται.", "Ωχ! Η μονάδα αναπαραγωγής σταμάτησε να λειτουργεί. ",
			   "Η διαδρομή του αρχείου δεν υπάρχει ή δεν είναι έγκυρη.\n Τοποθετήστε ξανά το αποθηκευτικό μέσο και δοκιμάστε ξανά.",
			   "Συνέχεια αναπαραγωγής από την προηγούμενη\n κατάσταση αναπαραγωγής;"];
var picturePlayErrorTips = ["Αποτυχία φόρτωσης!!!","Η εικόνα είναι πολύ μεγάλη!!!","Σφάλμα δικτύου!!!","Σφάλμα νήματος!!!","Σφάλμα παραμέτρου!!!","Άγνωστο σφάλμα!!!"];
var frameTitleText = "Νέα συσκευή";
var eb_quit_info = "Είστε βέβαιοι ότι θέλετε να κλείσετε το πρόγραμμα;";
var eb_yes = "ΝΑΙ";
var eb_no = "ΟΧΙ";
var offinfo = "Εκτός Λειτουρ.";
var naInfo = "Κενό";
var consoleInfoArray = ["Γρήγορη κίνηση προς τα πίσω", "Γρήγορη κίνηση μπροστά", "Αναπαρ/Παύση", "Λίστα αναπαραγωγής"];
var cantOperateText = ["Η λειτουργία δεν υποστηρίζεται."];
var chapterChangeInfo = "Μόνο οι ενότητες από το 1 έως το XXXX είναι διαθέσιμες.";
var metaDataArray = ["Μεταδεδομένα Τίτλου/΄Εκδοσης: ", "Μεταδεδομένα ενότητας: ", "Μεταδεδομένα ήχου: ", "Μεταδεδομένα υποτίτλων: "];
var metaTitleInfo = "Τίτλος";
var metaChapterInfo = "Κεφάλαιο";
var videoLoadingInfo = "Ανάλυση...";
var listLoadingInfo = "Φόρτωση...";
var pgInfo = "Καταλληλότητα περιεχομένου: ";
var fileNameText = "όνομα  ";
var fileDateText = "Ημερομηνία";
var fileSizeText = "Μέγεθος";
var fileDurationText = "Διάρκεια";
var fileDirectorText = "Σκηνοθέτης";
var fileCopyrightText = "Πνευμ. Δικαιώματα";
var fileArtistText = "Καλλιτέχνης";
var fileAlbumText = "Άλμπουμ";
var fileGenreText = "Είδος";
var fileYearText = "Έτος";
var fileGenreText = "Είδος";
var mainListArray = ["Όλα", "Εικόνα", "Εικόνα", "Μουσική"];
var sortArray = ["όνομα  ", "Ημερομηνία"];
var parserArray = ["Κανονικά", "Αναδρομικά"];
var emptyTipsInfo = "Ωχ. Δε βρέθηκε υποστηριζόμενο αρχείο. ";
var emptyFolderInfo = "Ωχ. Δε βρέθηκε υποστηριζόμενο αρχείο. ";
var sortName = "Ταξινόμηση κατά";
var parserName = "Αναλυτής";
var divx_str1 = "Εγγραφή σε DivX(R)";
var divx_str2 = "Απενεργοποίηση DivX(R)";
var infor_str = "Πληροφορίες";
var quickMenuEmptyText = "Δεν υπάρχουν διαθέσιμες επιλογές.";

var musicSoundPresetArray = ["Πρότυπο", "Κινηματογράφος", "Μουσική", "Καθαρισμός φωνής", "Προσωπική"];
var musicInformationArray = ["όνομα  ", "Καλλιτέχνης", "Άλμπουμ", "Είδος:", "Έτος:", "Διάρκεια:"];
var playListName = "όνομα  ";
var playTipsInfo = ["Αναπαράγετε το πρώτο αρχείο.", "Αναπαράγετε το τελευταίο αρχείο."]
var musicNameInfo = "Name";
var musicArtistInfo = "Καλλιτέχνης";
var musicAlbumInfo = "Πληροφορίες";
var optionSoundPresetInfo = "Επαναφορά ηχητ. Ρυθμίσεων";
var optionBGMInfo = "Αναπαραγωγή στο παρασκήνιο";
var optionAudioOnlyInfo = "Μόνο ήχος";
var optionInfoText = "Πληροφορίες";

var remotePhoneConnecte = "Η συσκευή XXXX συνδέθηκε στην τηλεόραση!";
var tvRemoteTitle		= "Τηλεχειριστήριο";
var tvRemoteDeveloper	= "Η εφαρμογή αναπτύχθηκε από την TCL";
var tvRemoteDeviceTitle	= "Όνομα συσκευής:";
var remoteOption		= ["Κοινή χρήση πολυμέσων","Τηλεχειριστήριο","Βοήθεια","Σχετικά με","Έξυπνη σύνδεση"];
var remotebottom		= "Κατεβάστε την εφαρμογή \"TV Remote\" στο smartphone σας";
var remoteStage			= ["Android","IOS"];
var sharingReminds		= ["Μπορείτε να προβάλετε φωτογραφίες, βίντεο και μουσική στην τηλεόραση από το τηλέφωνό σας.",
							"Βήματα: \n   1. Ξεκινήστε την εφαρμογή \"TV Remote\" στο τηλέφωνο. Συνδέστε το τηλέφωνό σας με την τηλεόραση στο ίδιο δίκτυο WiFi.\n   2. Ξεκινήστε την εφαρμογή \"Media Sharing\" για να εξερευνήσετε τα αρχεία πολυμέσων.\n   3. Στείλτε τα αρχεία πολυμέσων στην τηλεόραση για αναπαραγωγή (με μία από τις παρακάτω επιλογές)",
							"      α) Σύρετε το φάκελο/αρχείο στο εικον TV στο πάνω μέρος της οθόν.\n      β) Κουν το τηλ προς την TV για να ανοίξει το 1ο αρχ.\n      γ) Αναπ αρχ μέσων σε τηλ & πατήστε εικ κοιν χρήσης με TV.",
							"   4. Κατά την αναπ από TV, κουν το τηλ για μετάβ σε προηγ ή επόμ αρχείο."];
var controlReminds		= ["Χρήση του τηλεφώνου ως τηλεχειριστήριο για το χειρισμό της τηλεόρασης.",
							" ",
							"Βήματα: \n   1. Ξεκινήστε την εφαρμογή \"TV Remote\" στο τηλέφωνο. Συνδέστε το τηλέφωνό σας με την τηλεόραση στο ίδιο δίκτυο WiFi.\n   2. Πατήστε \"Remote Control\" για να λειτουργήσετε την τηλεόραση. "];
var helpDeviceWords		= "Αλληλεπίδραση πολλών οθονών";
var helpBottom			= "Στην εποχή της τεχνολογίας cloud οι έξυπνες συσκευές, όπως π.χ. τα τηλέφωνα και οι τηλεοράσεις, συνδέονται μεταξύ τους. Μοιραστείτε τα περιεχόμενα πολυμέσων σας με την οικογένειά σας σε περισσότερες οθόνες και χειριστείτε την τηλεόραση από το τηλέφωνό σας! ";
var helpReminds			= ["Προετοιμασία\n   1. Κατεβάστε και εγκαταστήστε την εφαρμογή \"TV Remote\" από το Google Play ή το Apple Store.\n   2. Συνδέστε το τηλέφωνό σας στην τηλεόραση από το ίδιο δίκτυο WiFi.",
							" ",
							"Συνιστώμενα τηλέφωνα\n   1. CPU: πάνω από 800MHz\n   2. Μνήμη: τουλάχιστον 80MB ελεύθερος χώρος",
							" ",
							"Αποποίηση ευθυνών\n Εάν η εφαρμογή \"TV Remote\" δεν είναι διαθέσιμη στο τηλέφωνό σας , επικοινωνήστε με τον κατασκευαστή του τηλεφώνου."];
var helpButtons			= ["Προηγούμεν","Επόμενο"];
var aboutReminds		= ["Τηλεχειριστήριο","Η εφαρμογή αναπτύχθηκε από την TCL"];
var aboutExit			= "Έξοδος";
var smartReminds		= ["Γρήγορη και έξυπνη σύνδεση ανάμεσα στην τηλεόραση και το τηλέφωνο.",
							" ",
							"Βήματα \n   1. Συνδέστε την τηλεόραση και το smartphone στο ίδιο δίκτυο. Πατήστε \"TV Remote\" στο smartphone.\n   2. Πατήστε \"Smart Connect\" για να σαρώσετε κωδικό QR.\n   3. Με την τηλεόραση να βρίσκεται στη λειτουργία προβολής, πατήστε το πλήκτρο INFO στο τηλεχειριστήριο της τηλεόρασης για 4 δευτερόλεπτα. Θα εμφανιστεί ο κωδικός QR σε πλήρη οθόνη. ",];
var smartQRReminds		= ["Πατήστε την επιλογή Smart Connect στο τηλεχειριστήριο της τηλεόρασης στο τηλέφωνό σας και σαρώστε τον κωδικό QR για να συνδέσετε την τηλεόραση και το τηλέφωνο γρήγορα.",
							"Ο κωδικός QR περιέχει τις πληροφορίες του λογαριασμού LAN. Διατηρήστε τον σε καλή κατάσταση. "];
							

var consoleTipArray = ["Προηγούμεν","Επόμενο","Κονσόλα","Λίστα αναπαραγωγής"];							
var optionInfoArray = ["Λειτουργία εικόνας","Κατάσταση αναπαραγωγής","Διάρκεια","Εφέ","Πληροφορίες"];

var playModeArray = ["Κανονικά","Ανακάτεμα","Επανάληψη"];
var durationArray = ["Μικρό (5 δευτ.)", "Μεσαίο (10 δευτ.)", "Μεγάλο (15 δευτ.)"];
var effectArray = ["Κανένα", "Περιστροφή", "Σκούπα Δεξιά", "Σκούπα Αριστερά", "Σκούπα πάνω", "Σκούπα κάτω", "Κουτί μέσα", "Κουτί έξω", "Τυχαία"];
var infoArray = ["Όνομα:","Μέγεθος:","Ημερομηνία:","Τοποθεσία"];

var picturePresetBarTitleInfo = "Λειτουργία εικόνας";
var picturePresetBarArray = ["Πρότυπο","Dynamic","Σινεμά","Κινηματογράφος","Προσωπική"];
var upTipsInfo = "Μετακίνηση εικόνας"; //add yums 2014-10-10
var consoleTipsArray = ["Κονσόλα","Προηγούμεν","Επόμενο","Λίστα αναπαραγωγής","Pυθμίσεις"];  //add yums 2014-10-10
var pictureMoveTipsArray = ["Πατήστε το βελάκι προς τα ΔΕΞΙΑ ξανά για αναπαραγωγή της επόμενης εικόνας ","Πατήστε το βελάκι προς τα ΑΡΙΣΤΕΡΑ ξανά για αναπαραγωγή της προηγούμενης εικόνας ","Πατήστε το βελάκι ΚΑΤΩ ξανά για να εμφανίσετε τη λίστα αναπαραγωγής"]; //add yums 2014-10-10

var optionPvrListArray = ["Λειτουργία εικόνας","Επαναφορά ηχητ. Ρυθμίσεων", "Λειτουργία οθόνης", "Λειτουργία 3D", "Υπότιτλοι", "Μουσική υπόκρουση", "Πληροφορίες"];							
	
var titleSpanFirstArray = ["Έλεγχος & σύνδεση","Βασικές λειτουργίες","ΕΦΑΡΜΟΓΕΣ","TV","Pυθμίσεις","Συχνά ρωτήσω ερώτηση"];
var titleSpanSecondArray = [["Τηλεχειριστήριο","Πλήκτρα πίνακα ελέγχου","Εύκολη Πλοήγηση","Σύνδεση τηλεόρασης","Σύνδεση τηλεόρασης","Σύνδεση τηλεόρασης","Ασύρματη"],["Εκκίνηση","Γραμμή κατάστασης","Πηγή"],["Αναπαραγωγή εφαρμογών","Πολυμέσα","Τηλεχειριστήριο"],["Ρύθμιση καναλιού και έντασης ήχου ","Λίστα καναλιών","EPG","Κανάλια εγκατ.","Αγαπημένα κανάλια"],["Ρύθμιση εικόνας","Ρύθμιση ήχου","Ρύθμιση καναλιών","Ενημέρωση Λογισμ.","Γλώσσα","Κλείδωμα από τους γονείς"],["Συχνές Ερωτήσεις","Συχνές Ερωτήσεις","Αντιμετώπιση προβλημάτων","Αντιμετώπιση προβλημάτων","Όροι και προϋποθέσεις"]];
var contentSpan1_1Array =[["ΙΣΧΥΣ:","ΠΗΓΗ:","ΡΥΘΜΙΣΕΙΣ:","ΕΠΙΛΟΓΗ:","ΠΙΣΩ:","ΠΛΗΡΟΦΟΡΙΕΣ:","ΑΡΧΙΚΗ:","ΕΞΟΔΟΣ:","ΛΙΣΤΑ:"],
    ["Ενεργοποίηση της συσκευής ή μετάβαση στη λειτουργία αναμονής",
        "Επιλογή πηγής εισόδου",
        "Για εμφάνιση του μενού Ρυθμίσεων",
        "Για εμφάνιση του μενού Επιλογής",
        "Επιστροφή στο προηγούμενο μενού ή έξοδος από μια ανοιχτή εφαρμογή",
        "Εμφανίζει πληροφορίες προγράμματος",
        "Για μετάβαση στην αρχική σελίδα της SmartTV",
        "Επιστροφή στο προηγούμενο μενού ή έξοδος από μια ανοιχτή εφαρμογή",
        "Εμφανίζει τη λίστα με τα κανάλια"]];
var contentSpan1_2Array = ["Προηγούμενο κανάλι","Επόμενο κανάλι","Αύξηση έντασης ήχου","Μείωση έντασης ήχου","Μετάβαση στην αρχική σελίδα","Επιβεβαίωση επιλογής","Αναμονή/Ενεργοποίηση"];
var contentSpan1_3Array = ["OK/Οδηγός","Επόμενο κανάλι","Προηγούμενο κανάλι","Μείωση έντασης ήχου","Αύξηση έντασης ήχου","Διαθέσιμα με τα βελάκια σε ορισμένες λειτουργίες."];
var contentSpan1_4Array = ["LAN","HDMI ( MHL )","HDMI","HDMI ( ARC )","Προσαρμογέας AV OUT  ","LAN","Smartphone","Υπολογιστής/ Αποκωδικοποιητής/ DVD","Ενισχυτής ήχου","Ενισχυτής ήχου/Οθόνη","Η τηλεόρασή σας μπορεί να μη διαθέτει όλες τις υποδοχές."];
var contentSpan1_5Array = ["USB 2.0","USB 3.0","Ακουστικά","Προσαρμογέας AV IN  ","SPDIF","Προσαρμογέας CMP AUDIO IN  ","Προσαρμογέας CMP IN (YPbPr)  ","Συσκευές USB  ","Συσκευές USB  ","Ακουστικά","DVC/Κονσόλα παιχνιδιών/ Αποκωδικοποιητής/DVD","Ενισχυτής ήχου","DVC/Κονσόλα παιχνιδιών/ Αποκωδικοποιητής/DVD","Η τηλεόρασή σας μπορεί να μη διαθέτει όλες τις υποδοχές."];
var contentSpan1_6Array = ["Κοινή διεπαφή","SD","VGA","SCART","Mini SCART","ANTENNA IN","Κάρτα PCMCIA","Κάρτα SD","PC","Set-top box/DVD","Κεραία/Καλώδιο/Δορυφόρος","Η τηλεόρασή σας μπορεί να μη διαθέτει όλες τις υποδοχές."];
var contentSpan1_7Array = ["Δισκίο","PC","Δρομολογητή","Τηλέφωνο","TV"];
var contentSpan1_8Array = ["Αλλαγή λειτουργίας/Ενεργοποίηση","Πατήστε παρατεταμένα για μετάβαση στον χρονοδιακόπτη διακοπής λειτουργίας","Κάτω","Πάνω","Ένταση/Κανάλι/Πηγή"];

var contentSpan2Array = [["Πατήστε τα βελάκια για να εμφανίσετε την Αρχική Σελίδα.","Στη συνέχεια πατήστε ΟΚ για να παρακολουθήσετε ένα από τα προτεινόμενα προγράμματα ή για να μπείτε στην εφαρμογή. "],["Εμφανίζει την ημερομηνία, το δίκτυο, τις συσκευές, κλπ στην πάνω δεξιά γωνία της οθόνης. "],["Επιλέγει πηγή εισόδου από τις συσκευές που είναι συνδεδεμένες στην τηλεόραση μέσω διαφορετικών θυρών, όπως TV, AV, HDMI, κλπ"]];

var contentSpan3Array = ["Δείτε και απολαύστε τις αγαπημένες σας εφαρμογές από τη σελίδα Smart TV","Δείτε φωτογραφίες, παρακολουθήστε βίντεο και αναπαράγετε μουσική από συσκευή αποθήκευσης USB.","Συνδέστε την τηλεόραση και το smartphone ή το tablet σας στο ίδιο LAN","Κάντε κλικ στο nScreen ή στην εφαρμογή TV Remote σε smartphone ή σε tablet","Μοιραστείτε φωτογραφίες, βίντεο και μουσική σε πολλαπλές οθόνες με την οικογένειά  και χειριστείτε την τηλεόραση  από το smartphone σας "];

var contentSpan4Array = [["Πατήστε τα βελάκια ΠΑΝΩ/ΚΑΤΩ για να αλλάξετε κανάλι. ","Πατήστε τα βελάκια ΑΡΙΣΤΕΡΑ/ΔΕΞΙΑ για να ρυθμίσετε την ένταση του ήχου. "],["Πατήστε LIST στο τηλεχειριστήριο για να εμφανίσετε τη λίστα με τα κανάλια. ","Πατήστε τα βελάκια ΠΑΝΩ/ΚΑΤΩ για να επιλέξετε κανάλι"],["Η λειτουργία EPG είναι ένας οδηγός στην οθόνη που εμφανίζει τα προγραμματισμένα τηλεοπτικά προγράμματα. Μπορείτε να εξερευνήσετε, να επιλέξετε, να προβάλετε και κάνετε εγγραφή προγραμμάτων. "],["Αναζήτηση και αποθήκευση καναλιών "],["Προσθέστε ή αλλάξτε τα αγαπημένα σας κανάλια στη Λίστα καναλιών "]];

var contentSpan5Array = ["Απολαύστε τα αγαπημένα σας προγράμματα από την εφαρμογή βίντεο "];

var contentSpan6Array = [["Πατήστε Επιλογή για να εμφανίσετε τις επιλογές ρύθμισης του συστήματος ","Μπείτε στο μενού των ρυθμίσεων εικόνας για να αλλάξετε τις τιμές"],["Πατήστε Επιλογή για να εμφανίσετε τις επιλογές ρύθμισης του συστήματος ","Μπείτε στις Ρυθμίσεις Ήχου για να δείτε τις επιλογές"],["Πατήστε Επιλογή για να εμφανίσετε τις επιλογές ρύθμισης του συστήματος ","Μπείτε στις ρυθμίσεις καναλιών για να ρυθμίσετε τις επιλογές"],["Ενημέρωση της τηλεόρασης όταν υπάρχει διαθέσιμη ενημέρωση λογισμικού"],["Μπορείτε να επιλέξετε την προτιμώμενη γλώσσα μενού"],["Επιτρέπει στους γονείς να κλειδώσουν  κανάλια ή προγράμματα τα οποία είναι ακατάλληλα για τα παιδιά"]];

var contentSpan7_1Array = [["Δεν εμφανίζεται εικόνα, και δεν ακούγεται ήχος","Ελέγξτε εάν δουλεύουν οι ασφάλειες και τα κυκλώματα ","Συνδέστε μια άλλη ηλεκτρική συσκευή στην πρίζα για να εξακριβώσετε εάν έχει ρεύμα ή αν είναι συνδεδεμένη στο ρεύμα ή συσκευή.","Το βύσμα δεν κάνει καλή επαφή με την πρίζα","Ελέγξτε την πηγή σήματος."],["Υπάρχει εικόνα αλλά όχι ήχος","Πατήστε το βελάκι ΠΑΝΩ για να αυξήσετε την ένταση ήχου","Λάθος ρύθμιση ήχου.","Κακό σήμα από το σταθμό μετάδοσης."],["Ακούγεται ήχος, αλλά δεν υπάρχει εικόνα.","Ρύθμιση της φωτεινότητας και της αντίθεσης.","Κακό σήμα από το σταθμό μετάδοσης.","Ελέγξτε ένα έχει ρυθμιστεί στη λειτουργία μόνο ήχου. "]];
var contentSpan7_2Array = [["Παρεμβολή ραδιοσυχνοτήτων","Αυτή η παρεμβολή παράγει κινούμενα κύματα ή διαγώνιες ραβδώσεις, και σε μερικές περιπτώσεις, απώλεια της αντίθεσης στην εικόνα. Βρείτε και αφαιρέστε την εστία ραδιοφωνικών παρεμβολών."],["Δεν εμφανίζεται χρώμα","Διαμόρφωση ρυθμίσεων χρώματος.","Δοκιμάστε άλλο κανάλι. Μπορεί να γίνει λήψη ασπρόμαυρου προγράμματος. "],["Το τηλεχειριστήριο δεν λειτουργεί","Αντικαταστήστε τις μπαταρίες.","Οι μπαταρίες δεν έχουν τοποθετηθεί σωστά. Δεν έχει συνδεθεί το τροφοδοτικό της τηλεόρασης. "]];
var contentSpan7_3Array = [["Το περιεχόμενο της συσκευής USB δεν εμφανίζεται ","Ελέγξτε εάν η συσκευή USB είναι συμβατή με την τηλεόραση.","Ελέγξτε εάν τα αρχεία ήχου και εικόνας υποστηρίζονται από την τηλεόραση. "],["Αναπαραγωγή χωρίς ήχο ","Η ήχος στο βίντεο δεν υποστηρίζεται από την τηλεόραση."],["Τα αρχεία δεν αναπαράγονται σωστά. ","Η μετάδοση δεδομένων του αποθηκευτικού μέσου USB μπορεί να περιορίσει το ρυθμό μετάδοσης στην τηλεόραση. "]];
var contentSpan7_4Array = [["Τι πρέπει να προσέξω; Πότε πρέπει να κάνω ενημέρωση λογισμικού;","Μη διακόπτετε την τροφοδοσία όταν γίνεται ενημέρωση λογισμικού. ","Μη χρησιμοποιείτε το τηλεχειριστήριο όταν κάνετε ενημέρωση λογισμικού. ","Η ενημέρωση λογισμικού μπορεί να διαρκέσει λίγο περισσότερο. "],["Δεν αλλάζει η διεπαφή της τηλεόρασης μετά την ενημέρωση του λογισμικού. ","Σε συγκεκριμένες περιπτώσεις, η ενημέρωση του λογισμικού, εκτός από την ενημέρωση και την προσθήκη λειτουργιών, μπορεί επίσης να βελτιώσει την απόδοση της τηλεόρασης, χωρίς σημαντικές αλλαγές στην επιφάνεια εργασίας. Επίσης, η διεπαφή στην τηλεόραση μπορεί να παγώσει μερικές φορές."]];
var termsTitle = "Όροι και προϋποθέσεις";
var termsConditions = ["(Νομική δήλωση) της TCL - κατασκευαστής αυτής της τηλεόρασης.","Λόγω των διαφορετικών δυνατοτήτων των προϊόντων με υποστήριξη υπηρεσιών SmartTV και των περιορισμών ως προς τα διαθέσιμα περιεχόμενα, ενδέχεται ορισμένα χαρακτηριστικά, εφαρμογές και υπηρεσίες να μην προσφέρονται από όλες τις συσκευές ή σε όλες τις περιοχές. Επίσης, ορισμένα χαρακτηριστικά SmartTV ενδέχεται να προϋποθέτουν τη χρήση πρόσθετων περιφερειακών συσκευών ή την πληρωμή συνδρομής, τα οποία δεν περιλαμβάνονται στην αγορά του προϊόντος. Παρακαλούμε επισκεφτείτε τη διαδικτυακή μας τοποθεσία για περισσότερες πληροφορίες σχετικά με συγκεκριμένες συσκευές και τη διαθεσιμότητα περιεχομένων. Οι υπηρεσίες και η διαθεσιμότητα περιεχομένων SmartTV υπόκεινται σε αλλαγή χωρίς προηγούμενη ειδοποίηση. \n   Το σύνολο του περιεχομένου και των υπηρεσιών που είναι προσβάσιμα μέσω αυτής της συσκευής ανήκουν σε τρίτους κατασκευαστές και προστατεύονται με πνευματικά δικαιώματα (copyright), ευρεσιτεχνίες, εμπορικά σήματα ή/και άλλους νόμους περί πνευματικής ιδιοκτησίας. Αυτά τα περιεχόμενα και οι υπηρεσίες προσφέρονται αποκλειστικά για προσωπική μη εμπορική χρήση. Απαγορεύεται η χρήση οποιουδήποτε περιεχομένου ή οποιασδήποτε υπηρεσίας με τρόπο που δεν έχει εγκριθεί από τον κάτοχο του περιεχομένου ή τον πάροχο της υπηρεσίας. Χωρίς περιορισμό των ανωτέρω και εφόσον δεν επιτρέπεται ρητά από τον εκάστοτε κάτοχο του περιεχομένου ή πάροχο της υπηρεσίας, απαγορεύεται η τροποποίηση, αντιγραφή, επανέκδοση, φόρτωση, δημοσίευση, μετάδοση, μετάφραση, πώληση, δημιουργία παράγωγων έργων, εκμετάλλευση ή διανομή με οποιονδήποτε τρόπο και οποιοδήποτε μέσο των περιεχομένων και υπηρεσιών που προσφέρονται μέσω αυτής της συσκευής. \n   ΑΝΑΓΝΩΡΙΖΕΤΕ ΡΗΤΑ ΚΑΙ ΣΥΜΦΩΝΕΙΤΕ ΟΤΙ Η ΧΡΗΣΗ ΤΗΣ ΣΥΣΚΕΥΗΣ ΓΙΝΕΤΑΙ ΑΠΟΚΛΕΙΣΤΙΚΑ ΥΠ’ ΕΥΘΥΝΗ ΣΑΣ ΚΑΙ ΟΤΙ ΑΝΑΛΑΜΒΑΝΕΤΕ ΤΟ ΣΥΝΟΛΟ ΤΟΥ ΚΙΝΔΥΝΟΥ ΩΣ ΠΡΟΣ ΤΗΝ ΙΚΑΝΟΠΟΙΗΤΙΚΗ ΠΟΙΟΤΗΤΑ, ΑΠΟΔΟΣΗ ΚΑΙ ΑΚΡΙΒΕΙΑ. Η ΣΥΣΚΕΥΗ ΚΑΙ ΟΛΑ ΤΑ ΠΕΡΙΕΧΟΜΕΝΑ ΚΑΙ ΟΙ ΥΠΗΡΕΣΙΕΣ ΤΡΙΤΩΝ ΜΕΡΩΝ ΠΡΟΣΦΕΡΟΝΤΑΙ «ΩΣ ΕΧΟΥΝ», ΧΩΡΙΣ ΚΑΜΙΑ ΕΓΓΥΣΗ, ΡΗΤΗ Ή ΣΙΩΠΗΡΗ. Η TCL ΑΠΟΠΟΙΕΙΤΑΙ ΡΗΤΑ ΟΠΟΙΑΣΔΗΠΟΤΕ ΕΓΓΥΗΣΗΣ ΚΑΙ ΠΡΟΫΠΟΘΕΣΕΩΝ, ΡΗΤΩΝ Ή ΣΙΩΠΗΡΩΝ, ΟΣΟΝ ΑΦΟΡΑ ΤΗ ΣΥΣΚΕΥΗ, ΤΑ ΠΕΡΙΕΧΟΜΕΝΑ ΚΑΙ ΤΙΣ ΥΠΗΡΕΣΙΕΣ, ΣΥΜΠΕΡΙΛΑΜΒΑΝΟΜΕΝΩΝ ΧΩΡΙΣ ΠΕΡΙΟΡΙΣΜΟ ΤΩΝ ΕΓΓΥΗΣΕΩΝ ΕΜΠΟΡΕΥΣΙΜΟΤΗΤΑΣ, ΙΚΑΝΟΠΟΙΗΤΙΚΗΣ ΠΟΙΟΤΗΤΑΣ, ΚΑΤΑΛΛΗΛΟΤΗΤΑΣ ΓΙΑ ΣΥΓΚΕΚΡΙΜΕΝΟ ΣΚΟΠΟ, ΑΚΡΙΒΕΙΑΣ, ΑΠΡΟΣΚΟΠΤΗΣ ΑΠΟΛΑΥΣΗΣ ΚΑΙ ΜΗ ΠΑΡΑΒΙΑΣΗΣ ΤΩΝ ΔΙΚΑΙΩΜΑΤΩΝ ΤΡΙΤΩΝ ΜΕΡΩΝ. Η TCL ΔΕΝ ΕΓΓΥΑΤΑΙ ΤΗΝ ΑΚΡΙΒΕΙΑ, ΕΓΚΥΡΟΤΗΤΑ, ΕΠΙΚΑΙΡΟΤΗΤΑ, ΝΟΜΙΜΟΤΗΤΑ Ή ΠΛΗΡΟΤΗΤΑ ΤΩΝ ΠΕΡΙΕΧΟΜΕΝΩΝ ΚΑΙ ΥΠΗΡΕΣΙΩΝ ΠΟΥ ΔΙΑΤΙΘΕΝΤΑΙ ΜΕΣΩ ΑΥΤΗΣ ΤΗΣ ΣΥΣΚΕΥΗΣ ΚΑΙ ΔΕΝ ΕΓΓΥΑΤΑΙ, ΕΠΙΣΗΣ, ΟΤΙ Η ΣΥΣΚΕΥΗ, ΤΑ ΠΕΡΙΕΧΟΜΕΝΑ Ή ΟΙ ΥΠΗΡΕΣΙΕΣ ΘΑ ΑΝΤΑΠΟΚΡΙΝΟΝΤΑΙ ΣΤΙΣ ΑΠΑΙΤΗΣΕΙΣ ΣΑΣ Ή ΟΤΙ Η ΛΕΙΤΟΥΡΓΙΑ ΤΗΣ ΣΥΣΚΕΥΗΣ Ή ΤΩΝ ΥΠΗΡΕΣΙΩΝ ΘΑ ΠΡΑΓΜΑΤΟΠΟΙΕΙΤΑΙ ΧΩΡΙΣ ΔΙΑΚΟΠΕΣ Ή ΣΦΑΛΜΑΤΑ. ΣΕ ΚΑΜΙΑ ΠΕΡΙΠΤΩΣΗ, ΣΥΜΠΕΡΙΛΑΜΒΑΝΟΜΕΝΗΣ ΤΗΣ ΑΜΕΛΕΙΑΣ, Η TCL ΔΕΝ ΦΕΡΕΙ ΚΑΜΙΑ ΕΥΘΥΝΗ -ΣΥΜΒΑΤΙΚΗ Ή ΑΔΙΚΟΠΡΑΞΙΑΣ - ΓΙΑ ΟΠΟΙΑΔΗΠΟΤΕ ΑΜΕΣΗ, ΕΜΜΕΣΗ, ΘΕΤΙΚΗ, ΕΙΔΙΚΗ Ή ΑΠΟΘΕΤΙΚΗ ΖΗΜΙΑ, ΔΙΚΗΓΟΡΙΚΗ ΑΜΟΙΒΗ, ΔΑΠΑΝΕΣ Ή ΆΛΛΟΥ ΕΊΔΟΥΣ ΖΗΜΙΕΣ ΠΟΥ ΕΝΔΕΧΕΤΑΙ ΝΑ ΠΡΟΚΥΨΟΥΝ ΑΠΟ Ή ΣΕ ΣΧΕΣΗ ΜΕ ΟΠΟΙΕΣΔΗΠΟΤΕ ΠΛΗΡΟΦΟΡΙΕΣ ΟΙ ΟΠΟΙΕΣ ΠΕΡΙΛΑΜΒΑΝΟΝΤΑΙ ΣΕ Ή ΠΡΟΚΥΠΤΟΥΝ ΩΣ ΑΠΟΤΕΛΕΣΜΑ ΤΗΣ ΧΡΗΣΗΣ ΤΗΣ ΣΥΣΚΕΥΗΣ Ή ΟΠΟΙΟΥΔΗΠΟΤΕ ΠΕΡΙΕΧΟΜΕΝΟΥ Ή ΥΠΗΡΕΣΙΑΣ ΣΤΗΝ ΟΠΟΙΑ ΕΧΕΤΕ ΠΡΟΣΒΑΣΗ ΕΣΕΙΣ Ή ΟΠΟΙΟΔΗΠΟΤΕ ΤΡΙΤΟ ΜΕΡΟΣ, ΑΚΟΜΗ ΚΑΙ ΑΝ ΕΧΕΙ ΕΝΗΜΕΡΩΘΕΙ ΓΙΑ ΤΗΝ ΠΙΘΑΝΟΤΗΤΑ ΠΡΟΚΛΗΣΗΣ ΤΕΤΟΙΩΝ ΖΗΜΙΩΝ. \n   Οι υπηρεσίες τρίτων μερών υπόκεινται ανά πάσα στιγμή σε αλλαγή, αναστολή, κατάργηση, λήξη, διακοπή, ή απενεργοποίηση της πρόσβασης χωρίς προειδοποίηση. Η TCL (κατασκευάστρια εταιρία των τηλεοράσεων Thomson) δεν υπόσχεται και δεν εγγυάται ότι τα περιεχόμενα και οι υπηρεσίες θα διατίθενται για οποιοδήποτε χρονικό διάστημα. Τα περιεχόμενα και οι υπηρεσίες διανέμονται από τρίτα μέρη μέσω δικτύων και εγκαταστάσεων μετάδοσης σε σχέση με τα οποία η TCL δεν ασκεί κανέναν έλεγχο. Χωρίς περιορισμό του γενικού χαρακτήρα της παρούσας αποποίησης ευθυνών, η TCL αποποιείται ρητά οποιασδήποτε ευθύνης ή υπευθυνότητας σχετικά με οποιαδήποτε αλλαγή, διακοπή, απενεργοποίηση, κατάργηση ή αναστολή των περιεχομένων ή υπηρεσιών που προσφέρονται μέσω αυτής της συσκευής. Η TCL μπορεί σε οποιαδήποτε περίπτωση να επιβάλει όρια στη χρήση ή την πρόσβαση σε ορισμένες υπηρεσίες ή περιεχόμενα χωρίς προειδοποίηση και χωρίς να φέρει καμία ευθύνη. Η TCL δεν φέρει καμία ευθύνη ή υπευθυνότητα ως προς την εξυπηρέτηση πελατών σε σχέση με τα περιεχόμενα και τις υπηρεσίες. Οποιεσδήποτε ερωτήσεις ή αιτήματα εξυπηρέτησης σε σχέση με τα περιεχόμενα ή τις υπηρεσίες θα πρέπει να υποβάλλονται απευθείας στον εκάστοτε πάροχο των περιεχομένων ή υπηρεσιών."];

var noChannelListRemind        = ["Δε βρέθηκαν κανάλια. Η λίστα με τα κανάλια θα είναι διαθέσιμη μετά τη σάρωση των καναλιών. ","Σάρωση Καναλιού"];
var closeSubtitleRemind   = "Η λειτουργία θα είναι διαθέσιμη μόλις απενεργοποιηθούν οι υπότιτλοι. Θέλετε να κάνετε τη ρύθμιση τώρα;";

var estickerTitles = ["Μοναδικά ρεαλιστική εικόνα","Ζωντανά χρώματα","Ρεαλιστική αναπαράσταση κίνησης","Δυναμική ποιότητα εικόνας","Υποστηρίζει ανάλυση SR UHD  ","Δείτε τον κόσμο τρισδιάστατα","Μεγαλύτερη απόδοση","Υποστηρίζει περιεχόμενο με ανάλυση 4K","Απολαύστε την περιήγηση στο Ίντερνετ","Πρόσβαση σε επιπλέον περιεχόμενο ","Ολοκληρωμένοι ψηφιακοί δέκτες","Συνδέστε όλες τις συσκευές","Διάφορες πηγές 4K","Περιεχόμενο USB  ","Πάρα πολύ γρήγορο WIFI","Περιεχόμενο από κινητές συσκευές στην τηλεόραση","Περιεχόμενο κινητής συσκευής","Τοπικό περιεχόμενο","Έχει εγκριθεί από την DivX","Απίθανη εικόνα","Υποστηρίζει Canal  ","TDT Premium"];
var estickerDescriptions = ["Μια μοναδική εμπειρία προβολής με εικόνες τετραπλάσιας ανάλυσης Full HD σε οθόνη UHD  ","Το ευρύ χρωματικό πεδίο δίνει ατμόσφαιρα στις σκηνές με ζωηρές κόκκινες και σμαραγδένιες πράσινες αποχρώσεις","Η λειτουργία παρεμβολής καρέ 4K και ο οπίσθιος φωτισμός εξαλείφει τη θαμπάδα από την κινούμενη εικόνα","Η ζωντάνια της εικόνας ενισχύεται και δημιουργείται μια πραγματικά δυναμική απεικόνιση με λαμπερή αντίθεση","Απολαύστε τηλεοπτικά προγράμματα και δίσκους Blu-Ray με μοναδική κρυστάλλινη διαύγεια χάρις στην τεχνολογία Super Resolution","Παρακολουθήστε τηλεόραση και μια μεγάλη γκάμα περιεχομένου σε αληθινή τρισδιάστατη εικόνα 3D TV","Ο επεξεργαστής τετραπλού πυρήνα προσφέρει ομαλές διαδραστικές λειτουργίες, ενισχυμένη απόδοση για μια μοναδική εμπειρία ψυχαγωγίας","Υποστηρίζει το πρότυπο codec HEVC (H.265) για τη μελλοντική διάθεση περιεχομένου σε ανάλυση 4K","Τεράστια γκάμα εφαρμογών, υπηρεσιών VOD, τηλεοπτικού προγράμματος και δυνατότητα περιήγησης στο Ίντερνετ. ","Απολαύστε περισσότερες υπηρεσίες και περιεχόμενο από τα αγαπημένα σας κανάλια ","Παρακολουθήστε τηλεοπτικά κανάλια σε υψηλή ανάλυση, χωρίς αποκωδικοποιητή","Μπορείτε να συνδέσετε εύκολα  τις ψηφιακές συσκευές του σπιτιού σας","Η τηλεόραση που είναι κατάλληλη για μελλοντικές χρήσεις. Υποστηρίζει αναπαραγωγή 4K 50/60Hz μέσω HDMI 2.0 με HDCP 2.2","Εμφανίστε φωτογραφίες ή βίντεο απευθείας από μονάδα USB, σκληρό δίσκο κάμερα, σε οθόνη με ανάλυση 4K","Η τελευταία λέξη της τεχνολογίας 2x2 MIMO και AC προσθέτει μοναδικές ταχύτητες πρόσβασης στο Ίντερνετ","Απολαύστε φωτογραφίες, βίντεο, και εφαρμογές από φορητές συσκευές στη μεγάλη οθόνη, χάρη στην οθόνη τεχνολογία δημιουργίας ειδώλου οθόνης","Μπορείτε να εμφανίσετε φωτογραφίες, βίντεο και εφαρμογές από smartphone ή tablet στη μεγάλη οθόνη","Εμφανίστε σε μεγάλη οθόνη περιεχόμενο όπως φωτογραφίες και βίντεο από συσκευές που είναι συνδεδεμένες στο τοπικό δίκτυο","Αναπαράγετε ταινίες που σας ανήκουν ή έχετε ενοικιάσει μέσω DivX","Εξαιρετικά μικρή πρόσοψη και λεπτή σχεδίαση","Έχει δοκιμαστεί και εγκριθεί από την Canal+","Έχει δοκιμαστεί και εγκριθεί από την TDT Premium"];							

var eManualTextArray = ["Ηλεκ. Εγχειρίδιο","Όλες οι εικόνες είναι ενδεικτικές."];
var frontPanelRemind = "Μπροστ. ταμπλό κλειδωμ";
var eRPRemind		 = "Η λειτουργία του καταστήματος δεν ικανοποιεί την αίτηση ERP. Είστε σίγουρος?";	
var noRelatedChannel = "Δεν υπάρχει σχετικό κανάλι";
var option0624Name          = ["BOP","BFS","Συμβάν ανά Συμβάν","GetUserID","BGM","Reset all","Επαναφορά shop","NRM","DVB-T2 και επιλογή χώρας","Λειτουργία HbbTV"];
var DVBT2AndChoice = ["Εντός Λειτουρ.","Ανά χώρα","Εκτός Λειτουρ."];
var hbbtvServiceRemind = "Υπηρεσία HbbTV σύντομα κοντά σας.";
var insertWord = "Εισαγωγή";		
var viewDetail = "Λεπτομέρειες";							

var remindOAD  = "Ενημέρωση λογισμικού. Μια νέα συνιστώμενη ενημέρωση λογισμικού ίσως υπάρχει σε ένα άλλο κανάλι. Αν δέχεστε να το κατεβάσετε, μπορεί να αλλάξει προς το κανάλι αυτόματα. Θα θέλατε να το κάνετε τώρα;";

var LEDStatus = ["Αναβοσβήνει", "Κανονικά","Εκτός Λειτουρ."];
var netFlixRemind = "Η λειτουργία αυτή θα διακόψει την πρόσβαση στις υπηρεσίες Netflix, μέχρι να συνδεθείτε ξανά.";
var ESNExplanation = "Ηλεκτρονικός σειριακός αριθμός";
var resetShopRemind = "Αυτή τη στιγμή εκτελείται επαναφορά συστήματος, μην απενεργοποιήσετε την τηλεόρασή σας";
var initialSelectOption = "Πραγματοποιήστε μία επιλογή:";
var databaseRemind   = "Το σύστημα αναγνώρισε τη βάση δεδομένων ως κατεστραμμένη για κάποιον άγνωστο λόγο και την αναδημιούργησε αυτόματα, πατήστε ΟΚ για να συνεχίσετε";
var Deactivation = "Απενεργοποίηση";
var oadFutureRemind = "Ενημέρωση λογισμικού.\n Ένα νέο συνιστώμενο λογισμικό θα είναι διαθέσιμο στις %s. Η ενημέρωση ενδέχεται να διαρκέσει λίγα λεπτά και η οθόνη να γίνει μαύρη. Μην απενεργοποιήσετε τον δέκτη κατά τη διάρκεια της ενημέρωσης. Αν δεχτείτε αυτήν την ενημέρωση, αφήστε τον δέκτη ενεργοποιημένο τον προγραμματισμένο χρόνο. Θέλετε να λάβετε αυτήν την ενημέρωση?";														
							
var bt_title = "Bluetooth";
var bt_soundOutPutName = "Έξοδος ήχου";
var bt_soundOutPutTV = "Ηχεία τηλεόρ.";
var bt_soundOutPutBT = "Συσκευή Bluetooth  ";
var bt_soundOutPutBT_TV = "Bluetooth και Τηλεόρ.";
var bt_refreshBarName = "Συσκευές";
var bt_settingTips_On = "Ενεργοποιήστε το Bluetooth και σαρώστε συσκευές. ";
var bt_settingTips_Finding = "Ανεύρεση διαθέσιμων συσκευών…";
var bt_settingTips_NoDevice = "Δεν υπάρχ. διαθέσ. συσκευή.";
var bt_deviceList_State_NoConnect = "Δε συνδέθηκε";
var bt_deviceList_State_Connecting = "Σύνδεση...";
var bt_deviceList_State_Connected = "Συνδέθηκε";
var bt_deviceList_State_Paired = "Έγινε ζεύξη";
var bt_deviceList_Conncect_Failed_Tips1 = "Σύνδεση απέτυχε.";
var bt_deviceList_Conncect_Failed_Tips2 = "Ελέγξτε ότι το Bluetooth XXX είναι ενεργοπ.";
var bt_deviceList_Conncect_Success = "Συνδέθηκε σε συσκευή Bluetooth.";
var bt_deviceList_Disconncect_Success = "Αποσυνδέθηκε από συσκευή Bluetooth.";
var bt_deviceList_Disconnect = "Θέλετε σίγουρα να αποσυνδεθείτε από το XXX;";
var bt_tipsTitle = "Συμβουλή";
var bt_bluetooth_Pairing_Title = "Ζεύξη Bluetooth";
var bt_bluetooth_Input_Pin = "Εισάγετε το PIN:";
var bt_bluetooth_Output_Pin_Tip = "Πληκτρολογήστε το PIN XXXX.";
var bt_bluetooth_Pin_Wrong_Tip = "Λάθος PIN";
var bt_bluetooth_Remove_Pair_Title = "Ερώτημα";
var bt_bluetooth_Remove_Pair_Ask = "Να μη θυμάται τη συσκευή;";
							
							
var audioDescriptionName = ["Ηχητική περιγραφή","Ηχείο","Ένταση ηχείου","Ακουστικά","Ένταση ακουστικών","AD volume","Συσκευή Bluetooth","Ένταση συσκευής Bluetooth","Ενισχυτής","Ηχείο"];
var audioDescriptionOptions = ["Εκτός Λειτουρ.","Κανονικά","Ηχητική περιγραφή"];
var volumeOffRemind = 'Ρυθμίστε XXX σε “Ενεργό” στο μενού Ρυθμίσεων.';
var switchSourceRemind   = " Εισήχθησαν. Θέλετε να κάνετε εναλλαγή τώρα?";
var footballModeName = "Λειτουργία αθλητικών";
var resetStadium = "Στάδιο";					

var atvSearchMenu = "ATV manual search";
var dtvSearchMenu = "DTV manual search";
var settingNoticeSourceName ="Αυτόματη προέλευση";

var smartTVOptions		= ["Πύλη Smart TV","HbbTV","Κοινή Χρήση & Προβολή","Εμφάνιση Wifi","Όροι & Προϋποθέσεις",
    "Δικτύωση σε αναμονή","Επαναφορά smart TV","Cookie policy","Πολιτική απορρήτου","Διαγραφή δεδομένων"];
var supportOptions		= ["Απομακρυσμένη διάγνωση","Επικοινωνία"];
var ClosedcaptionName ="Closed caption";
var sysCCOptions	= ["CC mode","Analog CC","Digital CC","Superimpose","Closed caption"];							
var sysCCmodeOption = ["Off", "On", "On When Mute"];
var sysanalogCCOption = ["Off", "CC1", "CC2", "CC3", "CC4", "Text1", "Text2", "Text3", "Text4"];
var sysdigitalCCOption = ["Off", "Service 1", "Service 2", "Service 3", "Service 4", "Service 5", "Service 6", "Service 7", "Service 8"];
var syssuperimposeOption = ["Off", "Service 1", "Service 2", "Service 3", "Service 4", "Service 5", "Service 6", "Service 7", "Service 8"];
var sysCCOPtionItems = ["CC Option","Mode","Font Style","Font Size","Font Edge Style","Font Edge Color","FG Color","BG Color","FG Opacity","BG Opacity"];
var sysCCOtionMode = ["Custom","Default"];
var sysCCOptionFontStyle = ["Default","Font1","Font2","Font3","Font4","Font5","Font6","Font7"];
var sysCCOptionFontSize = ["Default","Large","Small","Normal"];
var sysCCOptionFontEdgeStyle = ["Default","None","Raised","Depressed","Left Shadow","Right Shadow"];
var sysCCOptionFontColor = ["Default","Black","White","Red","Green","Blue","Yellow","Magenta","Cyan"];
var sysCCOptionFontOpacity = ["Default","Solid","Flashing","Translucent","Transparent"];

var tvDoctor=["Απομακρυσμένη διάγνωση 2.0",
"Η Εφαρμογή λειτουργεί μόνο για διαγνωστικούς ελέγχους στην τηλεόραση και βελτίωση της εμπειρίας προϊόντος. Η Εφαρμογή συλλέγει δεδομένα λειτουργίας και πληροφορίες μοντέλου τηλεόρασης στο διακομιστή για επίλυση προβλημάτων. Δεν παρέχεται πρόσβαση στα προσωπικά σας στοιχεία. Βεβαιωθείτε ότι η τηλεόραση είναι σωστά συνδεμένη στο ίντερνετ.",
"Τοπικός διαγν. έλεγχος",
"Μόλις ξεκινήσει ο διαγν. έλεγχος, ακολουθήστε την οδηγία του τεχνικού υποστήριξης.",
"Απομακρυσμένη διάγνωση",
"Πριν τη χρήση, βεβαιωθείτε ότι το τεχνικός υποστήριξης είναι συνδεμένος.",
"Αριθμ. σειράς:",
"&nbsp;&nbsp;&nbsp;&nbsp;Αναγνωριστικό χρήστη:",
"Γίνεται σύνδεση…",
"Ο διαγν. έλεγχος είναι συνεχής. Διατηρήστε τη σωστή σύνδεση δικτύου. ",
"Δεν υπάρχει πρόσβαση στο ίντερνετ, ελέγξτε τη σύνδεση δικτύου.",
"Έξοδος"
];
var contactUsOption = ["Επικοινωνία",
    "Επικοινωνήστε μαζί μας αν αντιμετωπίζετε προβλήματα με το χειρισμό της συσκευής.",
    "Επικοινωνήστε μαζί μας",
    "Τοποθεσία web: Επισκεφτείτε τη διεύθυνση",
    "Αριθμός τηλεφωνικού κέντρου:","Πληροφορίες προϊόντος","Όνομα Μοντέλου:",
    "Έκδοση λογισμικού:","","Αναγνωριστικό χρήστη:","Project ID:",
    "Τύπος πελάτη:","Ασύρματη διεύθυνση MAC:","Ενσύρματη διεύθυνση MAC:","Netflix ESN:","Σαρώστε τις πληροφορίες στο κινητό σας τηλέφωνο.",
    " και επιλέξτε τη χώρα σας."];
							
							

//本地launcher的翻译，与服务器无关，只用于本地launcher
var homePageWords = ["Ιστορικό", "Αναζήτηση"];//home页的翻译
var titlePageWords = ["Σπίτι", "Βίντεο","Τηλεόραση","Εφαρμογές"];//index的标题翻译
var videosPageWords = ["Κινηματογράφος", "Sport","Μουσική","Δημοφιλή","Παιχνίδι","Εκπαίδευση","Ειδησεισ"];//videos页的内容翻译

//同时应用于本地和服务器
var statusPageWords = ["USB","Ρυθμίσεις","WiFi","Ενσύρματα"];//状态栏的翻译

//二级页面的翻译
var searchPageWords = ["Αναζήτηση", "Δημοφιλείς αναζητήσεις:","Εκπομπές, Ταινίες, Άτομα..."];
var resultSearchPageWords = ["Αποτελέσματα σχετικά με"," ","Δοκιμάστε άλλες λέξεις-κλειδιά.","Δεν βρέθηκε βίντεο για "," "];
var historyPageWords = ["Ιστορικό", 'Πατήστε','για διαγραφή του ιστορικού',"Διαγραφή ενός","Διαγραφή όλων","Χθες","Σήμερα"," Δεν έχετε παρακολουθήσει ακόμη κάποιο βίντεο.","Το ιστορικό προβολών διαγράφηκε!"];
var channelPageWords = ["Δεν βρέθηκε ακόμη βίντεο."];



//以下数组是虚拟遥控器的html中所有span的文字，要一一对应

var virtualRemoteValues	= ["1","2","3","4","5","6","7","8","9",
                       	   "Zoom-","0","Zoom+",
                       	   "Έξοδος","0","",
                       	   "Λίστα","0","Κείμενο",
                       	   "Οδηγός","Είσοδος","Έξοδος",
                       	   "Μενού","Υπότιτλοι","Πληροφ",
                       	   "Διακοπή",
                       	   "Πληροφ","Μενού","Έξοδος",
                       	   "Έξοδος"
                       	   ];

//added for LA sports mode
var sportsModeInitReminds= ["Αυτός ο οδηγός εξυπηρετεί στη ρύθμιση του δίσκου USB για τη Λειτουργία αθλητικών. Επιλέξτε τη λειτουργία ρύθμισης.",
						 "Επιλέξτε το μέγεθος αρχείου για τη Λειτουργία αθλητικών.",
						 "Δημιουργία αρχείου Λειτουργίας αθλητικών",
						 "Η ταχύτητα του δίσκου USB είναι πολύ χαμηλή (< %f MB/δευτ.) για τη Λειτουργία αθλητικών!",
						 "Ο δίσκος USB είναι έτοιμος για τη Λειτουργία αθλητικών. Συνιστάται, όμως, να τον αλλάξετε (με έναν δίσκο ταχύτητας > %f MB/δευτ.) για καλύτερη απόδοση.",
						 "Ο δίσκος USB είναι έτοιμος για τη Λειτουργία αθλητικών."];

var sportsModeExtra	= ["Θέλετε να διακόψετε τη Λειτουργία αθλητικών και να αλλάξετε κανάλι;",
						"Θέλετε να διακόψετε τη Λειτουργία αθλητικών και να αλλάξετε την πηγή στη συνδεδεμένη συσκευή στην είσοδο SCART;",
						"Θέλετε να διακόψετε τη Λειτουργία αθλητικών και να αλλάξετε την πηγή στη συνδεδεμένη συσκευή σε μια είσοδο HDMI;",
						"Η Λειτουργία αθλητικών δεν υποστηρίζεται από το Κρυπτογραφημένο κανάλι.",
						"Θέλετε να διακόψετε τη Λειτουργία αθλητικών και να ανοίξετε τον Ηλεκτρονικό οδηγό προγράμματος;",
						"Θέλετε να διακόψετε τη Λειτουργία αθλητικών και να ανοίξετε τα Μέσα;",
						"Θέλετε να διακόψετε τη Λειτουργία αθλητικών και να αλλάξετε πηγή εισόδου;",
						"Η τηλεόραση θα τερματίσει την ενεργοποιημένη Λειτουργία αθλητικών. Έξοδος;"];
var remoteControlNote = "- Το παρεχόμενο τηλεχειριστήριο ενδέχεται να διαφέρει ανάλογα με τo μοντέλο του προϊόντος.";


var textArray = ["Volume","Channel","Source","Switch/Power","Guide","seconds to Power OFF"];
var guideArray = ["VOL-","VOL+","CH-","CH+","Pre","Next"];
var favChannelListRemind = ["Δεν υπάρχουν αγαπημένα κανάλια. Παρακαλώ  μεταβείτε σε άλλες λίστες και χρησιμοποιήστε το «Πράσινο Πλήκτρο» για να προσθέσετε αγαπημένα κανάλια."];

var proxySetting = ["Ρυθμίσεις διακομιστή μεσολάβησης","Θύρα"];
var powerOffShop = ["Συνιστάται χρήση της λειτουργίας Κατάστημα, συνέχεια;"];
var tcastTextPageWords = ["Αμέτρητα βίντεο, πλούσιες εφαρμογές","Απόλυτος έλεγχος μέσω του τηλεχειριστηρίου","Μοναδικά περιεχόμενα με δυνατότητα προβολής σε μεγάλη οθόνη"];
var tcastOtherWords = ["Σαρώστε τον κωδικό QR και λάβετε την εφαρμογή T-CAST","Η TV έχει συνδεθεί στο δίκτυο","Όνομα TV","T-Cast"];
var hbbtvWords = ["Ρύθμιση Hbbtv","HbbTV","Cookies","Cookies τρίτων","Αναγνωριστικό συσκευής","παρακολούθηση"];
var hbbtvTrackingWords = ["YES","NO","Δεν με ενδιαφέρει"];
var eStickerTipWords = ["Ο χώρος αποθήκευσης είναι μικρότερος από 400M, θέλετε να διαγράψετε τα βίντεο στη λειτουργία επίδειξης για να αποκτήσετε περισσότερο χώρο;"];
var delEstickerVideoRemid = ["Επιτυχής διαγραφή βίντεο"];
var selectSatRemind = "Δεν μπορείτε να επιλέξετε πάνω από 20 δορυφόρους!";
var cookiePolicyTitle = "Πολιτική Cookie –Υπηρεσίες απευθείας σύνδεσης (οnline) Smart TV";
var cookiePolicyConditions = ["Η Εταιρεία σέβεται το ιδιωτικό σας απόρρητο όταν χρησιμοποιείτε τις Smart TV οι οποίες κατασκευάζονται και τις Υπηρεσίες οι οποίες παρέχονται από την Εταιρεία. Τα Cookies χρησιμοποιούνται από πολλές ιστοσελίδες και άλλες υπηρεσίες Διαδικτύου και η Smart TV σας θα δέχεται, αποθηκεύει και μεταδίδει cookies προκειμένου να διασφαλιστεί ότι οι συγκεκριμένες ιστοσελίδες και υπηρεσίες λειτουργούν σωστά. Η Εταιρεία επίσης χρησιμοποιεί cookies κατά την παροχή των Υπηρεσιών σε εσάς. Στην παρούσα Πολιτική Cookie η Εταιρεία περιγράφει ποια cookies εγκαθίστανται στη Smart TV σας και πως μπορείτε να τα διαχειριστείτε.\nΠαρακαλούμε σημειώστε ότι όλα τα προσωπικά δεδομένα τα οποία η Εταιρεία συλλέγει και/ή επεξεργάζεται μέσω ή με τη βοήθεια cookies υπόκειται στην Πολιτική Απορρήτου και θα πρέπει να διαβάσετε την Πολιτική Cookies μαζί με την Πολιτική Απορρήτου.\n1. Τι είναι cookie?\nΤα Cookies είναι μικρά αρχεία κειμένου που μπορούν να τοποθετηθούν στην Smart TV σας. Όταν αποκτάτε πρόσβαση σε μια ιστοσελίδα ή η υπηρεσία κόκκινου κουμπιού ενός τηλεοπτικού σταθμού, η ιστοσελίδα ή η υπηρεσία ενδέχεται να αποθηκεύσει ένα cookie στην Smart TV σας. Κατά τις επόμενες προσβάσεις, ένα cookie το οποίο τοποθετείται στη Smart TV σας θα στέλνει πληροφορίες στο μέρος το οποίο τοποθέτησε το cookie. Τα Cookies είναι εξαιρετικά κοινά και χρησιμοποιούνται σε πολλές ιστοσελίδες και υπηρεσίες. Κάθε cookie θα περιέχει συνήθως το όνομα του τομέα από τον οποίο έχει προέλθει το cookie, τη “διάρκεια ζωής” του cookie και μια τιμή (συνήθως έναν μοναδικό αριθμό). Για μια πιο εμπεριστατωμένη εξήγηση των cookies και του τρόπου λειτουργίας τους, επισκεφτείτε την ιστοσελίδα www.allaboutcookies.org.\nΤα cookies μπορούν να ταξινομηθούν σε λειτουργικά cookies και σε μη λειτουργικά cookies. Τα λειτουργικά cookies είναι cookies τα οποία είναι απολύτως αναγκαία για το σκοπό της παροχής σε εσάς των υπηρεσιών Smart TV και για ιστοσελίδες και λοιπές υπηρεσίες να παράσχουν το σωστό περιεχόμενο στη Smart TV. Μη λειτουργικά cookies είναι όλα τα άλλα cookies.\nΗ παρούσα Πολιτική Cookie σχετίζεται με τα cookies που τοποθετούνται από εμάς, καθώς και με cookies διαφήμισης που ενδέχεται να τοποθετηθούν από τρίτους μέσω των υπηρεσιών μας στη Smart TV σας. Η παρούσα Πολιτική Cookie δε σχετίζεται με cookies τα οποία ενδέχεται να τοποθετηθούν όταν χρησιμοποιείτε τις υπηρεσίες Smart TV για την πρόσβαση σε ιστοσελίδες, υπηρεσίες ή εφαρμογές τρίτων. Για αυτά τα cookies σας παραπέμπουμε στις αντίστοιχες πολιτικές cookie των τρίτων μερών αυτών. Ωστόσο, η παρούσα Πολιτική Cookie περιγράφει πώς να διαγράψετε αυτά τα cookies (δείτε την ενότητα 4 παρακάτω).\n2. Ποια μη λειτουργικά cookies χρησιμοποιούμε?\nΔιαφήμιση: Κατά τη χρήση των υπηρεσιών Smart TV μπορεί να προβάλλονται διαφημίσεις στη Smart TV σας εντός των βίντεο και σε ιστοσελίδες. Αυτές οι διαφημίσεις μπορεί να προβάλλονται από εμάς ή από τρίτους μέσω, ή όπως συντονίζεται από, τον διαφημιστικό μας διακομιστή, ο οποίος εκτελεί έναν κεντρικό συντονιστικό ρόλο σε σχέση με την εξυπηρέτηση αυτών των διαφημίσεων. Ο διαφημιστικός μας διακομιστής ή ένας διακομιστής διαφήμισης τρίτου μέρους θα εγκαταστήσει ένα cookie στην Smart TV σας. Μέσω αυτού του cookie ένας διαφημιστικός διακομιστής θα καταγράφει εάν έχει προβληθεί μια διαφήμιση στη Smart TV σας ή κατά πόσο κάποιος που χρησιμοποιεί τη Smart TV σας έχει κάνει κλικ πάνω σε μια διαφήμιση. Χρησιμοποιούμε τις πληροφορίες που αποθηκεύονται σε ένα τέτοιο cookie διαφήμισης για να θυμόμαστε ποιες διαφημίσεις έχουν προβληθεί στη Smart TV σας έτσι ώστε να βεβαιωθούμε ότι δεν προβάλλονται υπερβολικά πολλές όμοιες διαφημίσεις σε οποιαδήποτε Smart TV, και ότι είμαστε σε θέση να διευθετήσουμε τις εμπορικές μας συμφωνίες με τους διαφημιστικούς μας συνεργάτες. Δεν θα χρησιμοποιήσουμε αυτές τις πληροφορίες για την προβολή στοχευμένων διαφημίσεων. Επιπρόσθετα, τρίτα μέρη μπορεί να χρησιμοποιούν το διαφημιστικό μας σύστημα για την προβολή διαφημίσεων στη Smart TV σας και να τοποθετούν  cookies σε αυτή όταν προβάλλονται οι διαφημίσεις αυτές. \nΑυτά τα cookies περιέχουν, μεταξύ άλλων, πληροφορίες σχετικά με τις διαφημίσεις που προβάλλονται, πληροφορίες σχετικά με την εφαρμογή ή τον τομέα στις οποίες προβάλλονται αυτές οι διαφημίσεις και τη διεύθυνση IP σας. Αυτό γίνεται για να θυμάστε πόσο συχνά εμφανίζεται μια συγκεκριμένη διαφήμιση και για να αποφευχθεί η εμφάνιση της ίδιας διαφήμισης πολύ συχνά. Οι εξωτερικοί διαφημιζόμενοι τρίτων μερών που μπορούν να τοποθετούν διαφημίσεις μπορούν επίσης να χρησιμοποιούν cookies για να παρακολουθούν τη δραστηριότητά τους σε πολλούς ιστοτόπους και για να παρέχουν διαφημίσεις που αντιστοιχούν στις προσωπικές σας προτιμήσεις.\n3. Ιστοσελίδες τρίτων\nΌταν επισκέπτεστε ιστοσελίδες ή υπηρεσίες τρίτων μέσω των υπηρεσιών Smart TV της Smart TV σας, είναι πιθανό οι ιστοσελίδες ή υπηρεσίες αυτές να τοποθετήσουν cookies στη Smart TV σας, και οι ιστοσελίδες αυτές να παρακολουθούν και να αποθηκεύουν τις αλληλεπιδράσεις σας σε αυτές. Δεν ζητούμε ούτε ενθαρρύνουμε τέτοιες δραστηριότητες και δεν θα χρησιμοποιήσουμε αυτές τις πληροφορίες. Παρακαλούμε ανατρέξτε στις αντίστοιχες πολιτικές cookie και απορρήτου των ιστοσελίδων και υπηρεσιών αυτών για περισσότερες πληροφορίες σχετικά με τη χρήση αυτών των cookies από τρίτους.\n4. Διαγραφή Cookie \nΗ διεπαφή χρήστη της Smart TV σας επιτρέπει να διαγράψετε όλα τα cookies και άλλες τοπικές αποθηκεύσεις του προγράμματος περιήγησης από τη Smart TV σας. Συστήνεται ιδιαίτερα να αφαιρέσετε όλα τα cookies και τις τοπικά αποθηκευμένες ρυθμίσεις πριν την πουλήσετε ή χαρίσετε τη Smart TV σας.\n5. Επικοινωνία\nΑν έχετε οποιεσδήποτε ερωτήσεις ή σχόλια σχετικά με την Πολιτική Cookie ή την πρακτική μας να χρησιμοποιούμε cookies μπορείτε να μας στείλετε ένα μήνυμα ηλεκτρονικού ταχυδρομείου (e-mail) στη διεύθυνση FRsupport@tcl.com.\nΈκδοση: 1.0\n"];
var privacyPolicyTitle = "Πολιτική Απορρήτου – Υπηρεσίες απευθείας σύνδεσης (online) Smart TV";
var privacyPolicyConditions = ["Σεβόμαστε τo ιδιωτικό σας απόρρητο κατά τον χειρισμό των προσωπικών σας δεδομένων. Η παρούσα Πολιτική Απορρήτου περιγράφει το νομικό πρόσωπο το οποίο είναι υπεύθυνο για τη συλλογή, επεξεργασία και χρήση των προσωπικών δεδομένων τα οποία συλλέγουμε από εσάς σε σχέση με τη χρήση των υπηρεσιών μας Smart TV (οι \"Υπηρεσίες\"), ποιές κατηγορίες προσωπικών δεδομένων συλλέγουμε σχετικά με εσάς, τι κάνουμε με αυτά και τα δικαιώματά σας σε σχέση με τη χρήση των προσωπικών σας δεδομένων από εμάς. \n1. Υπεύθυνος Επεξεργασίας\nΗ συλλογή, επεξεργασία και χρήση των προσωπικών δεδομένων που συλλέγονται από εσάς κατά τη χρήση των Υπηρεσιών διεξάγεται από την εταιρεία Shenzhen TCL New Technology Co., Ltd., No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, Κίνα (η \"Εταιρεία\"). Παρακαλούμε να σημειώσετε, ωστόσο, ότι δεν είμαστε υπεύθυνοι για όλες τις δραστηριότητες επεξεργασίας δεδομένων που εκθέτονται παρακάτω. Παρά ταύτα συμπεριλάβαμε μια περιγραφή των αντίστοιχων δραστηριοτήτων στην Πολιτική Απορρήτου μας επειδή η επεξεργασία αυτή συνδέεται με τη χρήση της Smart TV εκ μέρους σας.\n2. Συγκατάθεση για την επεξεργασία δεδομένων\nΟρισμένες διαδικασίες συλλογής, επεξεργασίας και/ή χρήσης των προσωπικών σας δεδομένων απαιτούν την συγκατάθεσή σας. \nΕάν έχετε χορηγήσει τη συγκατάθεσή σας για τη χρήση των προσωπικών σας δεδομένων για το σκοπό της βελτίωσης των Υπηρεσιών, η συγκατάθεσή σας είχε την ακόλουθη διατύπωση:\n\" Παρέχω τη συγκατάθεσή μου για τη συλλογή, επεξεργασία και χρήση του χρόνου έναρξης της συσκευής μου, της λίστας καναλιών ψηφιακής τηλεόρασης, της λίστας αγαπημένων καναλιών, του χρόνου επίσκεψης και των προβληθέντων καναλιών για τους σκοπούς της ανάλυσης συνηθειών του χρήστη για τη βελτίωση των Υπηρεσιών και/ή για την ανάλυση του αριθμού των απευθείας σύνδεσης (online) χρηστών τους οποίους η Εταιρεία έχει ανά ημέρα/μήνα/χρόνο και για την κοινοποίηση των πληροφοριών αυτών με τους τηλεοπτικούς σταθμούς.\"\nΕάν έχετε δώσει τη συγκατάθεσή σας για τη χρήση των προσωπικών σας δεδομένων για διαφημίσεις οι οποίες είναι προσαρμοσμένες στα ενδιαφέροντά σας, η συγκατάθεσή σας είχε την ακόλουθη διατύπωση:\n\" Παρέχω τη συγκατάθεσή μου για τη συλλογή, επεξεργασία και χρήση του τύπου πελάτη και της χώρας που ανήκω μου με σκοπό τη λήψη κατάλληλων διαφημίσεων.\"\nΗ συγκατάθεση είναι προαιρετική και θα εξακολουθείτε να μπορείτε να χρησιμοποιείτε τις Υπηρεσίες εάν δεν την παράσχετε. Ωστόσο, ενδέχεται να βλέπετε διαφημίσεις και άλλο περιεχόμενο το οποίο δεν είναι προσαρμοσμένο στις προτιμήσεις σας. Ανεξάρτητα από τη συγκατάθεσή σας, η Εταιρεία διατηρεί το δικαίωμα να συλλέγει, να επεξεργάζεται και/ή να χρησιμοποιεί τα παραπάνω δεδομένα στο βαθμό που επιτρέπεται από την ισχύουσα νομοθεσία.\nΜπορείτε να ανακαλέσετε τη συγκατάθεσή σας σε οποιοδήποτε από τα παραπάνω, με ισχύ για το μέλλον, ανά πάσα στιγμή. Μπορείτε να εναντιωθείτε στη χρήση των προσωπικών σας δεδομένων για έρευνα μάρκετινγκ, αγοράς ή γνώμης και για την προσαρμογή των Υπηρεσιών στις ανάγκες σας. Για να ανακαλέσετε τη συγκατάθεσή σας και/ή να εναντιωθείτε, αλλάξτε αναλόγως τις ρυθμίσεις απορρήτου της Smart TV σας.\n3. Προσωπικά δεδομένα που συλλέγονται\nΑνεξάρτητα από τη συγκατάθεσή σας, η Εταιρεία συλλέγει, επεξεργάζεται, αποθηκεύει και χρησιμοποιεί τις ακόλουθες κατηγορίες δεδομένων:\nΤαυτότητα Συσκευής (Device-ID): Η Smart TV σας αποθηκεύει ένα σταθερό μοναδικό αριθμό ο οποίος μας επιτρέπει να αναγνωρίσουμε και να πιστοποιήσουμε την ταυτότητά της Smart TV όταν χρησιμοποιείτε της Υπηρεσίες. Ο αριθμός αυτός αποκαλείται η  Ταυτότητα Συσκευής (Device-ID). Η Ταυτότητα Συσκευής θα παρέχεται στον συνεργάτη υπηρεσιών μας για να σας παρέχουμε τις Υπηρεσίες. Παρέχουμε επίσης την Ταυτότητα Συσκευής σε επιλεγμένους συνεργάτες περιεχομένου για σκοπούς εξακρίβωσης ταυτότητας. Αυτοί οι συνεργάτες περιεχομένου χρησιμοποιούν την Tαυτότητα Συσκευής προκειμένου να εξακριβώσουν την πρόσβαση της Smart TV σας σε υπηρεσίες που παρέχονται από έναν συνεργάτη περιεχομένου.\nΔιεύθυνση IP και διεύθυνση MAC: Μια διεύθυνση IP θα αντιστοιχηθεί στην Smart TV σας κατά την πρόσβαση στο Διαδίκτυο. Αυτή η διεύθυνση IP θα μεταδίδεται σε εμάς και θα επεξεργάζεται από εμάς κάθε φορά που η Smart TV ζητά πληροφορίες ή δεδομένα από τις Υπηρεσίες. Εάν η Smart TV σας βρίσκεται πίσω από ένα δρομολογητή (π.χ. σε ένα τοπικό οικιακό δίκτυο ή σε ένα τοπικό WLAN), ενδέχεται να συλλέξουμε και να επεξεργαστούμε τη διεύθυνση IP του δρομολογητή αυτού. Η διεύθυνση MAC είναι ένας μοναδικός αριθμός που αντιστοιχεί σε κάθε διεπαφή δικτύου της Smart TV σας. Η διεύθυνση MAC θα συλλέγεται και θα επεξεργάζεται επίσης από εμάς όταν η Smart TV ζητά πληροφορίες ή δεδομένα από τις Υπηρεσίες.\nΔεδομένα αιτήματος Υπηρεσίας: Κάθε φορά που συνδέετε τη Smart TV σας στο Διαδίκτυο και ανοίγετε τη Smart TV, αυτή θα συνδέεται αυτόματα με τις Υπηρεσίες, τις οποίες διαχειρίζεται ο συνεργάτης μας. Η Smart TV σας θα εξακριβώνεται στην συνέχεια ως πιστοποιημένη για πρόσβαση στις Υπηρεσίες. Για σκοπούς εξακρίβωσης ταυτότητας, οι Υπηρεσίες αποθηκεύουν ένα ή περισσότερα μοναδικά αριθμητικά αναγνωριστικά που σχετίζονται με την Smart TV σας. Κατά τη σύνδεση στην Υπηρεσία, η Smart TV θα μεταδίδει τη διεύθυνση IP στην οποία έχει αντιστοιχηθεί και θα μεταδίδει πληροφορίες σχετικά με τη συγκεκριμένη συσκευή (μοντέλο Smart TV, έκδοση λογισμικού) για να εξεταστεί εάν υπάρχουν διαθέσιμες ενημερώσεις λογισμικού.\nΡυθμίσεις Υπηρεσίας: Στο πλαίσιο της τακτικής λειτουργίας των Υπηρεσιών μπορείτε να ρυθμίσετε χειροκίνητα τη σειρά με την οποία εμφανίζονται οι εφαρμογές από τις Υπηρεσίες. Ο συνεργάτης μας θα αποθηκεύει τη ρύθμισή σας και άλλες προτιμήσεις τις οποίες μπορεί να ρυθμίσετε κατά τη διάρκεια χρήσης των Υπηρεσιών. Οι πληροφορίες αυτές θα συνδέονται με την Ταυτότητα Συσκευής.\nΠληροφορίες σχετικά με τη συγκεκριμένη συσκευή: Η Smart TV αποθηκεύει αρκετές πληροφορίες σχετικά με την ίδια και τις ρυθμίσεις τις. Οι πληροφορίες αυτές περιλαμβάνουν τον τύπο της Smart TV, την έκδοση του λειτουργικού συστήματος της Smart TV, την ανάλυση της οθόνης, το αναγνωριστικό έργου (ήτοι πληροφορίες σχετικά με τα αρχεία διαμόρφωσης), τον πράκτορα χρήστη, το όνομα του προγράμματος περιήγησης, την έκδοση του προγράμματος περιήγησης, καθώς και τη γλώσσα και χώρα οι οποίες έχουν διαμορφωθεί στην Smart TV. Αυτές οι πληροφορίες θα χρησιμοποιηθούν από εμάς και θα παρέχονται στους συνεργάτες μας και τους συνεργάτες περιεχομένου.\nΔιαφήμιση: Οι Υπηρεσίες ενδέχεται να προβάλλουν διαφημίσεις. Αυτές οι διαφημίσεις προβάλλονται από εμάς ή από τρίτα μέρη που χρησιμοποιούν διαφημιστικό απόθεμα το οποίο τους έχει ανατεθεί από εμάς. Όλες οι διαφημίσεις προβάλλονται μέσω ή διαμέσου του διακομιστή διαφημίσεών μας, ο οποίος επιτελεί έναν συντονιστικό ρόλο για την προβολή των διαφημίσεων. Ο διακομιστής διαφημίσεών μας ή ο διακομιστής διαφημίσεων τρίτου μέρους μπορεί να εγκαταστήσει ένα cookie στην Smart TV. Παρακαλούμε ανατρέξτε στην Πολιτική Cookie για περισσότερες πληροφορίες σχετικά με αυτά τα cookies.\nΕπισκεψιμότητα συνεργατών και συνεργατών περιεχομένου: Όταν χρησιμοποιείτε τις Υπηρεσίες η Smart TV σας θα ζητήσει δεδομένα από τις Υπηρεσίες μέσω του Διαδικτύου. Στο πλαίσιο των αιτημάτων αυτών η διεύθυνση IP σας, όπως περιγράφεται ανωτέρω, και η γλώσσα και χώρα η οποία έχει διαμορφωθεί στην Smart TV σας θα μεταδίδεται στον συνεργάτη μας. Ο συνεργάτης μας θα επεξεργάζεται τα αντίστοιχα δεδομένα σύμφωνα με την πολιτική απορρήτου του.\nΧρήση δεύτερης οθόνης: Εάν χρησιμοποιείτε την εφαρμογή δεύτερης οθόνης, τα στοιχεία ελέγχου που ενεργοποιείτε στην εφαρμογή και οι ρυθμίσεις γλώσσας και χώρας, η λίστα ψηφιακών καναλιών, η λίστα αγαπημένων καναλιών, οι λίστες προγραμμάτων, η Ταυτότητα Συσκευής, το τρέχον κανάλι, η έκδοση του πρωτοκόλλου και οι διευθύνσεις IP της Smart TV σας θα συλλέγονται και θα επεξεργάζονται από εμάς στους διακομιστές μας. Οι διακομιστές μας θα ελέγχουν στη συνέχεια την Smart TV σας όπως εσείς θα κατευθύνετε στην εφαρμογή δεύτερης οθόνης.\nΥβριδική ευρυζωνική τηλεόραση (HbbTV) - \"Κόκκινο κουμπί\": Οι τηλεοπτικοί σταθμοί (οι \"Σταθμοί\") ενδέχεται να στείλουν επιπρόσθετες πληροφορίες μαζί με το τηλεοπτικό τους σήμα. Εάν η Smart TV λαμβάνει συγκεκριμένες οδηγίες σε αυτές τις πρόσθετες πληροφορίες και εάν είναι συνδεδεμένη στο Διαδίκτυο, η Smart TV θα κατεβάσει μια εικόνα ή μικρή σελίδα από την ιστοσελίδα του Σταθμού και θα την προβάλλει μαζί με την πληροφορία να πατήσετε το \"Κόκκινο Κουμπί\" στο τηλεκοντρόλ σας εάν θέλετε να κάνετε χρήση των πρόσθετων υπηρεσιών οι οποίες παρέχονται από το Σταθμό. Αυτό συμβαίνει κάθε φορά που αλλάζετε κανάλι. Κατά τη λήψη της εικόνας από την ιστοσελίδα του Σταθμού, η Smart TV θα μεταδίδει ορισμένα προσωπικά δεδομένα, ήτοι τη λίστα ψηφιακών καναλιών, το τρέχον κανάλι, τον πίνακα πληροφοριών συμβάντων, την ώρα της τηλεόρασης, τη διεύθυνση IP της Smart TV σας και τα cookies τα οποία είναι αποθηκευμένα στη Smart TV (εάν υπάρχουν). Ο Σταθμός είναι υπεύθυνος για τη συλλογή, επεξεργασία και/ή χρήση αυτών των δεδομένων. Περαιτέρω, αν χρησιμοποιείτε πρόσθετες υπηρεσίες που προσφέρονται από έναν Σταθμό μέσω του κόκκινου κουμπιού, ο Σταθμός μπορεί να συλλέξει άλλα προσωπικά δεδομένα σχετικά με εσάς (π.χ. ποια βίντεο κατά παραγγελία παρακολουθείτε, τις ειδήσεις που διαβάζετε, κλπ.).\n4. Σκοποί για τους οποίους επεξεργαζόμαστε και/ή χρησιμοποιούμε τα προσωπικά σας δεδομένα\nΕπεξεργαζόμαστε τα συλλεχθέντα δεδομένα για τους ακόλουθους σκοπούς:\n• Παροχή των Υπηρεσιών: Χρησιμοποιούμε τη διεύθυνση IP και τη διεύθυνση MAC, την Ταυτότητα Συσκευής, την έκδοση του λειτουργικού συστήματος της Smart TV, τον τύπο πελάτη της Smart TV σας και την ανάλυση οθόνης της, την ταυτότητα του έργου (ήτοι πληροφορίες σχετικά με τα αρχεία διαμόρφωσης), τη λίστα ψηφιακών καναλιών σας, τα προβληθέντα κανάλια, τη ζώνη ώρας, τις ρυθμίσεις χώρας και γλώσσας για να παρέχουμε στη Smart TV σας πρόσβαση στις Υπηρεσίες και σε υπηρεσίες ο οποίες παρέχονται από συνεργάτες περιεχομένου. Οι σκοποί περιλαμβάνουν (ενδεικτικά και όχι περιοριστικά) την εξακρίβωση της ταυτότητας, την παροχή υπηρεσιών σε εσάς με βάση την τοποθεσία (π.χ. πρόγνωση καιρού), το χειρισμό της κατάχρησης, τη διαχείριση περιστατικών ασφαλείας, την παρακολούθηση της διαθεσιμότητας των Υπηρεσιών και την παροχή υπηρεσιών δημιουργίας αντιγράφων ασφαλείας των προτιμήσεων των χρηστών.\n• Εξακρίβωση ταυτότητας: Χρησιμοποιούμε την Ταυτότητα Συσκευής και τη διεύθυνση MAC για σκοπούς εξακρίβωσης ταυτότητας.\n• Ενημερώσεις λογισμικού: Κάθε φορά που η Smart TV σας είναι ενεργοποιημένη, θα μας παρέχει τη διεύθυνση IP, την Ταυτότητα Συσκευής, την έκδοση του λογισμικού, τον τύπο πελάτη της Smart TV σας, την ταυτότητα του έργου (ήτοι αρχεία διαμόρφωσης), την ταυτότητα χρήστη, τον σειριακό αριθμό προκειμένου να σας προσφέρουμε και να σας παράσχουμε τις κατάλληλες ενημερώσεις λογισμικού. \n• Βελτίωση Υπηρεσιών: Χρησιμοποιούμε συγκεντρωτικά και ανωνυμοποιημένα δεδομένα χρήσης (ήτοι δεδομένα σχετικά με την αλληλεπίδρασή σας με τις Υπηρεσίες) για να βελτιώσουμε την εμπειρία του χρήστη των Υπηρεσιών.\n• Προβολή διαφημίσεων: Χρησιμοποιούμε τις πληροφορίες στα διαφημιστικά cookies για να επιτραπεί στο σύστημα να καταγράψει ποιες διαφημίσεις έχουν προβληθεί στην Smart TV σας προκειμένου να βεβαιωθούμε ότι δεν λαμβάνετε υπερβολικά πολλές όμοιες διαφημίσεις, και για να είμαστε σε θέση να διευθετήσουμε τις εμπορικές συμφωνίες μας με τους διαφημιστικούς μας συνεργάτες. Εξωτερικοί διαφημιζόμενοι που προβάλλουν διαφημίσεις στις Υπηρεσίες ή στις ιστοσελίδες των συνεργατών περιεχομένου κατόπιν συντονισμού από το διαφημιστικό μας διακομιστή, ενδέχεται επίσης να χρησιμοποιούν cookies για να σας παρακολουθήσουν σε πολλαπλούς ιστοτόπους, και για να προβάλλουν διαφημίσεις οι οποίες αντικατοπτρίζουν τις προσωπικές σας προτιμήσεις.\n• Βελτιστοποίηση διαφημίσεων: Χρησιμοποιούμε δεδομένα σχετικά με προβολές διαφημίσεων και κλικ σε διαφημίσεις για τη βελτιστοποίηση της διαφημιστικής εμπειρίας των καταναλωτών στην Υπηρεσία.\n• Εκπτώσεις: Παρέχουμε την Ταυτότητα Συσκευής σε επιλεγμένους συνεργάτες περιεχομένου έτσι ώστε να έχουν οι συνεργάτες αυτοί τη δυνατότητα να εξακριβώσουν σε ποιο βαθμό μπορούν να σας παρέχουν δωρεάν πρόσβαση σε τίτλους Βίντεο κατά Παραγγελία από τη συλλογή τους.\n• Συμμόρφωση με νόμο: Μπορεί να χρειαστεί να παρέχουμε δεδομένα σε αρμόδιες νόμιμες αρχές ή σε δικαστήρια. Εάν το πράξουμε, θα το πράξουμε μόνο σύμφωνα με  δεσμευτικό νομικό έγγραφο όπως ένταλμα ή δικαστική απόφαση, το οποίο απαιτεί από εμάς να συνεργαστούμε με τις αρμόδιες αρχές.\nΗ χρήση των Υπηρεσιών είναι δυνατή με τη χρήση ψευδωνύμων, Εκτός εάν συγκεκριμένες υπηρεσίες απαιτούν να δώσετε το όνομά σας ή/και τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας.\n5. Κατηγορίες αποδεκτών\nΗ Εταιρεία κοινοποιεί τα προσωπικά σας δεδομένα τα οποία συλλέχθηκαν κατά τη χρήση των Υπηρεσιών μόνο στα ακόλουθα τρίτα μέρη:\n• Σε τρίτους παρόχους υπηρεσιών Smart TV εάν ζητήσετε τέτοιες υπηρεσίες (π.χ. εάν ανοίξετε την εφαρμογή Netflix στη Smart TV σας μπορεί να κοινοποιήσουμε τη διεύθυνση IP σας, τη διεύθυνση MAC, την έκδοση του λογισμικού και την ονομασία του μοντέλου της τηλεόρασης με τη Netflix).\n• Σε τρίτους συνεργάτες περιεχομένου εάν ζητήσετε συγκεκριμένο περιεχόμενο το οποίο παρέχεται από αυτούς τους συνεργάτες περιεχομένου (π.χ. προκειμένου να σας παρέχουμε την υπηρεσία GoLive IP TV, μπορεί να κοινοποιήσουμε τον τύπο πελάτη της τηλεόρασής σας, τη διεύθυνση IP και τις ρυθμίσεις γλώσσας με το νομικό πρόσωπο το οποίο παρέχει την υπηρεσία GoLive).\n• Στο βαθμό που έχετε παράσχει τη συγκατάθεσή σας στην κοινοποίηση συγκεκριμένων προσωπικών δεδομένων τα ανωτέρω τρίτα μέρη, η Εταιρεία θα κοινοποιεί τα προσωπικά σας δεδομένα σε αυτά τα τρίτα μέρη.\n• Σε εξωτερικούς συνεργάτες παροχής υπηρεσιών ως εκτελούντες την επεξεργασία οι οποίοι επικουρούν την Εταιρεία κατά την παροχή των Υπηρεσιών.\nΗ Εταιρεία κοινοποιεί τα προσωπικά σας δεδομένα σε άλλα τρίτα μέρη μόνο εάν αυτή υποχρεούται να το πράξει βάσει νομικής υποχρέωσης (λ.χ. σε δικαστήρια ή ποινικές διωκτικές αρχές), έχετε παράσχει τη συγκατάθεσή σας στην αντίστοιχη κοινοποίηση ή η κοινοποίηση είναι  κατά τα λοιπά νόμιμη με βάση το εφαρμοστέο δίκαιο.\n6. Χώρες στις οποίες τα δεδομένα σας υποβάλλονται σε επεξεργασία \nΗ Εταιρεία και/ή κάποιοι από τους αποδέκτες των προσωπικών σας δεδομένων που αναφέρονται ανωτέρω ενδέχεται να βρίσκονται εκτός του Ευρωπαϊκού Οικονομικού Χώρου (ήτοι στις ακόλουθες χώρες: Λαϊκή Δημοκρατία της Κίνας, Ηνωμένες Πολιτείες Αμερικής). Συνεπώς, τα προσωπικά σας δεδομένα μπορεί να υποβάλλονται σε επεξεργασία σε χώρες οι οποίες δεν έχουν αναγνωριστεί ότι παρέχουν επαρκές επίπεδο προστασίας των προσωπικών δεδομένων σύμφωνα με την Οδηγία 95/46/EΚ του Ευρωπαϊκού Κοινοβουλίου και του Συμβουλίου της 24ης Οκτωβρίου 1995 για την προστασία των φυσικών προσώπων έναντι της επεξεργασίας δεδομένων προσωπικού χαρακτήρα και για την ελεύθερη κυκλοφορία των δεδομένων αυτών.\n7. Τα δικαιώματά σας\nΜπορείτε να επικοινωνήσετε με την Εταιρεία προκειμένου να λάβετε πληροφορίες σχετικά με τα προσωπικά σας δεδομένα τα οποία επεξεργάζεται η Εταιρεία και/ή να ασκήσετε τα νόμιμα δικαιώματά σας αναφορικά με την πρόσβαση, διόρθωση, διαγραφή και το κλείδωμα των προσωπικών σας δεδομένων, και/ή να εναντιωθείτε στην επεξεργασία των προσωπικών σας δεδομένων για σκοπούς μάρκετινγκ και/ή έρευνας αγοράς ή γνώμης.\n8. Αλλαγές στην Πολιτική Απορρήτου\nΓια να βελτιώσουμε τις Υπηρεσίες μας ενδέχεται να απαιτήσουμε τροποποιήσεις στην παρούσα Πολιτική Απορρήτου – π.χ. με την εφαρμογή νέων τεχνολογιών ή την εισαγωγή νέων υπηρεσιών. Διατηρούμε το δικαίωμα να αλλάξουμε ή να συμπληρώσουμε την παρούσα Πολιτική Απορρήτου ανά πάσα στιγμή.\n9. Στοιχεία επικοινωνίας\nΕάν έχετε απορίες σχετικά με την Πολιτική Απορρήτου ή θα θέλατε να παραπονεθείτε αναφορικά με το χειρισμό των προσωπικών σας δεδομένων από εμάς, παρακαλούμε επικοινωνήστε μαζί μας χρησιμοποιώντας ένα από τα παρακάτω στοιχεία επικοινωνίας:\nΔιεύθυνση Ηλεκτρονικού Ταχυδρομείου (Email): FRsupport@tcl.com\nΈκδοση: 1.0\n"];
var privacyPolicyTerms = [
    "Ενεργοποίηση υπηρεσίας Smart TV",
    "Συμφωνώ με τη συλλογή, την επεξεργασία και τη χρήση της ώρας έναρξης της συσκευής μου, της λίστας καναλιών DTV, της λίστας αγαπημένων καναλιών, του χρόνου παρακολούθησης και των καναλιών που προβλήθηκαν για τους σκοπούς της ανάλυσης των συνηθειών των χρηστών για τη βελτίωση των υπηρεσιών ή/και την ανάλυση των online χρηστών της TCL ανά ημέρα/μήνα/έτος και την κοινή χρήση αυτών των πληροφοριών με τηλεοπτικούς σταθμούς.",
    "Ενεργοποίηση υπηρεσίας συστάσεων",
    "Ενεργοποιήστε την εφαρμογή δεύτερης οθόνης για κινητές συσκευές",
    "Ενεργοποίηση αυτόματων ενημερώσεων λογισμικού",
    "Ενεργοποιήστε την υπηρεσία FreeviewPlay"
];
var privacyPolicyTips = [
    "Όλες οι υπηρεσίες Smart TV θα απενεργοποιηθούν.",
    "Η υπηρεσία HbbTV παρέχεται από τα τηλεοπτικά κανάλια όταν ο χρησιμοποιούμενος ενσωματωμένος δέκτης απενεργοποιείται.",
    "Η υπηρεσία πρότασης περιεχομένων και τηλεοπτικών προγραμμάτων θα απενεργοποιηθεί.",
    "Η εφαρμογή δεύτερης οθόνης θα απενεργοποιηθεί.",
    "Η τηλεόραση θα πραγματοποιήσει αυτόματη αναζήτηση για ενημερώσεις λογισμικού και νέες λειτουργίες.",
	"Το περιεχόμενο FreeviewPlay θα απενεργοποιηθεί."
];
var privacyPolicyRemind = "Σημειώστε το σχετικό πλαίσιο ελέγχου στις Ρυθμίσεις.";
var set = "ρύθμιση";
var copyShopDemoTips = ["Έχει γίνει σύνδεση σε USB, θέλετε να αποθηκεύσετε το βίντεο στη μνήμη flash;","Αντιγραφή βίντεο σε μνήμη flash","Επιτυχής αντιγραφή βίντεο!","Σφάλμα αντιγραφής βίντεο!"];
var dataDeletionWords = ["Διαγραφή των δεδομένων της υπηρεσίας Smart TV στους διακομιστές backend.","Σημειώσεις: Αν επιλέξετε αυτό το στοιχείο, τα δεδομένα που σχετίζονται με τον χρήστη των υπηρεσιών Smart TV θα διαγράφονται μετά την πάροδο ενός μηνός. Σημειώστε ότι η διαγραφή δεν επηρεάζει τα τοπικά δεδομένα που είναι αποθηκευμένα στην τηλεόρασή σας.","Να μην γίνεται πλέον αναφορά δεδομένων στον διακομιστή Smart TV.","Σημειώσεις:  Αν επιλέξετε αυτό το στοιχείο, τα δεδομένα που αφορούν στη χρήση υπηρεσιών Smart TV δεν θα μεταφέρονται πλέον στο διακομιστή. Η τηλεόρασή σας δεν θα λαμβάνει πλέον προτεινόμενες υπηρεσίες.","Εάν θέλετε να μάθετε περισσότερα, επισκεφτείτε την ιστοσελίδα www.tcl.eu"];
var miracastWords = ["Ασύρματη σύνδεση","Κατοπτρισμός τηλεφώνου android στην TV","Κάντε κλικ για σύνδεση","Αυτή η λειτουργία διατίθεται μόνο σε τηλέφωνα android"];
var miracastTips = ["Βήματα σύνδεσης","Ανοίξτε τις ρυθμίσεις συστήματος","Περισσότεροι τρόποι σύνδεσης \n / Άλλες ασύρματες συνδέσεις","Επιλέξτε ασύρματη οθόνη","Κάντε κλικ για σύνδεση \n Αναμονή για εύρεση"];
var termsAndConditions = ["\nΤο περιεχόμενο και οι υπηρεσίες (από κοινού η «Αδειοδοτούμενη Εφαρμογή») οι οποίες καθίστανται διαθέσιμες σε εσάς μέσω αυτής της τηλεόρασης (αυτής της «Συσκευής») είναι αδειοδοτούμενα, και δεν πωλούνται, για χρήση μόνο υπό τους παρόντες όρους και προϋποθέσεις. Οι πάροχοι της Αδειοδοτούμενης Εφαρμογής (έκαστος ο «Πάροχος της Εφαρμογής») επιφυλάσσονται όλων των δικαιωμάτων τα οποία δεν έχουν χορηγηθεί ρητώς σε εσάς.\n\n1.Πεδίο Εφαρμογής της Άδειας \n\nΗ άδεια η οποία σας χορηγείται για μια Αδειοδοτημένη Εφαρμογή από τον οικείο Πάροχο Εφαρμογής περιορίζεται σε μια αμεταβίβαστη άδεια χρήσης της Αδειοδοτούμενης Εφαρμογής στη Συσκευή την οποία έχετε στην κατοχή ή τον έλεγχό σας. Δεν επιτρέπεται η διανομή ή η διάθεση της Αδειοδοτούμενης Εφαρμογής μέσω ενός δικτύου όπου θα μπορούσε να χρησιμοποιηθεί από πολλές συσκευές την ίδια στιγμή. Απαγορεύεται ο δανεισμός, η  εκμίσθωση, η πώληση, η αναδιανομή ή παραχώρηση άδειας της Αδειοδοτούμενης Εφαρμογής. \n\nΌλες οι Αδειοδοτούμενες Εφαρμογές και όλο το περιεχόμενο που περιλαμβάνεται σε αυτές οι οποίες είναι προσβάσιμες μέσω αυτής της Συσκευής ανήκουν στον Πάροχο της Εφαρμογής και προστατεύονται από την εφαρμοστέα νομοθεσία πνευματικής ιδιοκτησίας. Εκτός εάν άλλως επιτρέπεται από την εφαρμοστέα νομοθεσία, απαγορεύεται η τροποποίηση, η αντιγραφή, η αποσυμπίληση, η αποσυναρμολόγηση, η αναδημοσίευση, το ανέβασμα, η δημοσίευση, η μετάδοση, η μετάφραση, η απόπειρα εξαγωγής του πηγαίου κώδικα, η δημιουργία παραγώγων έργων ή η με άλλο τρόπο εκμετάλλευση οποιασδήποτε Αδειοδοτούμενης Εφαρμογής ή οποιωνδήποτε ενημερώσεων ή οποιουδήποτε μέρους αυτών. Η εκ μέρους σας παραβίαση της απαγόρευσης αυτής, ενδέχεται να επισύρει τυχόν δίωξη και αξιώσεις αποζημίωσης. Οι όροι της άδειας θα διέπουν τις ενημερώσεις που παρέχονται από τον Πάροχο της Εφαρμογής οι οποίες αντικαθιστούν και/ή συμπληρώνουν την αρχική Αδειοδοτούμενη Εφαρμογή, εκτός εάν η ενημέρωση αυτή συνοδεύεται από ξεχωριστή άδεια, στην οποία περίπτωση θα διέπεται από τους όρους της άδειας αυτής. Θα είστε αποκλειστικά υπεύθυνοι για οποιοδήποτε κόστος (εάν υφίσταται) για την ενημέρωση της Αδειοδοτούμενης Εφαρμογής.\n\n2.Υλικό Τρίτων Μερών\n\nΗ Αδειοδοτημένη Εφαρμογή ενδέχεται να επιτρέπει την πρόσβαση στις υπηρεσίες και ιστοσελίδες του Παρόχου της Εφαρμογής και τρίτων μερών (από κοινού οι «Υπηρεσίες»). Κάνοντας χρήση οποιασδήποτε από τις Υπηρεσίες, ενδέχεται να συναντήσετε περιεχόμενο το οποίο μπορεί να θεωρηθεί προσβλητικό, άσεμνο ή ανάρμοστο, του οποίου το περιεχόμενο ενδέχεται να χαρακτηριστεί ότι έχει σκληρή γλώσσα ή μη, και ότι τα αποτελέσματα οποιασδήποτε αναζήτησης ή εισαγωγής μιας συγκεκριμένης διεύθυνσης URL μπορεί να δημιουργήσουν αυτόματα και ακούσια συνδέσμους ή αναφορές σε ανάρμοστο υλικό. Ωστόσο, ο κατασκευαστής αυτής της Συσκευής (ο «Κατασκευαστής») και ο Πάροχος της Εφαρμογής δε φέρουν οποιαδήποτε ευθύνη απέναντί σας για περιεχόμενο που μπορεί να θεωρηθεί προσβλητικό, άσεμνο ή ανάρμοστο. \n\nΟ Κατασκευαστής δεν ευθύνεται για την εξέταση ή την αξιολόγηση του περιεχομένου, της ορθότητας, της πληρότητας, της επικαιρότητας, της εγκυρότητας, της συμμόρφωσης προς τα πνευματικά δικαιώματα, της νομιμότητας, της ποιότητας ή οποιασδήποτε άλλης πτυχής των Υπηρεσιών αυτών. Ο Κατασκευαστής δεν εγγυάται ούτε υποστηρίζει και δεν αναλαμβάνει και δεν φέρει καμία ευθύνη απέναντι σας ή έναντι οποιουδήποτε άλλου προσώπου για οποιαδήποτε από τις Υπηρεσίες. \n\nΟι Υπηρεσίες ενδέχεται να περιέχουν ιδιόκτητο περιεχόμενο, πληροφορίες και υλικό (από κοινού το « Υλικό Τρίτων Μερών») τα οποία προστατεύονται από την εφαρμοστέα νομοθεσία πνευματικής ιδιοκτησίας και άλλους νόμους, και δε θα πρέπει να χρησιμοποιείτε το Υλικό Τρίτων Μερών με οποιονδήποτε τρόπο, εκτός από την επιτρεπόμενη χρήση των Υπηρεσιών. Εκτός εάν άλλως επιτρέπεται από την εφαρμοστέα νομοθεσία, απαγορεύεται η αναπαραγωγή, η τροποποίηση, η ενοικίαση, η εκμίσθωση, ο δανεισμός, η πώληση, η διανομή του Υλικού Τρίτων Μερών ή η δημιουργία παραγώγων έργων αυτού με οποιονδήποτε τρόπο, και η εκ μέρους σας εκμετάλλευση των Υπηρεσιών με οποιονδήποτε μη εξουσιοδοτημένο τρόπο. Δεν θα χρησιμοποιείτε τις Υπηρεσίες με οποιονδήποτε τρόπο για την παρενόχληση, κατάχρηση, δίωξη, απειλή, δυσφήμηση, παρεμπόδιση ή άλλως παραβίαση των δικαιωμάτων οποιουδήποτε άλλου μέρους, και ο Κατασκευαστής δεν είναι σε καμία περίπτωση υπεύθυνος για οποιαδήποτε τέτοια χρήση από εσάς, ούτε για τυχόν παρενοχλητικά, απειλητικά, δυσφημιστικά, προσβλητικά ή παράνομα μηνύματα ή μεταδόσεις που ενδέχεται να λάβετε ως αποτέλεσμα της χρήσης οποιασδήποτε από τις Υπηρεσίες. \n\n3.Καμία Εγγύηση\n\nΌλες οι Αδειοδοτούμενες Εφαρμογές και Υπηρεσίες παρέχονται «ως είναι» και «ως διατίθενται» χωρίς οποιαδήποτε είδους εγγύηση, ρητή ή σιωπηρή. Ο Κατασκευαστής αποποιείται ρητά όλες τις εγγυήσεις και τις προϋποθέσεις αναφορικά με τις Αδειοδοτούμενες Εφαρμογές και τις Υπηρεσίες, είτε ρητές ή σιωπηρές, συμπεριλαμβανομένων ενδεικτικά και όχι περιοριστικά, εγγυήσεων εμπορευσιμότητας, ικανοποιητικής ποιότητας, καταλληλότητας για συγκεκριμένο σκοπό, ορθότητας, ήσυχης απόλαυσης, και μη παραβίασης δικαιωμάτων τρίτων μερών. Ο Κατασκευαστής δεν εγγυάται την ορθότητα, εγκυρότητα, επικαιρότητα, νομιμότητα ή πληρότητα οποιασδήποτε Αδειοδοτούμενης Εφαρμογής η Υπηρεσίας οι οποίες καθίστανται διαθέσιμες μέσω της Συσκευής αυτής και δεν εγγυάται ότι η Συσκευή, οι Αδειοδοτούμενες Εφαρμογές ή οι Υπηρεσίες θα ικανοποιούν τις απαιτήσεις σας, ή ότι η λειτουργία των Αδειοδοτούμενων Εφαρμογών ή των Υπηρεσιών θα είναι χωρίς διακοπή ή απαλλαγμένη από κάθε σφάλμα, ή ότι ελαττώματα στην Αδειοδοτούμενη Εφαρμογή ή τις Υπηρεσίες θα διορθωθούν. Σε περίπτωση που η Αδειοδοτούμενη Εφαρμογή ή οι Υπηρεσίες αποδειχθεί ότι είναι ελαττωματικές, θα αναλάβετε ολόκληρο το κόστος όλων των απαραίτητων εργασιών συντήρησης, επισκευής ή διόρθωσης.\n\nΟι Αδειοδοτούμενες Εφαρμογές και οι Υπηρεσίες ενδέχεται να αλλάξουν, να ανασταλούν, να αφαιρεθούν, να τερματιστούν ή να διακοπούν, ή η πρόσβαση σε αυτές μπορεί να απενεργοποιηθεί οποιαδήποτε στιγμή, χωρίς προειδοποίηση, και ο Κατασκευαστής δεν παρέχει καμία δήλωση ή εγγύηση ότι οποιοδήποτε περιεχόμενο ή υπηρεσία που περιλαμβάνεται στις Αδειοδοτούμενες Εφαρμογές και Υπηρεσίες θα παραμείνει διαθέσιμο για οποιοδήποτε χρονικό διάστημα. Αυτά τα περιεχόμενα και οι υπηρεσίες μεταδίδονται από τρίτους μέσω δικτύων και εγκαταστάσεων μετάδοσης οι οποίες δεν ελέγχονται από τον Κατασκευαστή. Χωρίς περιορισμό της γενικότητας των ανωτέρω περιγραφόμενων, ο Κατασκευαστής ρητά αποποιείται κάθε ευθύνη για οποιαδήποτε αλλαγή, διακοπή, απενεργοποίηση, κατάργηση ή αναστολή οποιουδήποτε περιεχομένου ή υπηρεσίας που διατίθεται μέσω αυτής της Συσκευής. Ο Πάροχος της Εφαρμογής και οι λοιποί πάροχοι των Υπηρεσιών διατηρούν το δικαίωμα να αλλάξουν, αναστείλουν, αφαιρέσουν, ή να απενεργοποιήσουν την πρόσβαση σε οποιαδήποτε Αδειοδοτούμενη Πρόσβαση ή Υπηρεσίες οποτεδήποτε χωρίς προειδοποίηση. Ο Κατασκευαστής δύναται επίσης να περιορίσει τη χρήση ή την πρόσβαση σε ορισμένες Αδειοδοτούμενες Εφαρμογές, σε οποιαδήποτε περίπτωση και χωρίς προειδοποίηση ή ευθύνη.\n\nΟ Κατασκευαστής δεν παρέχει υπηρεσία εξυπηρέτησης πελατών σχετικά με τις Αδειοδοτούμενες Εφαρμογές και τις Υπηρεσίες. Οποιαδήποτε ερώτηση ή αίτημα για εξυπηρέτηση σχετικά με τις Αδειοδοτούμενες Εφαρμογές και τις Υπηρεσίες θα πρέπει να απευθύνεται απευθείας στον αντίστοιχο πάροχο.\n\n4.Συλλογή και Χρήση των Πληροφοριών\n\nΟ Κατασκευαστής, οι Πάροχοι Εφαρμογών και οι πάροχοι των Υπηρεσιών ενδέχεται να συλλέγουν και να χρησιμοποιούν τεχνικά δεδομένα και σχετικές πληροφορίες, συμπεριλαμβανομένων ενδεικτικά και όχι περιοριστικά τεχνικών πληροφοριών σχετικά με τη Συσκευή αυτή, το σύστημα και το λογισμικό και τα περιφερειακά της εφαρμογής για τη διευκόλυνση της παροχής ενημερώσεων λογισμικού, της υποστήριξης προϊόντων και άλλων υπηρεσιών προς εσάς (εάν υφίστανται) σχετικά με τη Συσκευή και την Αδειοδοτούμενη Εφαρμογή. Ο Κατασκευαστής, οι Πάροχοι Εφαρμογών και οι πάροχοι των Υπηρεσιών ενδέχεται να χρησιμοποιήσουν τις πληροφορίες αυτές, εφόσον είναι σε μορφή που δεν σας ταυτοποιούν προσωπικά, με σκοπό τη βελτίωση των προϊόντων τους ή την παροχή σε εσάς υπηρεσιών ή τεχνολογιών. Για περισσότερες πληροφορίες σχετικά με τη συλλογή και τη χρήση πληροφοριών, παρακαλούμε επισκεφθείτε την πολιτική απορρήτου μας http://www.tcl.eu/en/. \n\n5.Μη Διαθεσιμότητα Ορισμένων Χαρακτηριστικών\n\nΛόγω περιορισμών του Παρόχου Εφαρμογής, ορισμένα χαρακτηριστικά, εφαρμογές, και υπηρεσίες ενδέχεται να μην είναι διαθέσιμες στη Συσκευή αυτή (συμπεριλαμβανομένων των περιφερειακών συσκευών αυτής) ή σε όλες τις περιοχές. Ορισμένα χαρακτηριστικά σε αυτή τη Συσκευή ενδέχεται επίσης να απαιτούν πρόσθετες περιφερειακές συσκευές ή συνδρομητικά τέλη τα οποία πωλούνται χωριστά.\n\n6.Περιορισμός Ευθύνης\n\nΣτο μέτρο που δεν απαγορεύεται από την εφαρμοστέα νομοθεσία, σε καμία περίπτωση, συμπεριλαμβανομένης της αμέλειας, ο Κατασκευαστής δε θα είναι υπεύθυνος, είτε συμβατικά είτε αδικοπρακτικά, για οποιαδήποτε άμεση, έμμεση, παρεπόμενη, ειδική ή επακόλουθη ζημία, αμοιβές δικηγόρων, έξοδα, ή οποιεσδήποτε άλλες ζημίες οι οποίες πηγάζουν από, ή σε σχέση με, κάθε πληροφορία που περιέχεται σε, ή ως αποτέλεσμα της χρήσης της Συσκευής, οποιασδήποτε Αδειοδοτούμενης Εφαρμογής ή οποιασδήποτε Υπηρεσίας από εσάς ή από οποιοδήποτε τρίτο μέρος, ακόμα και αν έχετε ενημερωθεί για την πιθανότητα επέλευσης τέτοιων ζημιών.\n\nΟ Κατασκευαστής ευθύνεται μόνο για δόλο και βαριά αμέλεια."];
var privacyNotice = ["\n\nΣεβόμαστε το απόρρητό σας κατά τη διαχείριση των προσωπικών δεδομένων σας. Η παρούσα Ενημέρωση Απορρήτου περιγράφει το νομικό πρόσωπο που είναι υπεύθυνο για την επεξεργασία των προσωπικών δεδομένων που συλλέγουμε από εσάς σχετικά με τη χρήση των Υπηρεσιών Smart TV που διαθέτουμε (\"οι Υπηρεσίες\"), ποιες κατηγορίες προσωπικών δεδομένων συλλέγουμε σχετικά με εσάς, τι κάνουμε με αυτά, καθώς και με τα δικαιώματά σας σχετικά με την χρήση των προσωπικών δεδομένων εκ μέρους μας. \n\n1.	Υπεύθυνος επεξεργασίας δεδομένων και εκπρόσωπος στην Ευρωπαϊκή Ένωση\n\nΗ συλλογή, επεξεργασία και χρήση των προσωπικών δεδομένων που συλλέγονται από εσάς όταν χρησιμοποιείτε τις Υπηρεσίες διενεργείται από την Shenzhen TCL New Technology Co., Ltd., No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, Κίνα (\"η Εταιρεία\"). Τα στοιχεία επικοινωνίας μας όπως επίσης και τα στοιχεία επικοινωνίας του εκπροσώπου μας στην Ευρωπαϊκή Ένωση παρέχονται στην Ενότητα 12 παρακάτω. Εντούτοις, παρακαλούμε να λάβετε υπόψη, ότι δεν είμαστε υπεύθυνοι για όλες τις δραστηριότητες επεξεργασίας δεδομένων που ορίζονται παρακάτω. Παρόλα αυτά έχουμε συμπεριλάβει μία περιγραφή των αντίστοιχων δραστηριοτήτων στην δική μας Ενημέρωση Απορρήτου καθώς η εν λόγω επεξεργασία συνδέεται με την χρήση εκ μέρους σας της Smart TV.\n\n2.	Συγκατάθεση για την επεξεργασία Δεδομένων\n\nΟρισμένες από τις δραστηριότητες επεξεργασίας δεδομένων που διενεργούμε απαιτούν την συγκατάθεσή σας, π.χ. η χρήση των προσωπικών σας δεδομένων για τον σκοπό της βελτίωσης των Υπηρεσιών.\n\nΗ συγκατάθεση είναι προαιρετική και θα είστε ακόμα σε θέση να χρησιμοποιήσετε τις Υπηρεσίες εάν δεν συναινέσετε. Εντούτοις, ενδέχεται να δείτε περιεχόμενο το οποίο δεν είναι προσαρμοσμένο στις προτιμήσεις σας. Ανεξάρτητα από την συγκατάθεσή σας διατηρούμε το δικαίωμα να επεξεργαστούμε τα προσωπικά σας δεδομένα στον βαθμό που επιτρέπεται από το εφαρμοστέο δίκαιο.\n\nΜπορείτε να ανακαλέσετε την συγκατάθεσή σας ανά πάσα στιγμή. Η ανάκληση της συγκατάθεσης δεν θα επηρεάσει την νομιμότητα της επεξεργασίας που βασίζεται στην συγκατάθεση πριν από την ανάκλησή της. Προκειμένου να ανακαλέσετε την συγκατάθεσή σας και/ή να εναντιωθείτε (στην επεξεργασία) (πρβ. με την Ενότητα 10 και το Παράρτημα με τα Δικαιώματά Σας παρακάτω για τα δικαιώματα σας στην εναντίωση), παρακαλούμε να αλλάξετε τις ρυθμίσεις απορρήτου της Smart TV σας αναλόγως.\n\n3.	Ειδικές κατηγορίες προσωπικών δεδομένων \n\nΕπεξεργαζόμαστε ειδικότερα τις ακόλουθες κατηγορίες δεδομένων:\n\nΑναγνωριστικό Ταυτότητας της Συσκευής (Device-ID): Η Smart TV σας αποθηκεύει ένα σταθερό ξεχωριστό αριθμό που μας δίνει τη δυνατότητα να ταυτοποιήσουμε και να πιστοποιήσουμε τη γνησιότητα της Smart TV όταν χρησιμοποιείτε τις Υπηρεσίες. Αυτός ο αριθμός αποκαλείται Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID). \n\nΔιεύθυνση Διαδικτυακού Πρωτοκόλλου (IP address) και διεύθυνση Ελέγχου Προσπέλασης στο Μέσο (MAC address): Μια Διεύθυνση Διαδικτυακού Πρωτοκόλλου (IP address) θα καθοριστεί στην Smart TV σας όταν αποκτήσετε πρόσβαση στο Διαδίκτυο. Εάν η Smart TV σας χρησιμοποιεί έναν δρομολογητή (router) (π.χ. σε ένα τοπικό οικιακό δίκτυο ή τοπικό WLAN), ενδέχεται να επεξεργαστούμε την Διεύθυνση Διαδικτυακού Πρωτοκόλλου (IP address) αυτού του δρομολογητή (router). Η διεύθυνση MAC είναι ένας ξεχωριστός αριθμός που αντιστοιχεί σε κάθε δίκτυο σύνδεσης με την Smart TV σας. \n\nΕιδικές πληροφορίες Συσκευής: Η Smart TV αποθηκεύει αρκετές πληροφορίες σχετικά με τα χαρακτηριστικά της και τις ρυθμίσεις της. Αυτές οι πληροφορίες περιλαμβάνουν το είδος  της Smart TV, την έκδοση του συστήματος λειτουργίας της Smart TV, την ανάλυση του πίνακα οργάνων της (panel resolution), το αναγνωριστικό ταυτότητας έργου (project ID) (ήτοι τις πληροφορίες σχετικά με τα αρχεία ρυθμίσεων), τον πράκτορα χρήστη, το όνομα του προγράμματος περιήγησης, την έκδοση του προγράμματος περιήγησης, καθώς και τη γλώσσα και τη χώρα που έχουν ρυθμιστεί στην Smart TV. \n\nΑυτές οι πληροφορίες θα χρησιμοποιηθούν από εμάς και θα παρασχεθούν στον συνεργάτη παροχής υπηρεσιών και στους συνεταίρους για τους σκοπούς που περιγράφονται παρακάτω.\n\n4.	Σκοποί για τους οποίους επεξεργαζόμαστε και/ή χρησιμοποιούμε τα προσωπικά σας δεδομένα και νομικές βάσεις\n\nΟι σκοποί για τους οποίους επεξεργαζόμαστε τα προσωπικά σας δεδομένα και οι αντίστοιχες νομικές βάσεις περιγράφονται παρακάτω. Στον βαθμό που συμβατικοί σκοποί αναφέρονται παρακάτω ως νομική βάση, δεν μπορούμε να σας παρέχουμε τις Υπηρεσίες εάν δεν μας παράσχετε τα αντίστοιχα δεδομένα. Στον βαθμό που η συγκατάθεσή σας αναφέρεται ως νομική βάση, μπορείτε να παράσχετε την συγκατάθεσή σας ή να αρνηθείτε να την  παράσχετε. Εάν δεν παράσχετε την συγκατάθεσή σας, δεν θα επεξεργαστούμε τα προσωπικά σας δεδομένα για τον αντίστοιχο σκοπό.\n\n•	Παροχή των Υπηρεσιών: Χρησιμοποιούμε την διεύθυνση IP και τη διεύθυνση MAC, το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID), την έκδοση του συστήματος λειτουργίας της Smart TV, τον τύπο προγράμματος-πελάτη της Smart TV σας και την ανάλυση του πίνακα οργάνων της, το αναγνωριστικό ταυτότητας έργου (project ID) (ήτοι τις πληροφορίες σχετικά με τα αρχεία ρυθμίσεων), την λίστα καναλιών της DTV σας (ψηφιακής τηλεόρασης), τα κανάλια που έχετε παρακολουθήσει, τη ζώνη ώρας, τις ρυθμίσεις χώρας και γλώσσας για να παράσχουμε στην Smart TV σας πρόσβαση στις Υπηρεσίες καθώς και τις υπηρεσίες που παρέχονται από τους συνεταίρους. Οι σκοποί περιλαμβάνουν (ενδεικτικά) την παροχή σε εσάς υπηρεσιών με βάση την τοποθεσία (π.χ. πρόγνωση καιρού), την καταχρηστική διαχείριση, την διαχείριση περιστατικών ασφαλείας, τον έλεγχο της διαθεσιμότητας των Υπηρεσιών, καθώς και την παροχή υπηρεσιών υποστήριξης των προτιμήσεων των χρηστών.\n\nΌταν χρησιμοποιείτε τις Υπηρεσίες η Smart TV σας θα ζητήσει δεδομένα από τις Υπηρεσίες μέσω Διαδικτύου. Ως τμήμα αυτών των αιτημάτων η διεύθυνση IP σας όπως περιγράφεται παραπάνω καθώς και η γλώσσα και η χώρα που έχουν ρυθμιστεί στην Smart TV σας θα διαβιβασθούν στον συνεργάτη μας παροχής υπηρεσιών. Ο συνεργάτης μας παροχής υπηρεσιών θα επεξεργαστεί τα αντίστοιχα δεδομένα σύμφωνα με την ενημέρωση του απορρήτου των δεδομένων.\n\nΗ νομική βάση για την αντίστοιχη επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του Γενικού Κανονισμού Προστασίας Δεδομένων (“GDPR”).\n\n•	Ρυθμίσεις Υπηρεσιών: Ως τμήμα της τακτικής λειτουργικότητας των Υπηρεσιών μπορείτε να ρυθμίσετε χειροκίνητα τη σειρά με την οποία παρουσιάζονται οι εφαρμογές από τις Υπηρεσίες. Ο συνεργάτης μας παροχής υπηρεσιών θα αποθηκεύσει τις ρυθμίσεις και τις άλλες προτιμήσεις που ενδέχεται να ρυθμίσετε κατά τη διάρκεια της χρήσης των Υπηρεσιών. Οι πληροφορίες αυτές θα συνδέονται με το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID).\n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\n•	Έλεγχος ταυτότητας: Όποτε συνδέετε την Smart TV σας στο Διαδίκτυο και ενεργοποιείτε την Smart TV, θα συνδεθεί αυτόματα στις Υπηρεσίες, οι οποίες τελούν υπό τη διαχείριση του συνεργάτη μας παροχής υπηρεσιών. Τότε η Smart TV σας θα πιστοποιηθεί ως εγκεκριμένη για πρόσβαση στις Υπηρεσίες. Για τους σκοπούς της πιστοποίησης, οι Υπηρεσίες αποθηκεύουν έναν ή περισσότερους ξεχωριστούς αναγνωριστικούς αριθμούς που σχετίζονται με την Smart TV σας. Χρησιμοποιούμε το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID) και τη διεύθυνση MAC για τους σκοπούς της πιστοποίησης. Επίσης, παρέχουμε το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID) σε επιλεγμένους συνεργάτες περιεχομένου για τους σκοπούς της πιστοποίησης. Οι εν λόγω συνεργάτες περιεχομένου χρησιμοποιούν το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID) για την πιστοποίηση της Smart TV σας με σκοπό την απόκτηση πρόσβασης στις υπηρεσίες που παρέχονται από συνέταιρο.\n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\n•	Τηλεδιάγνωση: Ως τμήμα των Υπηρεσιών, σας παρέχουμε υπηρεσίες τηλεδιάγνωσης. Συνεπώς, επεξεργαζόμαστε το Αναγνωριστικό ταυτότητα της Συσκευής (Device-ID), τον αριθμό της συσκευής, τον αριθμό σειράς, τη διεύθυνση MAC, και τις λανθασμένες καταγραφές, τους λανθασμένους κωδικούς και τις λανθασμένες περιγραφές που παρέχονται αυτόματα από ελαττωματική λειτουργική μονάδα (εφαρμογή, σύστημα ενδιάμεσου λογισμικού).\n\nΕπιπρόσθετα, εάν καλέσετε την δική μας υποστήριξη πελατών, βάσει της προηγούμενης έγκρισής σας, ένας βοηθητικός υπάλληλος μπορεί επίσης να αποκτήσει εξ αποστάσεως πρόσβαση στην δική σας Τηλεόραση και να εκτελέσει περαιτέρω υπηρεσίες τηλεδιάγνωσης. Σε αυτή την περίπτωση, ο υπάλληλος της υποστήριξης πελατών αποκτά πρόσβαση στην Τηλεόραση και στα δίκτυά σας, στην εφαρμογή και στα αποθηκευμένα αρχεία δεδομένων σας, και ενδέχεται να επεξεργαστεί το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID), τον αριθμό συσκευής, τον αριθμό σειράς, την διεύθυνση MAC, τις λανθασμένες καταγραφές, τους λανθασμένους κωδικούς, τις λανθασμένες περιγραφές, το Αναγνωριστικό Ταυτότητας του Τερματικού (Terminal-ID), τις πληροφορίες της εγκατεστημένης Εφαρμογής, τις πληροφορίες απεικόνισης οθόνης Τηλεόρασης και της συνδεδεμένης συσκευής USB/Bluetooth για την αξιολόγηση της κατάστασης της Τηλεόρασης και των συναφών εφαρμογών και δεδομένων. Οι λανθασμένες καταγραφές ενδέχεται να περιλαμβάνουν πληροφορίες, όπως ιστορικό του προγράμματος Τηλεόρασης, λίστα αναπαραγωγής μουσικής, το όνομα χρήστη και τον κωδικό πρόσβασης της Εφαρμογής εάν σε μια Εφαρμογή τρίτου που χρησιμοποιήθηκε για την μετάδοση, δεν πραγματοποιήθηκε κρυπτογράφηση για αυτές τις πληροφορίες. Αυτό θα πραγματοποιηθεί προκειμένου να διαγνωσθούν προβλήματα, να τροποποιηθούν οι λειτουργίες του συστήματος σύμφωνα με το αίτημά σας, ή προκειμένου να διορθωθούν ζητήματα, που έχουν αναφερθεί. Επιπλέον, κατόπιν αιτήματος, τα μέλη της υποστήριξης πελατών ενδέχεται να επιλύσουν προβλήματα, να τρέξουν προγράμματα ή να εγκαταστήσουν/απεγκαταστήσουν λογισμικό, να αναπρογραμματίσουν και/ή να εκτελέσουν άλλως υπηρεσίες ή εργασίες τεχνικής υποστήριξης στην Τηλεόραση.\n\nΟποιαδήποτε πρόσβαση εξ αποστάσεως θα λάβει χώρα αφότου ενεργοποιήσετε τη λειτουργία υποστήριξης εξ αποστάσεως επιλέγοντας το καθορισμένο κουτάκι στην Τηλεόρασή σας και θα λήξει μετά από την αντίστοιχη περίοδο λειτουργίας. \n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς, σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\n•	Εξυπηρέτηση μετά την πώληση (επισκευή): Σύμφωνα με το εφαρμοστέο δίκαιο ενδέχεται να έχετε δικαίωμα εγγύησης ή παρόμοια δικαιώματα για την παροχή υπηρεσιών μετά την πώληση. Η TCL Europe, στη διεύθυνση 9-15 rue Rouget de L'Isle- 92130 Issy- Les-Moulineaux, Γαλλία είναι αρμόδια για τη διαχείριση αξιώσεων εγγύησης και άλλων αιτημάτων για την παροχή υπηρεσιών μετά την πώληση και την επεξεργασία των προσωπικών σας δεδομένων που συνδέονται με αυτήν. Ήτοι, για τους σκοπούς της παροχής υπηρεσιών μετά την πώληση, η TCL Europe ενεργεί ως υπεύθυνη επεξεργασίας δεδομένων και εμείς δεν είμαστε αρμόδιοι για την σχετική επεξεργασία των προσωπικών σας δεδομένων.\n\nΌταν ζητάτε την εκ μέρους μας παροχή υπηρεσιών μετά την πώληση, ενδέχεται να ζητηθούν το όνομά σας, η διεύθυνση ηλεκτρονικού σας ταχυδρομείου, ο αριθμός τηλεφώνου σας, το αίτημα υπηρεσίας και η ταχυδρομική σας διεύθυνση που περιλαμβάνονται στο τιμολόγιο για τον σκοπό της παροχής σε εσάς των υπηρεσιών μετά την πώληση. Οι πληροφορίες ενδέχεται επίσης να συλλεχθούν μέσω των μετά την πώληση συνεργατών των μεταπωλητών μας ή των εξουσιοδοτημένων παρόχων υπηρεσιών εάν τους ζητήσετε να σας εξυπηρετήσουν. Μπορείτε να επικοινωνήσετε με την TCL Europe βάσει των στοιχείων επικοινωνίας που ορίζονται στην Ενότητα 12 παρακάτω για περισσότερες πληροφορίες σχετικά με την προστασία προσωπικών δεδομένων σε σχέση με την παροχή υπηρεσιών μετά την πώληση.\n\nΗ νομική βάση για την σχετική επεξεργασία είναι η υποχρέωση συμμόρφωσης με τις νόμιμες υποχρεώσεις σύμφωνα με το Άρθρο 6 (1) c) του GDPR.\n\n•	T-Channel: ΟT-Channel είναι η κύρια σελίδα για την χρήση της Smart TV στο λειτουργικό σύστημα Linux (παρακαλούμε να δείτε παρακάτω για την χρήση του λειτουργικού συστήματος android) και σας επιτρέπει να επιλέγετε συγκεκριμένο περιεχόμενο.\n\nΗ νομική βάση για την επεξεργασία των προσωπικών σας δεδομένων που είναι απαραίτητα για την χρήση εκ μέρους σας του  T-Channel συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\nΒάσει της προηγούμενης συγκατάθεσής σας, θα ελέγχουμε επίσης τη χρήση του T-Channel, ήτοι:\n\n	Όταν ξεκινάτε να χρησιμοποιείτε τον T-Channel, θα καταγράφουμε την ώρα εισόδου και εξόδου από τον T-Channel.\n\n	Όταν ξεκινάτε να αναπαράγετε ένα βίντεο του T-Channel, θα καταγράφουμε το όνομα και την διάρκεια του βίντεο (δεν εφαρμόζεται στο Netflix, στο YouTube ή σε οποιαδήποτε άλλη υπηρεσία που παρέχεται από τρίτο μέρος).\n\n	Όταν εισέρχεστε ή αποχωρείτε από μια σελίδα, θα καταγράφουμε τον χρόνο παραμονής σας στην σελίδα.\n\n	Όταν μετακινείτε τον κέρσορά σας από μια τοποθεσία σε μια άλλη, ή εισέρχεστε σε μια εφαρμογή, θα καταγράφουμε αυτό το γεγονός.\n\n	Όταν εγκαθιστάτε, καταργείτε ή ενημερώνετε εφαρμογές, θα καταγράφουμε αυτά τα γεγονότα, συμπεριλαμβανομένου του ονόματος των εφαρμογών.\n\nΣυλλέγουμε αυτές τις πληροφορίες κυρίως για την ανάλυση μεγάλων συνόλων δεδομένων με σκοπό την βελτίωση των προϊόντων και την παροχή υπηρεσιών καλύτερου περιεχομένου στους χρήστες.\n\nΗ νομική βάση για την επεξεργασία των προσωπικών σας δεδομένων σε σχέση με τον έλεγχο της χρήσης εκ μέρους σας του T-Channel συνίσταται στην συγκατάθεσή σας σύμφωνα με το Άρθρο 6 (1) a) του GDPR.\n\nΕάν έχετε αγοράσει μια Android TV και χρησιμοποιείται το android λειτουργικό σύστημα της Google, τα προσωπικά σας δεδομένα θα λάβουν επεξεργασία από την Google, ενώ εμείς δεν θα είμαστε αρμόδιοι για αυτήν την επεξεργασία. Παρακαλούμε να ανατρέξετε στην ενημέρωση απορρήτου της Google για πληροφορίες αναφορικά με τη σχετική επεξεργασία των δεδομένων σας και τα αντίστοιχα δικαιώματά σας.\n\n•	T-Cast: Το T-Cast σας επιτρέπει να λειτουργείτε την Τηλεόρασή σας χρησιμοποιώντας το τηλέφωνό σας και με σκοπό την κοινοποίηση βίντεο, μουσικής και φωτογραφιών που είναι αποθηκευμένες στο smart phone σας στην Τηλεόραση. Επίσης το T-Cast σας επιτρέπει να αντικατοπτρίσετε το smartphone σας στην Τηλεόρασή σας.\n\nΗ μεταφόρτωση και χρήση της εφαρμογής είναι προαιρετική. Εάν κατεβάσετε και χρησιμοποιήσετε την εφαρμογή, θα επεξεργαστούμε την διεύθυνση MAC για να υπολογίσουμε πόσες εκδοχές T–Cast έχουν χρησιμοποιηθεί στην αγορά. Αυτό απαιτείται για να μπορέσουμε να σας προσφέρουμε αυτή την υπηρεσία. Εάν χρησιμοποιήσετε την λειτουργία διπλής οθόνης που διαθέτουμε, οι έλεγχοι που ενεργοποιείτε στην εφαρμογή και οι ρυθμίσεις χώρας και γλώσσας, η λίστα καναλιών Ψηφιακής Τηλεόρασης (DTV), οι λίστες αγαπημένων καναλιών, οι λίστες χρονοδιαγράμματος, το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID), ο σταθμός που παρακολουθείτε, η έκδοση πρωτοκόλλου και η διεύθυνση IP της Smart TV σας θα συλλεχθούν και θα λάβουν επεξεργασία από εμάς στους διακομιστές (servers) μας. Οι διακομιστές (servers) μας θα ελέγξουν τότε την Smart TV σας όπως έχετε δώσει οδηγίες στην εφαρμογή.\n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\n•	Βοηθός TCL: O Βοηθός TCL είναι μία λειτουργία που επιτρέπει στην Τηλεόρασή σας να συνδεθεί με τις συμβατές συσκευές του Amazon Alexa (όπως το Echo) προκειμένου να χειριστείτε αυτές τις συσκευές με την φωνή σας. Προκειμένου να χρησιμοποιήσετε την εν λόγω λειτουργία, χρειάζεται πρώτα να  καταχωρίσετε την Τηλεόρασή σας στον ιστότοπο του Amazon χρησιμοποιώντας τον κωδικό TCL που μπορείτε να βρείτε στην Τηλεόρασή σας. Μπορείτε έπειτα να δώσετε προφορικές οδηγίες στην συμβατή συσκευή του Amazon Alexa πατώντας το πλήκτρο του μικροφώνου στο τηλεχειριστήριο της Τηλεόρασή σας. \n\nΕάν χρησιμοποιήσετε τον Βοηθό TCL, η Τηλεόρασή σας θα συλλέξει τη φωνή σας και θα την αποστείλει στο Υπολογιστικό Νέφος (Cloud) του Amazon Alexa για αναγνώριση φωνής και περαιτέρω επεξεργασία. Τα δεδομένα σας θα διαβιβαστούν αμέσως στο Amazon και κανένα δεδομένο δεν θα υπαχθεί περαιτέρω σε επεξεργασία ή θα αποθηκευτεί τοπικά στην Τηλεόρασή σας. Παρακαλούμε όπως ανατρέξετε στην ενημέρωση απορρήτου του Amazon για πληροφορίες σχετικά με την περαιτέρω επεξεργασία των δεδομένων σας από το Amazon.\n\nH νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\n•	Alexa Voice Recognition (AVS): To ΑVS είναι μια λειτουργία που σας επιτρέπει να χειριστείτε την Τηλεόραση με τη φωνή σας. Προκειμένου να χρησιμοποιήσετε την εν λόγω λειτουργία, χρειάζεται πρώτα να καταχωρίσετε την Τηλεόρασή σας στον ιστότοπο του Amazon χρησιμοποιώντας τον κωδικό καταχώρισης που δημιουργήθηκε από το Amazon. Μπορείτε έπειτα να δώσετε προφορικές οδηγίες στην Τηλεόραση πατώντας το πλήκτρο του μικροφώνου στο τηλεχειριστήριο της Τηλεόρασής σας.\n\nΕάν χρησιμοποιήσετε το AVS, η Τηλεόρασή σας θα συλλέξει την φωνή σας και θα την αποστείλει στο Υπολογιστικό Νέφος (Cloud) του Amazon Alexa για αναγνώριση φωνής και περαιτέρω επεξεργασία. Τα δεδομένα σας θα διαβιβαστούν αμέσως στο Amazon και κανένα δεδομένο δεν θα αποθηκευτεί τοπικά στην Τηλεόρασή σας. Παρακαλούμε όπως ανατρέξετε στην ενημέρωση απορρήτου του Amazon για πληροφορίες σχετικά με την περαιτέρω επεξεργασία των δεδομένων σας από το Amazon.\n\nΌταν χρησιμοποιείτε το AVS, θα ζητηθεί το όνομα της Τηλεόρασή σας προκειμένου να μας επιτρέψει να βρούμε ποια Τηλεόραση θα θέλατε να χειριστείτε. \n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\nΑκόμα, θα καταγράψουμε πόσο συχνά και για πόσο καιρό έχετε χρησιμοποιήσει το AVS, και ποια λειτουργία έχετε χρησιμοποιήσει εντός του AVS. Συλλέγουμε τις εν λόγω πληροφορίες για να βελτιώσουμε τα προϊόντα και να παράσχουμε καλύτερα τις υπηρεσίες περιεχομένου στους χρήστες. \n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στα έννομα συμφέροντά μας σύμφωνα με το Άρθρο 6 (1) f) του GDPR. Περισσότερες πληροφορίες σχετικά με τον έλεγχο εξισορρόπησης διατίθενται κατόπιν αιτήματος. \n\n•	Ενημερώσεις λογισμικού: Οι ενημερώσεις λογισμικού αποτελούν τμήμα των Υπηρεσιών. Συνεπώς, κάθε φορά που η Smart TV σας είναι ενεργοποιημένη, θα μας παρέχει την διεύθυνση IP, το Αναγνωριστικό Ταυτότητας της Συσκευής (Device-ID), τον αριθμό της συσκευής, την έκδοση λογισμικού, την κατηγορία πελατών της Smart TV σας, το αναγνωριστικό ταυτότητας έργου (project ID) (ήτοι αρχεία ρυθμίσεων), το αναγνωριστικό ταυτότητας χρήστη, τον αύξοντα αριθμό για να δούμε εάν οι ενημερώσεις λογισμικού είναι διαθέσιμες και για να σας προσφέρουμε και να σας παράσχουμε  τις κατάλληλες ενημερώσεις λογισμικού.\n\nΗ νομική βάση για την σχετική επεξεργασία των προσωπικών σας δεδομένων συνίσταται στους συμβατικούς σκοπούς σύμφωνα με το Άρθρο 6 (1) b) του GDPR.\n\n•	Επιβολή του νόμου: Ενδέχεται να μας ζητηθεί να παράσχουμε δεδομένα στις αρμόδιες αρχές επιβολής του νόμου ή στα δικαστήρια. Εάν ενεργήσουμε έτσι, θα το πράξουμε μόνο βάσει ενός δεσμευτικού ενδίκου μέσου όπως βάσει εντάλματος ή δικαστικής απόφασης, τα οποία απαιτούν από εμάς να συνεργαστούμε με τις αντίστοιχες αρχές.\n\nΗ νομική βάση για την σχετική επεξεργασία συνίσταται στην υποχρέωσή μας να συμμορφωνόμαστε με τις νόμιμες υποχρεώσεις μας σύμφωνα με το Άρθρο 6 (1) c) του GDPR.\n\nΗ χρήση των Υπηρεσιών είναι εφικτή με τη χρήση ψευδωνύμων, εκτός εάν ειδικές υπηρεσίες απαιτούν να μας παρέχετε το όνομά σας και/ή τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας.\n\n5.	Απόρρητο και ασφάλεια παιδιών κάτω των 16 ετών \n\nΚατανοούμε την σημασία της λήψης επιπλέον μέτρων ασφαλείας για την προστασία του απορρήτου και της ασφάλειας των παιδιών που χρησιμοποιούν τις Υπηρεσίες μας. Τα παιδιά κάτω των 16 ετών, ή αντίστοιχου κατώτερου ορίου ηλικίας στην αντίστοιχη δικαιοδοσία, δεν επιτρέπεται να παρέχουν τις προσωπικές τους πληροφορίες μέσω της Τηλεόρασης ή όταν καλούν για υπηρεσίες μετά την πώληση, εκτός εάν οι γονείς τους έχουν παράσχει την συγκατάθεσή τους η οποία μπορεί να επαληθευτεί.\n\nΚαθώς δεν συλλέγουμε ποτέ τις ημερομηνίες γέννησης των χρηστών, δεν μπορούμε να ταυτοποιήσουμε την ηλικία των χρηστών. Εάν όμως μάθουμε ότι έχουμε συλλέξει τις προσωπικές πληροφορίες παιδιού κάτω των 16 ετών, ή αντίστοιχου κατώτερου ορίου ηλικίας ανάλογα με την δικαιοδοσία, πέρα από τις παραπάνω συνθήκες θα λάβουμε μέτρα για τη διαγραφή των πληροφοριών το ταχύτερο δυνατόν.\n\n6.	Εφαρμογές τρίτων\n\nΗ Smart TV σας επιτρέπει τη χρήση εφαρμογών που παρέχονται από τρίτους, όπως για παράδειγμα το Netflix, το YouTube ή το HbbTV (υπηρεσία συνδρομητή που παρέχεται από τους τηλεοπτικούς σταθμούς). Μπορείτε να κατεβάσετε τις εφαρμογές από το κατάστημα των εφαρμογών “app store” ή να ενεργοποιήσετε εφαρμογές τρίτων που είναι ήδη προ-εγκατεστημένοι στην συσκευή σας. Καμία εφαρμογή τρίτου που είναι προ-εγκατεστημένη στη συσκευή σας δεν συλλέγει προσωπικά δεδομένα χωρίς την προηγούμενη έγκρισή σας. Π.χ. το Netflix είναι ήδη προ-εγκατεστημένο στη συσκευή αλλά συλλέγει μόνο δεδομένα όταν συνδέεστε στον δικό σας λογαριασμό Netflix. Το HbbTV συλλέγει μόνο δεδομένα όταν έχετε δώσει τη συγκατάθεσή σας για τη συλλογή, πατώντας το καθορισμένο πλήκτρο στο τηλεχειριστήριό σας.\n\nΕάν εγκαταστήσετε μια εφαρμογή τρίτου, ενδέχεται να λάβουν επεξεργασία προσωπικά δεδομένα σχετικά με εσάς από τον πάροχο της εφαρμογής. Δεν είμαστε υπεύθυνοι για τέτοιου είδους επεξεργασίες, παρακαλούμε να ανατρέξτε στη δήλωση απορρήτου του τρίτου μέρους για πληροφορίες σχετικά με την σχετική επεξεργασία των δεδομένων σας και τα αντίστοιχα δικαιώματά σας.\n\n7.	Κατηγορίες αποδεκτών\n\nΚοινοποιούμε τα προσωπικά σας δεδομένα που συλλέγονται κατά τη διάρκεια της χρήσης εκ μέρους σας των Υπηρεσιών μόνο σε τρίτους συνεταίρους εάν ζητήσετε συγκεκριμένο περιεχόμενο που παρέχεται από αυτούς τους συνεταίρους ή σε παρόχους υπηρεσιών ως εκτελούντες την επεξεργασία που μας βοηθούν στην παροχή των Υπηρεσιών.\n\nΚοινοποιούμε τα προσωπικά σας δεδομένα σε άλλους τρίτους μόνο εάν είμαστε υποχρεωμένοι να το πράξουμε στη βάση νόμιμων απαιτήσεων (π.χ. σε δικαστήρια ή εισαγγελικές αρχές), εάν έχετε συναινέσει στην σχετική κοινοποίηση ή εάν η κοινοποίηση είναι άλλως θεμιτή βάσει του εφαρμοστέου δικαίου.\n\n8.	Χώρες στις οποίες θα λάβουν επεξεργασία τα δεδομένα σας\n\nΕμείς και/ή ορισμένοι από τους αποδέκτες των προσωπικών σας δεδομένων που απαριθμούνται παραπάνω ενδέχεται να βρίσκονται εκτός του Ευρωπαϊκού Οικονομικού Χώρου (π.χ. στη Λαϊκή Δημοκρατία της Κίνας, ή στις Ηνωμένες Πολιτείες Αμερικής). Συνεπώς, τα προσωπικά σας δεδομένα ενδέχεται να λάβουν επεξεργασία στις χώρες όπου οι νομοθεσίες για την προστασία δεδομένων ενδέχεται να παρέχουν ένα διαφορετικό επίπεδο προστασίας σε σύγκριση με τη νομοθεσία στη δικαιοδοσίας σας και οι οποίες δεν αναγνωρίζονται ως χώρες που παρέχουν ένα επαρκές επίπεδο προστασίας προσωπικών δεδομένων σύμφωνα με τον GDPR. Στις χώρες που παρέχουν ένα επαρκές επίπεδο προστασίας δεδομένων από την οπτική της Ευρωπαϊκής νομοθεσίας για την προστασία δεδομένων περιλαμβάνεται η Ανδόρρα, η Αργεντινή, ο Καναδάς, η Ελβετία, οι Φερόες Νήσοι, το Γκέρνσεϋ, το Κράτος του Ισραήλ, η Νήσος του Μαν, το Τζέρσι, η Νέα Ζηλανδία και η Ανατολική Δημοκρατία της Ουρουγουάης. Οι αποδέκτες στις ΗΠΑ ενδέχεται μερικώς να πιστοποιούνται βάσει της Ασπίδας Προστασίας Απορρήτου ΕΕ-ΗΠΑ και επομένως αναγνωρίζονται ως παρέχοντες ένα επαρκές επίπεδο προστασίας δεδομένων από την οπτική της Ευρωπαϊκής νομοθεσίας για την προστασία δεδομένων. \n\nΌπου απαιτείται, θα θέσουμε σε εφαρμογή κατάλληλα μέτρα ασφαλείας σε σχέση με τις διαβιβάσεις δεδομένων σε αποδέκτες εκτός της Ευρωπαϊκής Ένωσης που δεν παρέχουν ένα επαρκές επίπεδο προστασίας δεδομένων. Αντίγραφο των σχετικών μέτρων μπορεί να ζητηθεί επικοινωνώντας μαζί μας όπως ορίζεται στην Ενότητα 12 παρακάτω.\n\n9.	Περίοδος Αποθήκευσης\n\nΤα προσωπικά σας δεδομένα θα διατηρηθούν για όσο χρόνο απαιτείται εκ μέρους μας προκειμένου να σας παράσχουμε τις Υπηρεσίες. Για τα περισσότερα δεδομένα αυτό σημαίνει γενικά ότι θα διατηρήσουμε τα δεδομένα σας για ένα μήνα. Για τον σκοπό της τηλεδιάγνωσης και την παροχή υπηρεσιών μετά την πώληση ενδέχεται να διατηρήσουμε τα δεδομένα σας μέχρι και δέκα χρόνια. Όταν δεν χρειάζεται πλέον να χρησιμοποιήσουμε τα προσωπικά σας δεδομένα για τη συμμόρφωση με συμβατικές ή κανονιστικές υποχρεώσεις, θα τα αφαιρέσουμε από τα συστήματά μας και τα αρχεία μας και/ή θα λάβουμε μέτρα για να τα ανωνυμοποιήσουμε κατάλληλα έτσι ώστε να μην μπορείτε πλέον να ταυτοποιηθείτε από αυτά.\n\n10.	Τα δικαιώματά σας\n\nΣύμφωνα με το εφαρμοστέο δίκαιο προστασίας δεδομένων ενδέχεται να  έχετε το δικαίωμα να: ζητήσετε την απόκτηση πρόσβασης στα προσωπικά σας δεδομένα, να ζητήσετε τη διόρθωση των προσωπικών σας δεδομένων, να ζητήσετε τη διαγραφή των προσωπικών σας δεδομένων, να ζητήσετε τον περιορισμό της επεξεργασίας των προσωπικών σας δεδομένων, να ζητήσετε τη φορητότητα των δεδομένων, και να εναντιωθείτε στην επεξεργασία των προσωπικών σας δεδομένων. Παρακαλούμε να λάβετε υπόψη ότι αυτά τα προαναφερόμενα δικαιώματα μπορούν να περιοριστούν βάσει του εφαρμοστέου εθνικού δικαίου προστασίας δεδομένων. Για περαιτέρω πληροφορίες σχετικά με αυτά τα δικαιώματα παρακαλούμε να ανατρέξετε στο Παράρτημα με «τα Δικαιώματά σας» παρακάτω.\n\nΈχετε επίσης το δικαίωμα να υποβάλλετε καταγγελία στην αρμόδια εποπτική αρχή προστασίας δεδομένων.\n\nΓια την άσκηση των δικαιωμάτων σας παρακαλούμε να επικοινωνήσετε μαζί μας όπως ορίζεται στην Ενότητα 12 παρακάτω.\n\n11.	Αλλαγές στην Ενημέρωση Απορρήτου\n\nΓια τη βελτίωση των Υπηρεσιών μας ενδέχεται να απαιτήσουμε τροποποιήσεις στην εν λόγω Ενημέρωση Απορρήτου – π.χ. κατά την εφαρμογή νέων τεχνολογιών ή την εισαγωγή νέων υπηρεσιών. Διατηρούμε το δικαίωμα να αλλάξουμε ή να συμπληρώσουμε την εν λόγω Ενημέρωση  Απορρήτου ανά πάσα στιγμή.\n\n12.	Στοιχεία επικοινωνίας και αντιπρόσωπος στην Ευρωπαϊκή Ένωση\n\nΕάν έχετε οποιαδήποτε ερώτηση σχετικά με την Ενημέρωση Απορρήτου ή θα θέλατε να υποβάλλετε καταγγελία για τη διαχείριση εκ μέρους μας των προσωπικών σας δεδομένων, παρακαλούμε όπως επικοινωνήσετε μαζί μας χρησιμοποιώντας τα ακόλουθα στοιχεία επικοινωνίας:\n\nΦόρμα επικοινωνίας: www.tcl.eu/en/contact-us\n\nΟ αντιπρόσωπός μας στην Ευρωπαϊκή Ένωση είναι: η TCL Europe που διαθέτει γραφεία στη διεύθυνση 9-15 rue Rouget de L'Isle- 92130 Issy- Les-Moulineaux, Γαλλία. Μπορείτε να επικοινωνήσετε με την TCL Europe μέσω της φόρμας επικοινωνίας που αναφέρεται παραπάνω.\n\nΕκδοχή: 2.0\n\nΠαράρτημα Τα Δικαιώματά σας\n\nα.	Δικαίωμα πρόσβασης: Μπορείτε να έχετε το δικαίωμα απόκτησης επιβεβαίωσης από εμάς σχετικά με το εάν ή όχι λαμβάνουν επεξεργασία προσωπικά δεδομένα σχετικά με εσάς, και, όπου αυτό ισχύει, μπορείτε να ζητήσετε να αποκτήσετε πρόσβαση στα προσωπικά δεδομένα. Οι πληροφορίες πρόσβασης περιλαμβάνουν – μεταξύ άλλων – τους σκοπούς της επεξεργασίας, τις σχετικές κατηγορίες των προσωπικών δεδομένων, και τους αποδέκτες ή τις κατηγορίες αποδεκτών στους οποίους τα προσωπικά δεδομένα έχουν κοινοποιηθεί ή πρόκειται να κοινοποιηθούν. Εντούτοις, αυτό δεν είναι ένα απόλυτο δικαίωμα και τα συμφέροντα άλλων προσώπων ενδέχεται να περιορίσουν το δικαίωμά σας στην πρόσβαση.\n\nΜπορείτε να έχετε το δικαίωμα απόκτησης ενός αντιγράφου των προσωπικών δεδομένων που τελούν υπό επεξεργασία. Σε περίπτωση που ζητήσετε περισσότερα αντίγραφα, μπορούμε να χρεώσουμε ένα εύλογο ποσό που βασίζεται σε διοικητικά έξοδα. \n\nβ.	Δικαίωμα διόρθωσης: Μπορείτε να έχετε το δικαίωμα να εξασφαλίσετε από εμάς τη διόρθωση ανακριβών προσωπικών δεδομένων που σας αφορούν. Σύμφωνα με τους σκοπούς της επεξεργασίας, μπορείτε να έχετε το δικαίωμα να συμπληρώσετε ελλιπή προσωπικά δεδομένα, μεταξύ άλλων μέσω της παροχής συμπληρωματικής δήλωσης.\n\nγ.	Δικαίωμα διαγραφής (\"δικαίωμα στη λήθη\"): Σε ορισμένες περιπτώσεις, μπορείτε να έχετε το δικαίωμα να εξασφαλίσετε από εμάς τη διαγραφή των προσωπικών δεδομένων σχετικά με εσάς και ενδέχεται να είμαστε υποχρεωμένοι να διαγράψουμε τέτοια προσωπικά δεδομένα. \n\nδ.	Δικαίωμα περιορισμού της επεξεργασίας: Σε ορισμένες περιπτώσεις, μπορείτε να έχετε το δικαίωμα να απαιτήσετε τον περιορισμό της επεξεργασίας προσωπικών δεδομένων που σας αφορούν. Σε αυτήν την περίπτωση, τα σχετικά δικαιώματα θα σημειωθούν και θα μπορούν να λάβουν επεξεργασία από εμάς μόνο για ορισμένους σκοπούς.\n\nε.	Δικαίωμα στη φορητότητα των δεδομένων: Σε ορισμένες περιπτώσεις, μπορείτε να έχετε το δικαίωμα να λάβετε τα προσωπικά δεδομένα που σας αφορούν, τα οποία έχετε παράσχει σε εμάς, σε δομημένο, κοινώς χρησιμοποιούμενο και αναγνώσιμο από μηχάνημα τύπο και μπορείτε να έχετε το δικαίωμα διαβίβασης αυτών των δεδομένων σε άλλο νομικό πρόσωπο χωρίς εμπόδιο από εμάς.\n\nστ.	Δικαίωμα εναντίωσης:\n\nΣε ορισμένες περιπτώσεις, μπορείτε να έχετε το δικαίωμα εναντίωσης, για λόγους σχετικούς με την ιδιαίτερη κατάστασή σας, ή όπου τα προσωπικά δεδομένα λαμβάνουν επεξεργασία για άμεσους σκοπούς εμπορικής προώθησης ανά πάσα στιγμή στην επεξεργασία των προσωπικών σας δεδομένων σας από εμάς και μπορείτε να απαιτήσετε να μην επεξεργαστούμε περαιτέρω τα προσωπικά σας δεδομένα.\n\nΕπιπρόσθετα, εάν τα προσωπικά σας δεδομένα λαμβάνουν επεξεργασία για άμεσους σκοπούς εμπορικής προώθησης έχετε το δικαίωμα να εναντιωθείτε ανά πάσα στιγμή στην επεξεργασία των προσωπικών δεδομένων που σας αφορούν για την εν λόγω εμπορική προώθηση, η οποία περιλαμβάνει κατάρτιση προφίλ, στο βαθμό που σχετίζεται με αυτήν την άμεση εμπορική προώθηση. Σε αυτή την περίπτωση τα προσωπικά σας δεδομένα δεν θα λάβουν περαιτέρω επεξεργασία για τέτοιους σκοπούς από εμάς."];
var cookieNotice = ["\n\nΣεβόμαστε το απόρρητό σας κατά τη χρήση των Smart TV που κατασκευάζονται και τις Υπηρεσίες που παρέχονται από εμάς. Τα Cookies χρησιμοποιούνται από αρκετές ιστοσελίδες και άλλες διαδικτυακές υπηρεσίες και η Smart TV σας θα αποδέχεται, θα αποθηκεύει και θα διαβιβάζει cookies για να διασφαλίσει ότι αυτές οι ιστοσελίδες και οι υπηρεσίες λειτουργούν σωστά. \n\nΔεν χρησιμοποιούμε cookies κατά την παροχή των Υπηρεσιών σε εσάς. Εντούτοις, τρίτοι (π.χ. τρίτοι πάροχοι εφαρμογών) ενδέχεται να χρησιμοποιούν cookies όταν χρησιμοποιείτε την Smart TV για την πρόσβαση στις υπηρεσίες τους. Η εν λόγω Ενημέρωση για τα Cookie μπορεί μόνο να παρέχει περιορισμένες πληροφορίες σχετικά με τα cookies τα οποία μπορεί να τοποθετηθούν από τρίτους. Για πληροφορίες σχετικά με τα πραγματικά cookies που χρησιμοποιούνται από τρίτους και τη λειτουργικότητά τους σας παραπέμπουμε στις αντίστοιχες ενημερώσεις για τα cookie τέτοιων τρίτων μερών. Εντούτοις, στην εν λόγω Ενημέρωση για τα Cookie παρέχουμε μια γενική περιγραφή σχετικά με το ποια cookies μπορούν να τοποθετηθούν στην Smart TV σας και πως μπορείτε να τα διαχειριστείτε.\n\n1.	Τι είναι ένα cookie?\n\nΤα Cookies είναι μικρά αρχεία κειμένου που μπορούν να τοποθετηθούν στην Smart TV σας. Όταν αποκτάται πρόσβαση σε μια ιστοσελίδα ή συνδρομή σε ένα τηλεοπτικό σταθμό, η ιστοσελίδα ή η υπηρεσία ενδέχεται να αποθηκεύσουν ένα cookie στην Smart TV. Κατά τη διάρκεια επόμενων εισόδων, ένα cookie που τοποθετείται στην Smart TV σας θα αποστείλει πληροφορίες στο μέρος που έχει τοποθετήσει το cookie. Τα Cookies είναι πολύ συνηθισμένα και χρησιμοποιούνται σε αρκετές ιστοσελίδες και υπηρεσίες. Κάθε cookie θα περιλαμβάνει τυπικά το όνομα της τοποθεσίας από την προήλθε το cookie, την \"διάρκεια ζωής\" του cookie, και την αξία (συνήθως ένας ξεχωριστός αριθμός). Για μια πιο ενδελεχή εξήγηση του τι είναι τα cookies και πως λειτουργούν, παρακαλούμε να επισκεφτείτε τη διεύθυνσηwww.allaboutcookies.org.\n\nΤα Cookies μπορούν να κατηγοριοποιηθούν σε λειτουργικά cookies και μη λειτουργικά cookies. Τα λειτουργικά cookies είναι τα cookies που απαιτούνται αυστηρά για τον σκοπό της παροχής υπηρεσιών σε εσάς. Τα μη λειτουργικά cookies είναι όλα τα άλλα cookies.\n\n2.	Ιστοσελίδες τρίτων\n\nΌταν επισκέπτεστε ιστοσελίδες ή υπηρεσίες τρίτων μέσω των Υπηρεσιών της Smart TV σας, είναι πιθανό ότι αυτές οι ιστοσελίδες ή υπηρεσίες τοποθετούν cookies στην Smart TV σας, και να καταγράφουν και αποθηκεύουν τις αλληλεπιδράσεις σας σε αυτές τις ιστοσελίδες. Δεν ζητάμε ούτε ενθαρρύνουμε τέτοιες δραστηριότητες και δεν θα χρησιμοποιήσουμε τέτοιες πληροφορίες. Παρακαλούμε ανατρέξτε στις αντίστοιχες ενημερώσεις για τα cookie και για το απόρρητο αυτών των ιστοσελίδων και υπηρεσιών για περισσότερες πληροφορίες σχετικά με την χρήση τέτοιων cookies από τα μέρη.\n\n3.	Διαγραφή των Cookie \n\nΗ δική σας διεπαφή χρήστη της Smart TV σας, σας επιτρέπει να διαγράψετε όλα τα cookies και άλλους τοπικούς χώρους αποθήκευσης του προγράμματος περιήγησης από την Smart TV. Συνιστάται ιδιαίτερα η αφαίρεση όλων των cookies και των τοπικά αποθηκευμένων ρυθμίσεων πριν από την πώληση ή την δωρεά της Smart TV σας.\n\nΈκδοση: 2.0"];
var privacyPolicy = ["Επιλέξτε τα παρακάτω πλαίσια εάν θέλετε να χρησιμοποιήσετε τις υπηρεσίες Smart TV και τις συναφείς υπηρεσίες μας. Η χρήση αυτών των υπηρεσιών απαιτεί την επεξεργασία των προσωπικών σας δεδομένων, όπως περιγράφεται στην Πολιτική απορρήτου: http://www.tcl.eu/en/","Ενεργοποίηση υπηρεσίας Smart TV, αποθήκευση των ρυθμίσεων της υπηρεσίας και αυτόματος έλεγχος ταυτότητας της Smart TV. Εάν καταργήσετε αυτή την επιλογή θα έχετε μόνο τυπική τηλεόραση και HDMI.","Ενεργοποίηση αυτόματων ενημερώσεων λογισμικού. Επιλέξτε αυτό το πλαίσιο για να ενημερώνετε το προϊόν σας με τις τελευταίες ενημερώσεις λογισμικού και τις καλύτερες επιδόσεις. ","(Οι ενημερώσεις λογισμικού είναι σημαντικές για την σωστή λειτουργία της τηλεόρασής σας, καθώς παρέχουν νέα χαρακτηριστικά, σταθερότητα και ασφάλεια. Ως εκ τούτου, συνιστούμε να επιλέξετε το πλαίσιο.)","Επιλέξτε το παρακάτω πλαίσιο εάν συναινείτε στην επεξεργασία των προσωπικών σας δεδομένων και για τον παρακάτω αναφερόμενο σκοπό. Για περισσότερες πληροφορίες σχετικά με τον τρόπο επεξεργασίας των προσωπικών σας δεδομένων, ανατρέξτε στην Πολιτική απορρήτου: http://www.tcl.eu/en/","Συμφωνώ με την επεξεργασία των προσωπικών μου δεδομένων (π.χ. ώρα εισόδου και εξόδου από το T-Launcher) με σκοπό τη βελτίωση των προϊόντων της TCL και την παροχή καλύτερων υπηρεσιών περιεχομένου σε Smart TV."];
var termsFirTitle = ["Όροι και Προϋποθέσεις","Δήλωση απορρήτου","Δήλωση Cookies"];
var termsSecTitle = ["Διαβάστε τους όρους και τις προϋποθέσεις και αποδεχθείτε τα.","Διαβάστε και αποδεχτείτε τη δήλωση απορρήτου.","Διαβάστε και αποδεχτείτε τη δήλωση cookie."];
var tickall = "Επιλογή όλων";
var tickremindWords = "Επιλέξτε τα πλαίσια ελέγχου, διαφορετικά δεν θα παρέχονται υπηρεσίες Smart TV.";