var  all_country  = ["استرالیا","اتریش","بلژیک","بلغارستان","کرواسی","جمهوری چک","دانمارک","فنلاند","فرانسه","آلمان","یونان","مجارستان","ایتالیا","لوکزامبورگ","هلند","نروژ","لهستان","پرتغال","رومانی","روسی","صربستان","اسلوونی","اسپانیا","سوئد","سوئیس","انگلستان","نیوزیلند"," "/*Arab*/,"استونی"," "/*Hebrew*/,"لتونی","اسلواکی","ترکیه","ایرلند","ژاپن","فیلیپین","تایلند","مالدیو","اروگوئه","پرو","آرژانتین","شیلی","ونزوئلا","اکوادور","کاستاریکا","پاراگوئه","بولیوی","بلیز","نیکاراگوئه","گواتمالا",  /*5*/ "چین","تایوان","برزیل","کانادا","مکزیک","ایالات متحده آمریکا","کره جنوبی","سایر اطلاعات","ویتنام"/*新添加的，底层结构体中没有*/,"اکراین"/*新添加的，底层结构体中没有*/,"ایران","عراق"," ","قزاقستان","ازبکستانی"," ","قرقیزستان","الجزایر","مصر","تونس","تانزانیا","کنیا","پاکستان","اندونزی","کویت","عربستان سعودی","قطر","فلسطین","لبنان","بحرین","آنگولا","کنگو","هند","ترکمنستان","کلمبیا","مغولستان","بنگلادش","نپال","سری لانکا","کره شمالی","مولدوی","پلینزی","السالوادور"," ","فیجی","لیربیا","اردن","ماینمار","غنا","گرجستان", /*10*/ "ارمنستان","عمان","یمن","سوریه","فلسطین","افغانستان","مراکش","بنین","ساحل عاج","نیجریه","سودان","اتیوپی","زامبیا"," ","آفریقای جنوبی","موزامبیک","لیبی","آلبانی","بلاروس","ایسلند","لیتوانی","ماریتیوس","دبی","امارات متحده عربی","تاجیکستان","بنگال","بسنی هرزگوین","قبرس","کوزو","مقدونیه","مالت","مونته نگرو","کامرون","سنگاپور","مالزی","کالدونیای جدید","Suriname","Jamaica","Curacao","Aruba","Antigua & Barbuda","St Lucia","Barbados","St Vincent","St Kitts & Nevis","Grenada","Trinidad & Tobago","Guyana","Puerto Rico","پاناما", /*15*/ "Dominica","Cuba","Honduras","Haiti","کامبوج","زیمبابوه","Dominican Republic","Bonaire","سومالی","آذربایجان",
    "Uganda","Rwanda","گینه","Burundi","جمهوری آبخازیا","Andorra","Anguilla","Antarctica","American Samoa","Aland Island",
    "بورکینافاسو","Bermuda","Brunei","Caribbean Netherlands","Saint Barthélemy","Bahamas","Bhutan","Bouvet Island","Botswana","Cocos (Keeling) Islands",
    "Central African Republic","Cape Verde","Djibouti","Eritrea","Western Sahara","Falkland Islands","Federated States of Micronesia","Faroe Islands","گابن","Cook Islands",
    "Gibraltar","Greenland","French Guiana","Guadeloupe","Equatorial Guinea","Guam","Guinea-Bissau","Heard Island and McDonald Islands","Isle of Man","British Indian Ocean Territory",
    /*20*/"Jersey","Kiribati","Comoros","Cayman Islands","Liechtenstein","Lesotho","Monaco","Saint Barthélemy","Madagascar","مالی",
    "Macao","Martinique","Mauritania","Montserrat","Malawi","Namibia","نیجر","Norfolk Island","Nauru","Papua New Guinea",
    "Pitcairn Islands","Palau","Reunion Island","Solomon Islands","Seychelles","The Svalbard archipelago","Sierra Leone","San Marino","سنگال","South Sudan",
    "Sao Tome & Principe","Swaziland","Turks & Caicos Islands","Togo","Chad","Tokelau","Timor-Leste (East Timor)","Tonga","Tuvalu","Vatican City State",
    "British Virgin Islands","United States Virgin Islands","Wallis and Futuna","Samoa","Mayotte","Democratic Republic of the Congo","Guernsey","Gambia","Northern Mariana Islands","French Southern Territories",
    /*25*/"Niue","United States Minor Outlying Islands","Others"];
var all_language = ["چکوسلواکی","چامیک","دانمارکی","دراگوا","لندیاک","آلمانی","انگلیسی","اسپانیایی","یونانی","فرانسوی","کرواتی","سربانوپر","ایتالیایی","مجارستانی","آلمانی","نروژی","لهستانی","پرتغالی","روسی","رومانیایی","اسلونی","صریستانی","فنلاندی","سوئدی","بلغاری","چکوسلواکی","چینی","Chuukese","ایرلندی","Gbaya","ولزی","عربی","ایرلندی","لاتویا","Hebrew","ترکی","استونیایی","آلمانی"/*Netherlands*/,"کره ای","Kosraean","هندی","Hittite","Hmong","ماندارین","گويش‌ كانتون","مائوری","صدای اصلی"/*Qaa*/,"تعریف نشده"/*Undetermined*/,"Ad","ناشناخته","تعریف نشده","Abkhazian","Achinese","Acoli","Adangme","Adyghe","Afar","Afrihili","Afrikaans","Afro","Ainu","Akan","Akkadian","آلبانی","Aleut","Algonquian","Altaisouthern","Altaic","Amharic","Apache","Aramaic","Aragonese","Arapaho","Araucanian","Arawak","آمریکایی","Artificial","Assamese","Asturian","Athapascan","Austronesian","Australian","Avaric","Avestan","Awadhi","Aymara","آذربایجان","Aztec","Balinese","Baltic","Baluchi","Bambara","Bamileke","Banda","Bantu","Basa","Bashkir","باسک","Beja","Bemba",/*10*/"Bengali","Berber","Bhojpuri","Bihari","Bikol","Bini","Bislama","بوسنیایی","Braj","Breton","Buginese","Buriat","برمه‏ای","Blin","بلاروسی","Caddo","Carib","کاتالان","Caucasian","Cebuano","Celtic","Centralamericanindian","Chagatai","Chamorro","Chechen","Cherokee","Cheyenne","Chibcha","Chinookjargon","Choctaw","Chipewyan","Churchslavic","Chuvash","Coptic","Cornish","Corsican","Cree","Creek","Creolesandpidgins","Crimeantatar","Creolesandpidginsenglish","Creolesandpidginsfrench","Creolesandpidginsportuguese","Kashubian","Cushitic","Dakota","Delaware","Slavey","Dogrib","Dhivehi","Dinka","Divehi","Dogri","Dravidian","Sorbianlower","Duala","Dutchmiddle","Dyula","Dzongkha","Efik","Egyptian","Ekajuk","Elamite","Englishmiddle","Englishold","Angika","Eskimo","Esperanto","Ewe","Ewondo","Fang","Fanti","فاروس","Fijian","Filipino","Finnougrian","Fon","Frenchmiddle","Frenchold","Frisiannorthern","Frisianeastern","فریسی","Fulah","Friulian","Ga","گالیکی","Ganda","Gayo","Geez","Georgian","Germanmiddlehigh","Germanoldhigh","Gorontalo","Germanic","Gilbertese","Gondi","Gothic","Grebo","Greekancient","Greenlandic",/*20*/"Guarani","Swissgerman","Gujarati","Gwichin","Haida","Haitiancreole","Hausa","Hawaiian","Herero","Hiligaynon","Himachali","Hirimotu","Hupa","Iban","ایسلندی","Ido","Nuosu","Igbo","Ijo","Iloko","Indic","Indoeuropean","Ingush","اندونزیای","Interlingua","Interlingue","Inuktitut","Inupiak","Iranian","Irishold","Irishmiddle","Iroquoian","ژاپنی","Javanese","Lojban","Judeoarabic","Judeopersian","Kabyle","Kachin","Kamba","Kannada","Kanuri","Karakalpak","Karen","Kashmiri","Kawi","Kazakh","Circassian","Khasi","Khmer","Khoisan","Khotanese","Kikuyu","Kinyarwanda","Kirghiz","Kimbundu","Komi","Kongo","Konkani","Kpelle","Karachaybalkar","Karelian","Kru","Kuanyama","Kumyk","Kurdish","Kurukh","Kusaie","Kutenai","Ladino","Lahnda","Lamba","Langue","Lao","لاتین","Luxembourgish","Lezghian","Limburgish","Lingala","لیتوانیایی","Lozi","Lubalulua","Lubakatanga","Luiseno","Lunda","Luo","Lushai","مقدونی","Madurese","Magahi","Maithili","Makasar","Malagasy","مالزیایی","Moksha","Mandar","Malayalam","Maltese","Manchu","Mandingo",/*30*/"Manipuri","Manobo","Manx","Marathi","Mari","Marshall","Mirandese","Marwari","Masai","Mayan","Erzya","Mende","Micmac","Minangkabau","Miscellaneous","Mohawk","Moldavian","Monkmer","Mongo","مغولی","Mossi","Multiple","Munda","Neapolitan","Nauru","Navajo","Ndebelenorth","Ndebelesouth","Ndongo","Germanlow","نپالی","Newari","Nias","Nigerkordofanian","Nilosaharan","Niuean","Norwegianbokmal","Nogai","Norseold","Northamericanindian","Norwegiannynorsk","Nubian","Nyamwezi","Newariclassical","Nyanja","Nyankole","Nyoro","Nzema","Ojibwa","Oriya","Oromo","Osage","Ossetic","Otomian","Pahlavi","Palauan","Pali","Pampanga","Pangasinan","Panjabi","Papiamento","Papuanaustralian","فارسی","Persianold","Phoenician","Philippine","Ponape","Prakrit","Provencalold","Pushto","Quechua","Rhaetoromance","Rajasthani","Rapanui","Rarotongan","عاشقانه","Romany","Rundi","Aromanian","Salishan","Samaritanaramaic","Samisouthern","Saminorthern","سامی","Lulesami","Inarisami","Samoan","Skoltsami","Sandawe","Sango","Sanskrit","Sardinian","Sasak","Santali","Sicilian","Scots","Selkup","Semitic","Sranantongo","Serbocroatian",/*40*/"Serer","Sign","Shan","Shona","Sidamo","Siksika","Sindhi","Soninke","Singhalese","Sinotibetan","Siouan","Slavic","Siswant","Sogdian","Somali","Songhai","Sorbian","Walloon","Nko","Sothonorthern","Sothosouthern","Southamericanindian","Sukuma","Sumerian","Sudanese","Susu","Swahili","Swazi","Swize","Syriacclassical","Syriac","Tagalog","Tahitian","Tetum","Tajik","Tamashek","Tai","تامیل","Tatar","تلتکست","Telugu","Tereno","تایلندی","Tibetan","Tigre","Tigrinya","Timne","Tivi","Klingon","Tokelau","Tlingit","Tonganyasa","Tongaislands","Truk","Tokpisin","Tsimshian","Tsonga","Tswana","Tumbuka","Tupian","Turkishottoman","Turkmen","Tuvinian","Tuvalu","Twi","Udmurt","Ugaritic","Uighur","اوکراینی","Umbundu","Urdu","ازبکی","Vai","Venda","ویتنامی","Volapuk","Votic","Wakashan","Walamo","Waray","Washo","Wolof","Kalmyk","Xhosa","Yakut","Yao","Yap","Yiddish","Yoruba","Yupik","Zapotec","Blissymbolics","Zenaga","Zhuang","Zande","Zulu","Zuni","Zazaki","Valencian","چینی سنتی",/*50*/"ChineseS","QAB","QAC","عربی(مصر)","*","*","Dagbani","Kasem","*"];
var offOn = ["خاموش","روشن"];	
var okCancel = ["تایید","لغو"];	
var yesNo = ["بله","خير"];	
var level = ["خاموش","کم","زیاد","میانه"];	
var manualAuto = ["دستی","خودكار"];	
var homeShop = ["خانگی","فروشگاهی"];	
var picPreset = ["استاندارد","پویا","طبیعی","فیلم","شخصی"];
var picColorTemp = ["سرد","معمولی","گرم","دلخواه"];
var pic3dNavig = ["دستی","خودكار","نیمه-خودکار"];	
var _3dOptions = ["حالت سه‏بعدی","‏3 بعدی - به - 2 بعدی","تغییر حالت چپ به راست","عمق میدان"];	
var pic3DMode = ["خاموش","دو بعدي به سه بعدي","پهلو به پهلو","بالا-و-پایین","فاصله بین خطوط"];	
var picEcoOptions = ["صرفه جویی انرژی","حسگر نور","کم نور کردن  ","تنظیم نور مخلوط"];
var picGeoOptions = ["هندسی","موقعیت افقی","موقعیت عمودی","ساعت","فاز"];	
var picAdWhiteBal = ["افزایش R","افزایش G","افزایش B","آفست R","آفست G","آفست B"];	
var souOptions = ["حالت صدا","توازن","تاخیر صدا","SRS TSHD","کنترل خودکار حجم صدا","نوع SPDIF","تاخیر SPDIF","محل قرار گیری تلویزیون","زبان شنیداری","نوع صدا","توضیحات صوتی","تقویت بم","Dolby Digital Plus","صدای فراگیر"];
var souSpdifType = ["خودكار"/*Dolby*/,"PCM","خاموش"];	
var colorSpace = ["خودكار","اصلی","دلخواه"];	
var souPresetPara = ["100Hz","500Hz","1.5KHz","5KHz","10KHz"];	
var chOptions = ["جستجوی کانال","فهرست کانال","راهنمای پخش برنامه","مرتب کننده کانال ها","اطلاعات کانال","ماشین زمان","زیرنویس","تلتکست","نوع فهرست کانال","خدمات داده","PVR"];
var chDiagOptions = ["قدرت سیگنال","کیفیت سیگنال","فرکانس (کیلوهرتز)","شناسه خدمات","شناسه شبکه","نام شبکه"];	
var chScanOptions = ["کشور / منطقه","انتخاب نوع آنتن","جستجوی خودکار","بروز رسانی خودکار","جستجوی دستی آنالوگ",["نصب غیرخودکار کابل","جستجوی دستی دیجیتال","تنظیم غیرخودکار ماهواره"],"تنظیم آنتن ماهواره","انتخاب شبکه مورد علاقه","پاک کردن لیست کانال ها","LCN"];
var favNetDes = "لطفاً شبکه دلخواه خود را انتخاب کنید";	
var tuner = ["کابلی","هوايی","ماهواره"];
var passError = "رمز عبور نادرست است.\nلطفاً دوباره وارد کنید!";	
var chType = ["کانال های آنالوگ: ","کانال های دیجیتال: "];
var chScanStatus = ["وضعیت: در حال جستجو","وضعیت: جستجو کامل شد","وضعیت: جستجو لغو شد","وضعیت: خطای جستجو"];
var chScanPara = ["فرکانس (کیلوهرتز)","مدولاسیون","سیمبل ریت (Ksym/s)","شناسه شبکه","سیستم","تنظیم دقیق","قدرت سیگنال","کیفیت سیگنال","حالت جستجو","شناسه کانال"];	
var chScanParaMHZ = ["فرکانس (MHz)"];	
var chAtvManSys = ["اروپای غربی","اروپای شرقی","بریتانیا","فرانسه"];	
var modulation = ["16QAM","32QAM","64QAM","128QAM","256QAM","خودكار"];	
var chCleanDes = "آیا می خواهید لیست کانال را پاک کنید؟";	
var chDeletDes = "آیا می خواهید کانال را حذف کنید؟";	
var chOperator = ["Ziggo","UPC","سایر اطلاعات"];	
var chScanType = ["آنالوگ و دیجیتال","دیجیتال","آنالوگ"];	
var chScanMode = ["كامل","پیشرفته","سریع"];	
var bookingModes = ["ضبط","یادآوری"];	
var dayName = ["یک‏ شنبه","دوشنبه","سه‏ شنبه","چهارشنبه","پنج‏ شنبه","جمعه","شنبه"];	
var monthName = ["ژانویه", "فوریه","مارس","آوریل","می","ژوئن","جولای","آگوست","سپتامبر","اکتبر","نوامبر","دسامبر"];	
var filter = ["فیلتر","نوع:","نوع فرعی"];	
var chEpgFirstGenre = ["فیلم","اخبار","نمایشی","ورزشی","کودکان","موزیک","هنری","اجتماعی","آموزشی","اوقات فراغت","ویژه"];
var chEpgSecondGenre = [["تأتر","کارآگاهی","ماجراجویی","علمی تخیلی","کمدی","سریال عامه‏ پسند","عاشقانه","جدی","فیلم مخصوص بزرگسالان"," "," "," "],["مجله خبری","گزارش هواشناسی","مجله خبری","مستند","گفتمان"," "," "," "," "," "," "," "],["نمایشی","برنامه مسابقه","جُنگ متنوع","برنامه گپ و گفتگو"," "," "," "," "," "," "," "," "],["ورزشی","رویدادهای ویژه","مجله ورزشی","فوتبال","تنیس","ورزش‏های گروهی","دو و میدانی","ورزش‏های موتوری","ورزش‏های آبی","ورزش های زمستانی","اسب سواری","هنرهای رزمی"],["کودکان","کودکان پیش دبستانی","سرگرمی برای 6 تا 14","سرگرمی برای 10 تا 16","آگهی","پویا نمایی"," "," "," "," "," "," "," "],["موزیک","راک","جدی","فولکلوریک","جاز","موسیقیایی","بالت"," "," "," "," "," "],["هنری","هنرهای نمایشی","هنرهای زیبا","مذهبی","فرهنگ پرطرفدار","ادب و هنر","فیلم","تجربی","پخش","رسانه‏ ها‏ی جدید","مجلات هنری","مد"],["اجتماعی","مجلات","اقتصاد","انسان های درخشان"," "," "," "," "," "," "," "," "],["آموزشی","طبیعت","فن آوری","پزشکی","کشورهای خارجی","علوم اجتماعی","آموزش و پرورش","زبان ها "," "," "," "," "],["فراغت و سرگمی","جهان ‏گردی","هنرهای دستی","اتومبیل رانی","سلامتی و تندرستی","آشپزی","آگهی","باغبانی"," "," "," "," "],["زبان اصلی","سیاه و سفید","منتشر نشده","پخش زنده"," "," "," "," "," "," "," "," "]];
var chEpgFirstGenreLA = ["اخبار","ورزشی","آموزشی","سریال های روزانه","مینی سریال","سریال","جُنگ متنوع","سریال واقع-نما","اطلاعات","کمیک","کودکان","اروتیک","فیلم","قرعه کشی، فروش تلویزیونی، اعطای جایزه","مباحثه/مصاحبه","سایر"];
var chEpgSecondGenreLA = [["اخبار","گزارش","مستند","بیوگرافی","سایر","",""],    ["ورزشی","سایر","","","","",""],["آموزشی","سایر","","","","",""],["سریال های روزانه","سایر","","","","",""],["مینی سریال","سایر","","","","",""],["سریال","سایر","","","","",""],["سالن کنفرانس","نمایشی","موسیقیایی","ساخت","Feminine","مسابقه گروهی","سایر"],["سریال واقع-نما","سایر","","","","",""],["آشپزی","مد","کشور","سلامت","سفر","سایر",""],["کمیک","سایر","","","","",""],["کودکان","سایر","","","","",""],["اروتیک","سایر","","","","",""],["فیلم","سایر","","","","",""],["قرعه کشی","فروش تلویزیونی","اعطای جایزه","سایر","","",""],["گفتمان","مصاحبه","سایر","","","",""],["کارتون مخصوص بزرگسالان","تعاملی","سیاست","مذهبی","خدمات مهندسی","سایر",""]];
var chOrganizer = ["پرش از کانال","مرتب سازی کانال","ویرایش کانال","حذف کردن کانال","تبادل کانال","جایگذاری کانال"];	
var chEditPara = ["نام شبکه","شماره کانال","نام کانال","فركانس","سیستم رنگ","سیستم صدا"];	
var chSatTitles = ["نوع ماهواره","تنظیم آنتن ماهواره","انتخاب ماهواره"];	
var chSatEidtOptions = ["نام ماهواره","موقعیت","توان LNB","فرکانس LNB (مگاهرتز)","‏DiSEqC ورودی","تن 22 کیلوهرتز","پخش تن","فرکانس (کیلوهرتز)","سیمبل ریت (Ksym/s)","قطبیت","قدرت سیگنال","کیفیت سیگنال","وضعیت ماهواره"];	
var chSatAutoPromt = [["همه","شبکه"],["همه","مجانی"]];	
var chSatAutoScanOptions = ["انتخاب ماهواره","حالت جستجو","کانال‏ها"];	
var chSatPosition = ["A","B"];	
var chSatLNBFreq = ["یونیورسال",];	
var chSatDiSEqCInput = ["غیرفعال","A","B","C","D"];	
var chSatTone22KHz = ["خودكار","روشن","خاموش"];	
var chSatToneBurst = ["غیرفعال","پخش تن A","پخش تن B"];	
var chSatPolarization = ["افقی","عمودی"];	
var chSatSetupOptions = ["نوع آنتن","تیونر","باند فرکانسی"];	
var chSatAntennaType = ["تک کابل","یونیورسال"];	
var chSatUserBands = ["باند کاربر 1","باند کاربر 2","باند کاربر 3","باند کاربر 4","باند کاربر 5","باند کاربر 6","باند کاربر 7","باند کاربر 8"];	
var chSatOthers = ["ترنسپاندر"];	
var chSatSetupOthers = ["تعریف شده کاربر"];	
var pleaseSelectSat = "لطفاً ابتدا ماهواره را انتخاب کنید!";	
var subOptions = ["زیرنویس","زبان زیرنویس دیجیتال","زبان دوم زیرنویس دیجیتال","نوع زیرنویس"];	
var gingaOptions = ["خدمات خودکار داده","فهرست خدمات داده"];	
var ttxOptionsCon = ["رمزگشایی زبان صفحه","زبان تلتکست دیجیتال"];	
var subType = ["معمولي","ناتوانی شنوایی"];	
var netIntf = ["اترنت","بی‏سیم"];	
var netConnDes = ["تلویزیون در حال آزمایش اتصال شبکه است.\nلطفاً صبر کنید","آزمایش اتصال شبکه موفقیت آمیز بود!","آزمایش اتصال شبکه انجام نشد."];	
var netSsidError = "طول مجاز SSID بین 1 تا 32 کاراکتر است. لطفاً SSID را بررسی کنید.";	
var netOthers = ["‏PIN کد"];	
var netWlessAutoDes = ["قبل از انتخاب تایید از نصب شدن پین کد زیر در مودم اطمینان حاصل کنید.","قبل از کلیک کردن روی تایید ظرف 120 ثانیه دکمه روی اکسس پوینت را فشار دهید."];
var netConnRemind = ["رمز عبور اشتباه است!","برقراری ارتباط. لطفاً صبر کنید!","اتصال انجام و آدرس IP دریافت شد!","اتصال انجام نشد، لطفاً شبکه را بررسی کرده و دوباره سعی کنید!","تلویزیون در حال بررسی اکسس پوینت ها می باشد. \nلطفاً صبر کنید","هیچ آداپتور بیسیمی به تلویزیون وصل نیست!"];	
var netWireIpOptions = ["تنظیمات IP","نوع آدرس","آدرس IP","ساب نت ماسک","گیت وی پیش فرض","DNS اولیه","DNS ثانویه"];	
var netWireConnRemind = ["لطفاً مقداری بین 0 و 255 وارد کنید.","اتصال انجام شد!","لطفاً یک آدرس صحیح وارد کنید","اتصال انجام شد!","اتصال برقرار نشد!","برقراری ارتباط. لطفاً صبر کنید!","لطفاً مقداری بین 1 و 223 وارد کنید."];	
var netFlixOptions = ["غیرفعال سازی","ESN","Netflix Version"];	
var netFlixDes = ["آیا مطمئنید که می خواهید غیرفعال کنید؟"," "/*Are you sure that you want to ESN?*/];	
var netUpdateTitle = "بروز رسانی نرم‏ افزار";
var netUpdateDialogTitle = "بروز رسانی نرم‏ افزار";
var netBGDownloadTitle = "در حال دانلود";	
var netUpdateLoadingPrompt = ["در حال جستجو جهت بروزرسانی نرم افزار، لطفاً صبر کنید!","نرم افزار در حال دریافت است... لطفاً صبر کنید!","لطفاً در طول بروزرسانی نرم افزار، تلویزیون را خاموش نکنید!",                            "بروزرسانی لازم نرم افزار بطور خودکار در پس زمینه دریافت می شود!"];
var netUpdatePrompt = ["نسخه نرم افزار، آخرین نسخه می باشد. ","نسخه جدید XXXX نرم افزار یافت شد. آیا هم اکنون می خواهید دانلود کنید؟ بسته به وضعیت شبکه شما شاید مدتی طول بکشد.","ورود انجام نشد، کنترل کرده و دوباره وصل شوید!","داده ها دریافت نشد، لطفاً بعداً امتحان کنید!","تحلیل اطلاعات ارتقا انجام نشد، با کنترل از راه دور خاموش/روشن کنید!","اتصال انجام نشد، لطفاً شبکه را بررسی کرده و دوباره سعی کنید!","دریافت نرم افزار انجام شد. آیا می خواهید بروزرسانی تلویزیون را شروع کنید؟","داده ها از بین رفت! دانلود نشد!","بررسی نرم افزار انجام نشد، لطفاً دوباره امتحان کنید!","مشکلات اتصال. لطفاً کنترل کرده و دوباره متصل شوید!","بروزرسانی انجام نشد. لطفاً با کنترل از راه دور خاموش/روشن کنید!","فایل ارتقا بطور ناخواسته پاک شد. لطفاً دوباره از طریق شبکه ارتقا دهید.","نرم افزار در پس زمینه دانلود شده است. آیا می خواهید ارتقا دهید؟"];
var netUpdateButtonText = ["دریافت", "بروز رسانی", "بعداً", "هرگز", "تایید","ادامه"];	
var autoDetectPrompt = ["نسخه جدید XXXX نرم افزار یافت شد. آیا هم اکنون می خواهید دانلود کنید؟ بسته به وضعیت شبکه شما شاید مدتی طول بکشد.","نسخه جدید XXXX نرم افزار یافت شد. آیا هم اکنون مایل به بروزرسانی هستید؟","دفعه قبل فرایند ارتقا با شبکه لغو شده بود. باید دوباره ارتقا دهید.",                        "دانلود نسخه جدید XXXX نرم افزار تمام نشده است. آیا می خواهید الان ادامه دهید؟",                        "نرم افزار دانلود شده است، الان ارتقا می دهید؟","Software downloaded, do you want to update now? TV will update automatically next time if you skip now."];	
var sysOptions = ["راهنمای الکترونیکی","زبان منو","تنظیمات زمان  ","قفل","تنظیمات ورودی","بروزرسانی نرم‏ افزار","محل استفاده","حالت HbbTV","کوکی‏ها","رابط عمومی","تنظیمات پیشرفته","تنظیمات کارخانه","نشانگر LED","روشن شدن سریع","حالت فروشگاهی خودکار","Area","حالت نمایشی"];
var sysResetDes = "آیا مطمئن هستید که می خواهید این عملکرد را انتخاب کنید؟";	
var sysMenuLangOptions = ["زبان","زبان شنیداری دلخواه","زبان شنیداری دلخواه دوم"];
var sysTimerOptions = ["منطقه زمانی","نام منطقه","ساعت","زمان خواب","آماده به کار خودکار", "منظقه کشور","تقویم هجری"];
var sysTimeZone = ["برای هر بار پخش","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00","GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30","GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00","GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00","GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00","GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00","GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];	
var sysTimeZoneLA = ["دریافت از پخش کننده","منطقه 1","منطقه 2","منطقه 3","منطقه 4","منطقه 5"];
var sysTimeZoneNA = ["نیو فوندلند","آتلانتیک","شرقی","مرکزی","کوهستان","اقیانوسیه","آلاسکا","Hawaii","Samoa"];	
var sysSleepTimer = ["خاموش","‏10 دقیقه","‏20 دقیقه","‏30 دقیقه","‏40 دقیقه","‏50 دقیقه","‏60 دقیقه","‏90 دقیقه","‏120 دقیقه"];	
var sysStandby = ["خاموش","‏4 ساعت","‏6 ساعت","‏8 ساعت"];	
var sysRegionName = ["مادرید  ","جزایر قناری"];	
var sysClockOptions = ["همزمان سازی خودکار","تاریخ","زمان","تعیین زمان روشن شدن","تنظیمات زمان  ","کانال روشن شدن",
    "تعیین زمان خاموش شدن","تنظیمات زمان  ","ساعت تابستانی"];
var sysTimer = ["خاموش","روزانه","یک‏بار"];	
var sysInputSet = ["بدون برچسب","DVD","Blu-ray","HDD","DVDR","ضبط HD","بازی","VCR","PC","STB دیجیتال","‏HD دیجیتال STB","دوربین","ضبط کننده","سایر"];	
var sysAvVideoInput = ["خودكار","RGB_CVBS","RGB","CVBS","S-Video"];	
var sysUpdate = ["با USB","با شبکه","با کانال"];	
var sysUpdateDes = [" "," "," ","نرم افزار جدید یافت نشد!","نسخه جدید XXXX نرم افزار یافت شد. آیا هم اکنون مایل به بروزرسانی هستید؟","لطفاً حافظه جانبی USB را قرار دهید.","بررسی نرم افزار انجام نشد، لطفاً دوباره امتحان کنید!","در حال بروزرسانی. این کار مدتی زمان خواهد بود و سپس تلویزیون بطور خودکار دوباره راه اندازی می شود!","نرم افزار با موفقیت بروز شد.\nسپس تلویزیون بطور خودکار دوباره راه اندازی می شود!","نسخه جدید XXXX نرم افزار یافت شد. آیا هم اکنون می خواهید دانلود کنید؟ بسته به وضعیت شبکه شما شاید مدتی طول بکشد.","در حال دانلود","دریافت نرم افزار انجام شد. آیا می خواهید بروزرسانی تلویزیون را شروع کنید؟","بروزرسانی انجام نشد!","جستجو برای فایل های ارتقا","نرم افزار با موفقیت بروز شد.\nحالا تلویزیون را خاموش و روشن کنید."];	
var sysProductInfo = ["نسخه فعلی","نام محصول","نام سازنده","نام شاسی"];	
var sysCiDes = ["هیچ کارت CI یافت نشد."];	
var sysAdOptions = ["ثبت DivX(R)","لغو ثبت DivX(R)‎","T-Link","خطای مجوز","تایید لغو ثبت","تایید کرایه","انقضای کرایه"];
var sysRegistDes = ["برای پخش ویدئوهای محافظت شده DivX(R)‎ باید دستگاه خود را ثبت کنید.","کد ثبت:","در http://vod.divx.com ثبت کنید"];	
var sysDregistDes = ["کد حذف ثبت:","ثبت را در http://vod.divx.com حذف کنید","به ثبت ادامه می دهید؟"];	
var mediaAuthorization = ["دستگاه شما مجوز پخش این ویدئوی محافظت شده DivX(R)‎ را ندارد."];	
var deregistrationConfrimation = ["دستگاه شما از قبل ثبت شده است.","آیا مطمئنید كه می خواهید ثبت آنرا حذف کنید؟"];	
var rentalConfirmation = "‏DivX(R)‎ کرایه ای XXXX از YYYY مشاهده را داشته است. ادامه؟";	
var rentalExpired = "‏DivX(R)‎ کرایه ای XXXX از YYYY مشاهده را داشته است. ‏DivX کرایه ای منقضی شده است.";	
var parentalRatingLA = ["رتبه بندی والدین","رتبه بندی سنی","رده بندی محتوایی"];	
var parentalRatingNA = ["رتبه بندی والدین","مسدود کردن محتوای رده بندی نشده","رتبه بندی سنی","رده بندی محتوایی","ایالات متحده","کانادا","تنظیمات RRT","بازنشانی RRT"];	
var parentalRatingOptionUS = ["ایالات متحده","رده بندی تلویزیون","MPAA"];	
var sysTVRatingUS = ["TV-Y","TV-Y7","TV-PG","TV-14","TV-MA"];	
var sysMPAAUS = ["G","PG","PG-13","R","NC-17","X"];	
var parentalRatingOptionCanada = ["کانادا","کانادا انگلیسی","کانادا فرانسه"];	
var sysCanadaEng = ["C","‪C8+","G","PG","‪14+","‪18+"];	
var sysCanadaFre = ["G","‪8ans+","‪13ans+","‪16ans+","‪18ans+",""];	
var sysResetRRT = ["آیا مطمئنید که می خواهید RRT را بازنشانی کنید؟"];	
var ageRatingOptions = ["L","10","12","14","16","18"];	
var contentRatingOptions = ["خاموش","مواد مخدر","خشونت","جنسیت","خشونت و مواد مخدر","سکس و مواد مخدر","خشونت و سکس","خشونت، سکس و مواد مخدر"];	
var sysLockOptions = ["قفل کانال","قفل فاصله زمانی","کنترل سنی والدین","قفل منبع ورودی","قفل کلید های دستگاه","قفل نصب برنامه ","تغییر رمز","حداکثر میزان صدا","پاک کردن همه"];
var sysTimeIntervals = ["نوع قفل","زمان شروع","زمان اتمام"];	
var sysRatingOptions = ["هیچ ‏کدام","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","رده بندی X (اسپانیا)"];
var changePass = ["تغییر رمز","رمز عبور جدید:","تایید رمز"];	
var changePassDes = ["رمز عبور نادرست است.\nلطفاً دوباره وارد کنید!","رمز عبورها مطابقت ندارند\nلطفاً دوباره وارد کنید!","رمز عبور تعیین شد!","این کد برای رمز عبور خیلی ساده است.\nلطفاً دوباره وارد کنید!"];	
var sysPowerOnChOptions = "حالت انتخاب";	
var sysPowerOnCh = ["آخرین وضعیت","انتخاب کاربر"];	
var netWlessSecu = ["باز کردن","حالت (WEP) ","حالت (WPA/WPA2-PSK)"];
var netWlessSecu2 = ["هیچ‏کدام","حالت (WEP) ","حالت (WPA-PSK)","حالت (WPA2-PSK)","حالت (WPA/WPA2-PSK)","پشتیبانی نمی شود"];
var netWlessSecu3 = ["هیچ‏کدام","حالت (WEP) ","حالت (WPA-PSK\\TKIP)","حالت (WPA-PSK\\AES)","حالت (WPA2-PSK\\TKIP)","حالت (WPA2-PSK\\AES)","حالت (WPA/WPA2-PSK\\Auto)","پشتیبانی نمی شود"];
var netOptions = ["اتصال اینترنت","رابط","تنظیمات بی‏سیم","تنظیمات IP","اطلاعات","آزمایش اتصال","DLNA","کنترل از راه دور تلویزیون","تنظیمات Netflix","نمایش WiFi","نوع آدرس","آدرس IP","ساب نت ماسک","گیت وی پیش فرض","DNS اولیه","DNS ثانویه","نام شبکه (SSID) ","نام BSSID   ","لطفاً نام شبکه(SSID) مورد نظر را وارد کنید:","شناسه کاربری"];
var chEditDes = ["شماره کانال تکراری!","برای حذف کاراکتر فعلی دکمه قرمز را فشار دهید!","شماره کانال نادرست."];	
var chEpgNoProgram = "اطلاعات برنامه موجود نیست، لطفاً ابتدا کانال ها را جستجو کنید!";	
var chEpgWords = ["راهنمای برنامه","فاقد اطلاعات برنامه.","کانال قفل!","هیچ اطلاعاتی درباره‏ی این برنامه موجود نیست.","فاقد عنوان برنامه."];	
var chEpgBooking = ["اطلاعات برنامه زمانبندی شده", "شماره کانال","تاریخ شروع","زمان شروع","زمان اتمام","نوع تکرار","نوع زمانبندی شده",
    "افزودن برنامه زمانی","جایگزین‏کردن","تغییر","افزودن/اصلاح"];
var epgHotKey = ["روز قبل","روز بعد","فیلتر","فهرست زمانبندی شده","افزودن برنامه زمانی"];
var chEpgBookRemind = ["زمان شروع نادرست","زمان پایان نادرست","برنامه تکراری","ذخیره شد.","حذف شد."];
var chSchePara = ["لیست زمانبندی شده","زمان شروع","تاریخ شروع","عنوان برنامه","نام کانال","مدت:","تکرار","برنامه زمانبندی شده","ویرایش","حذف"];
var dateTimer = ["یک‏بار","روزانه","هفتگی"];	
var scheduleDeleteReminds = "می خواهید این برنامه را حذف کنید؟";	
var scheduleNoLists = "هیچ لیست برنامه زمانبندی شده وجود ندارد، برای افزودن لیست کلید \"قرمز\" را فشار دهید";
var chListWords = ["فهرست کانال","انتخاب لیست","حالت تنظیم","افزودن به علاقه‌مندی‌ها","حذف","انتخاب فهرست کانال","انتخاب حالت تیونر","جابجایی"];
var chListType = ["همه","دیجیتال","آنالوگ","رادیو","مجانی","برگزیده‏ها"];	
var chAutoScanOptions = ["انتخاب اپراتور","نوع کانال","جستجوی خودکار"];	
var souSoundType = ["نادرست","مونو","مونو","استریو","استریو","SAP","SAP","دوتایی1","دوتایی2","دوتایی2","‏Nicam مونو","‏Nicam استریو","‏Nicam دوتایی1","‏Nicam دوتایی2","‏Nicam دوتایی","مونو","LL","RR","LR"];	
var souPreset = ["موزیک","فیلم","صدا","استاندارد","شخصی"];
var picAdRgbMode = ["خاموش","فقط قرمز","فقط سبز","فقط آبی"];	
var picAdOptions = ["کاهش نویز","MPEG NR","حالت RGB","کنتراست پویا","وضوح حرکتی LED","رنگ پوست","حالت فیلم","حالت بازی","دمای رنگ",
    "تعادل نور سفید","مکث تصویر","کشیده شدن نوارهای مشکی","اوور اسکن","گاما","حالت HDMI","توازن سفید 10 نقطه ای","تقویت کننده رنگ","کاهش محوی","کاهش لرزش","فضای رنگ","وضوح حرکتی"];
var pic10Pwhite = ["مقطع زمانی","قرمز","سبز","آبی","بازنشانی","رنگ","زرد","نیلی","زرشکی"];	
var picMotionClarity = ["حالت حرکتی","میان یابی حرکتی","وضوح حرکتی LED","کاهش محوی","کاهش لرزش","بازنشانی"];	
var picMotionMode = ["فیلم","نرم","پاک ‏کردن","ورزشی","مشتری"];
var picResetDes = "همه تنظیمات شخصی باز نشانی می شوند. آیا مطمئن هستید که می خواهید این عملکرد را انتخاب کنید؟";
var pic10PReset = "آیا مطمئنید که می خواهید توازن سفید 10نقطه ای را بازنشانی کنید؟";
var picMotionReset = "آیا می خواهید وضوح حرکتی را بازنشانی کنید؟";	
var picColorSpaceReset = "آیا مطمئنید كه می خواهید فضای رنگ را بازنشانی کنید؟";	
var picOptions = ["حالت تصویر","نور پس زمینه","روشنایی","شفافیت","رنگ","فام رنگ","وضوح","دمای رنگ","حالت صفحه نمایش","فرمت خودکار","تقویت ورزشی","سه بعدی ","پیمایش 3 بعدی","تنظیمات مصرف بهینه","هندسی","تنظیمات پیشرفته","بازنشانی تصویر","فناوری تنظیم نقطه‌ای نور"];
var picSize = ["فرمت 16:9", "فرمت 3‏:4", "فرمت 9:14", "سینراما","بزرگ نمایی 9:‏16", "بزرگ نمایی 9:‏16","بزرگ نمایی 9:‏14","بزرگ نمایی کشیده","بزرگ نمایی واید","بزرگ نمایی 2","بزرگ نمایی واید 2","تطابق اصلی صفحه نمایش","نقطه به نقطه","اصلی","پاناروما"];
var others = ["صدای دستگاه","پخش","رمز عبور:","وضعیت","ذخیره","جایگزین‏کردن","شروع","خروج","جستجو","حذف","هیچ‏کدام","خودکار","جستجو","نوع امنیت","اتصال","نوسازی","دوباره امتحان کنید","توقف","تنظیمات","کانال‏ها","ویرایش","قرار دهید","نوع شبکه","پایان","استریو","آهنگ","منبع ورودی","فاقد صدا","نکات","بازنشانی","مشتری","تنظيم","ذخیره","کاربر","بستن صفحه کلید","انتخاب نوع امنیت شبکه","هر روز","فهرست PVR"];
var direction = ["تمایل به چپ","تمایل به راست","بالا","پایین"];	
var audioType = ["MPEG","DOLBY AUDIO"/*"AC3"*/,"MPEG4","AAC", "DOLBY AUDIO"/*"AC3P"*/,"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD"," "," "," "," "," "," ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2","HE-AAC_V4","ناشناخته"];	
var soundChannels = ["ناشناخته","مونو","ساب ووفر","دوتایی مونو","استریو","ساب ووفر استریو","استریو دالبی فراگیر","فراگیر 2 کانالی","پیرامون","3.0 کانال","4.0 کانال","5.0 کانال","جلوه فرکانس پایین مونو","جلوه فرکانس پایین دو تایی مونو","جلوه فرکانس پایین استریو","فراگیر 2 کانالی با جلوه فرکانس پایین","فراگیر با جلوه فرکانس پایین","3.1 کانال","4.1 کانال","5.1 کانال","7.1 کانال","استریو ترکیبی","اف ام رادیو مونو","اف ام رادیو استریو","اف ام مونو Nicam مونو","اف ام مونو Nicam استریو","اف ام مونو Nicam دوتایی","تمایل به چپ","تمایل به راست","سایر اطلاعات"];	
var prompts = ["تنظیمات تصویر را مطابق با شرایط مشاهده خود انتخاب کنید.",
    "سطح روشنایی را تنظیم کنید. هرچه به 100 نزدیک تر باشد  رنگ ها روشن تر خواهد بود.",
    "سطح کنتراست را تنظیم کنید. هرچه به 100 نزدیک تر باشید اختلاف قسمت های روشن و تیره بیشتر می شود.",
    "سطح اشباع را تنظیم کنید. هرچه به 100 نزدیک تر باشد رنگ قوی تر خواهد بود.",
    "سطح وضوح را تنظیم کنید. هرچه به 100 نزدیک تر باشد جزییات واضح تر خواهند بود.",
    "سطح نور پس زمینه را تنظیم کنید. هرچه به 100 نزدیک تر باشد صفحه روشن تر خواهد بود.",
    "سطح سایه رنگ را تنظیم کنید. این تنظیم سایه های رنگ را اصلاح می کند.",
    "فرمت تصویری را انتخاب کنید که بهتر با برنامه ای که مشاهده می کنید هماهنگ باشد.",
    "گزینه های صرفه جویی انرژی را پیکربندی کنید.",
    "تنظیمات هندسه صفحه را برای زمان اتصال به یک کامپیوتر تنظیم کنید.",
    "تنظیمات پیشرفته تصویر را انتخاب کنید.",
    "تمام تنظیمات تصویر را به حالت اولیه بازگردانید.",
    "حالت صدایی را که با سلیقه شما مطابقت دارد را انتخاب کنید.",
    "تعادل صدای چپ و راست را تنظیم کنید.",
    "سیستم بازیابی صدای TruSurround HD صدای غنی و وضوح عالی را در فرکانس های بالا و پایین تامین می کند.",
    "انتخاب نوع فرمت SPDIF",
    "زبان صدا را که با سلیقه شما مطابقت دارد انتخاب کنید.",
    "کسانی را که دچار ضعف بینایی هستند به قادر به لذت بردن از برنامه های تلویزیونی می سازد.",
    "اطلاعات کانال را مشاهده نمایید.",
    "نوع فهرست کانال را مطابق با سیگنال تلویزیون خود انتخاب کنید.",
    "زبان زیرنویس برنامه را که در پایین صفحه نمایش داده می شود انتخاب کنید.",
    "تلتکست کانال فعلی را مشاهده کنید.",
    "Digital Living Network Alliance. از موسیقی، عکس و فیلم از طریق شبکه خانگی از سایر تجهیزات مانند کامپیوتر لذت ببرید.",
    "محتویات تلفن هوشمند را روی تلویزیون نمایش داده و از تلفن هوشمند به عنوان کنترل از راه دور تلویزیون استفاده نمایید.",
    "محتویات را از یک دستگاه Android سازگار با Miracast روی صفحه تلویزیون نمایش دهید.",
    "برای تلویزیون خود قفل بگذارید.",
    "برای وسیله خود یک نام انتخاب کنید.",
    "محیط مشاهده خود را انتخاب کنید.",
    "تمام تنظیمات سیستم را به پیش فرض بازیابی کنید.",
    "Switch off sports mode for more options.",
    "بهبود بخشیدن به کنتراست محیط",
    "یک حالت ویژه برای تماشای بازی های ورزشی",
    "از قابلیت های فراوان CEC لذت ببرید."];
var initialTitle = ["خوش‏آمدید"," تنظیمات نصب اولیه"];
var initialPrompt = ["تنظیمات راه اندازی اولیه خود را هم اکنون انجام دهید، و دنیایی از تجربیات هیجان انگیز در انتظار شما خواهد بود!",
    "لطفاً زبان خود را انتخاب کنید:",
    "کشور / منطقه خود را انتخاب نمایید:",
    "لطفاً محیط مورد استفاده خود را انتخاب کنید:",
    "لطفاً نحوه اتصال به شبکه را انتخاب کنید:",
    "لطفاً نوع اتصال به شبکه کابلی را انتخاب کنید:",
    "اتصال به xxxxxxxxx انجام نشد! لطفاً مطابق با نمودار زیر به وسیله متصل شوید یا برای بازنشانی چپ را انتخاب کنید.",
    "به xxxxxxxxx متصل شد! برای ادامه راست را انتخاب کنید.",
    "‏1)تلویزیون شما شاید یک آداپتور بیسیم داخلی داشته باشد‎ \n‏2) یا، اگر یک آداپتور بیسیم USB ارائه شده است آنرا به تلویزیون خود وصل کنید. سپس لطفاً حالت اتصال شبکه بیسیم را انخاب کنید",
    "در حال جستجو، لطفاً صبر کنید...",
    "هیچ آداپتور بیسیمی به تلویزیون وصل نیست!",
    "قبل از کلیک روی دکمه \"بعدی\" از نصب شدن پین کد زیر در مودم اطمینان حاصل کنید.",
    "قبل از کلیک روی دکمه \"بعدی\" تا مدت 120 ثانیه دکمه مربوطه بر روی مودم را فشار دهید.",
    "تنظیم Wi-Fi محافظت شده (WPS)",
    " شماره شناسایی شخصی (PIN)",
    "پیکربندی دکمه فشاری(PBC)",
    "فقط با استفاده از اتصال به شبکه امکان دسترسی به محتوای اینترنتی وجود دارد. آیا می خواهید بدون انجام تنظیمات اتصال به شبکه از این مرحله عبور کنید؟",
    "چند بروزرسانی نرم افزاری برای دانلود موجود است، این کار بسته به وضعیت شبکه شاید مدتی طول بکشد.",
    "با بروزرسانی نرم افزار تلویزیون خود می توانید از آخرین قابلیت ها و خدمات استفاده کنید.",
    "شما از آخرین قابلیت ها و خدمات بهره مند نخواهید شد. آیا می خواهید از بروزرسانی نرم افزار صرفنظر کنید؟",
    "برای ادامه، دکمه جهتی راست را فشار دهید.",
    "موقع بروزرسانی تلویزیون را خاموش نکنید چون باعث خرابی آن خواهد شد.",
    "اگر نمی خواهید بروزرسانی کنید، خیر را انتخاب کنید.",
    "در حال بروزرسانی، لطفاً صبر کنید",
    "می توانید نرم افزار را در سیستم/بروزرسانی نرم افزار هم بروزرسانی کنید.",
    "کشور انتخاب شده نیاز به تنظیم رمز عبور دارد.\nلطفاً کد را برای تلویزیون خود تعیین و تایید کنید.",
    "این کد خیلی ساده است.\nلطفاً از عددهای متفاوت استفاده کنید.",
    "تبریک می گوییم! تنظیم اولیه انجام شده است. می توانید پیکربندی تنظیمات خود را از طریق منوی تنظیمات اصلی و منوهای فرعی وابسته اصلاح کنید.",
    "لطفاً حالت امنیتی را انتخاب کنید:",
    "لطفاً نوع اتصال شبکه بیسیم را انتخاب کنید:",
    "شبکه"];
var initNetCabAndDonRe = ["هیچ کابل شبکه ای متصل نیست، لطفاً یک کابل شبکه وصل کنید!","آداپتور داخلی بیسیم یا آداپتور USB بیسیم وجود ندارد."];	
var initChPrompt = ["تنظیمات جستجوی کانال",
    "لطفاً نوع جستجوی مورد نظر را انتخاب کنید:",
    "در حال جستجوی خودکار کانال های دیجیتال و آنالوگ",
    "نتایج جستجوی کانال ها: ",
    "لطفاً نوع اسکن کابل را انتخاب کنید.",
    "لطفاً یک اپراتور را از فهرست زیر انتخاب کنید.",
    "لطفاً اطلاعات اسکن را پیکربندی کنید",
    "کانال های کابل زیر یافت شدند:",
    "لطفاً یک اپراتور را از فهرست زیر انتخاب کنید",
    "لطفاً ماهواره ها را برای اسکن انتخاب کرده یا ماهواره انتخابی را ویرایش کنید",
    "لطفاً پارامترهای ماهواره را تنظیم کنید",
    "کانال های زیر یافت شدند و اسکن کانال بعداً در کانال/اسکن کانال قابل انجام است"];
var initClockPrompt = ["زمان ارائه شده توسط شبکه را دریافت کنید!","لطفاً تاریخ و ساعت را تنظیم کنید:"];	
var initialOptions = ["تنظیمات محیطی","تنظیمات اتصال به شبکه","بروز رسانی نرم‏ افزار","تنظیمات نصب کانال","ساعت"];
var initialHotkeys = ["بازگشت","انتخاب","بعدی","موافقم"];
var initLocations = ["خانگی","فروشگاهی","فروشگاهی همراه با دمو"];
var initNets = ["با سیم (کابلی)","بی‏ سیم (Wi-Fi)","شبکه ای جهت اتصال وجود ندارد، از این مرحله عبور کنید."];
var initWireManuals = ["آدرس IP","ساب نت ماسک","گیت وی پیش فرض","DNS اولیه","DNS ثانویه"];	
var initSoftUpdates = ["اجرای بروز رسانی","به‌روزرسانی در زمانی دیگر"];	
var initChannelIns = ["ادامه","رد شدن از جستجوی کانال"];
var initChScanTypes = ["آنالوگ و دیجیتال","دیجیتال","آنالوگ","عبور از مرحله جستجوی کانال"];
var initChDvbts = ["تعداد کانال های ATV یافت شده :","تعداد کانال های DTV یافت شده :"];
var initChDvbcs = ["تعداد کانال های ATV یافت شده :","تعداد کانال های DTV یافت شده :"];
var initChDvbss = ["کانال های ماهواره:"];	
var initChDvbSOther = ["نمی خواهم ماهواره اسکن کنم"];	
var initEndConnectedStatus = ["اتصال برقرار نیست","‏WiFi متصل است","اتصال با سیم"];	
var initEndInstallations = "‏XXXX کانال نصب شدند";	
var initEndUpdate = ["بروز آوری شده"];
var audioScenes = ["رومیزی","دیواری"];
var screenSavers = ["کانالی موجود نیست، لطفاً کلید تایید را فشار داده و جستجو کنید!",
    "فاقد سیگنال!",
    "کد شده",
    "فقط داده",
    "برنامه صوتی",
    "بدون صدا و تصویر",
    "در دسترس نیست",
    "بدون تلتکست",
    "اطلاعات برنامه موجود نیست.",
    "برنامه قفل شده است!",
    "برنامه قفل شده است!\nتایید را فشار داده و کد خود را وارد کنید.",
    "هیچ اطلاعاتی درباره‏ی این برنامه موجود نیست.",
    "برنامه برای کودکان نامناسب است.\nتایید را فشار داده و کد خود را وارد کنید.",
    "کانال قفل است!",
    "کانال مسدود است!\nجهت ورود رمز تایید را فشار دهید.",
    "ورودی مسدود است!\nجهت ورود رمز تایید را فشار دهید.",
    "پشتیبانی نمی شود!",
    "این سرویس در حال حاضر موجود نیست",
    "ورودی قفل شده است!",
    "فاقد عنوان برنامه.",
    "فاقد عملکرد",
    "فاقد زیرنویس"];
var channelNumberOverPromt = ["The number of search programs has exceeded,you can delete some programs and then retry!"];
var chBookingPromt = ["برای کانال فعلی برنامه زمانبندی شده ضبط وجود دارد، تلویزیون شروع به ضبط می کند.","یک ضبط برنامه ریزی شده یافت شد.\n برای ضبط به XXXX بروید","برای کانال فعلی یادآوری وجود دارد.","یک یادآوری برنامه ریزی شده یافت شد.\n به XXXX بروید"];
var timeUnit = ["ثانیه","دقیقه"];	
var ciPromt = ["داده های شبکه تغییر یافت. برای بروزرسانی می توانید یک اسکن بروزرسانی انجام دهید.",];	
var othersPromt = ["لطفاً صبر کنید...",];	
var menuOptions = ["تصویر","صدا","کانال","اشتراک گذاری","شبکه","سیستم","پشتیبانی"];
var optionOptions = ["حالت تصویر","حالت صدا","مکث تصویر","T-Link","ماشین زمان ","ضبط (PVR)","لیست زمانبندی شده","تنظیمات","دمو"];
var optionTLinkPromt = [["روشن شدن خودکار","آماده به کار خودکار","منوی راهنما"],["روشن كردن","آماده به كار","حجم صدای آمپلی فایر"]];	
var powerPromt = ["تلویزیون خاموش خواهد شد! برای لغو یکی از دکمه ها را فشار دهید"];
var ttxLanguage = ["اروپای غربی","اروپای شرقی","روسی","عربی ","فارسی","عربی","بلاروسی","یونانی","ترکی"];
var ttxOptions = ["آشكار سازی","صفحات زیرشاخه دوره","زبان منوی دستگاه ","صفحه زنگ ساعت","رویداد خبری"];
var weekday = ["یک‏شنبه","دوشنبه","سه ‏شنبه","چهارشنبه","پنج‏ شنبه","جمعه","شنبه"];
var lcnConfflict = "این برنامه با مشکلات دریافت روبروست. نسخه دیگری در کانال ‎%d موجود است";	
var inShopMode = "تلویزیون شما در حالت فروشگاه است. برای حالت خانه گزینه \"سیستم\" را انتخاب کرده و \"محل\" را در منو تغییر دهید.";
var nitRefresh = "داده های شبکه تغییر یافت. آیا می خواهید اسکن بروزرسانی انجام دهید؟";	
var picHDMIMode = ["خودكار","موارد گرافیکی","تصوير"];	
var glassRemind = ["لطفاً عینک 3 بعدی خود را با تلویزیون جفت کنید\\n(دکمه توان روی عینک 3 بعدی را فشار داده و نگه دارید).","عینک 3 بعدی شما به تلویزیون وصل شده است.",""];
var pvrRemind = ["لطفا در هنگام ضبط حافظه جانبی را جدا و یا دستگاه را خاموش ننمایید"];
var pvrConName = ["PVR","اطلاعات کانال:",["توجه: برای ضبط کردن کانال های HD، درایو USB را انتخاب کنید (با سرعت بیشتر از 5.0 مگابایت/در ثانیه)؛ برای ضبط کردن کانال های SD، درایو USB را انتخاب کنید (با سرعت بیشتر از 3.0 مگابایت/در ثانیه).","ویدیوی ضبط شده در پوشه \"pvr\" ذخیره می شود."],"توقف","ضبط","ساعت","دقیقه","طول زمان","نکات","از کلیدهای جهتی برای تنظیم مدت زمان ضبط استفاده نمایید."];
var pvrDisRemind = "جهت ضبط حافظه جانبی را به دستگاه متصل نمایید.";
var pvrRemindWords = ["آیا مایل هستید خارج شوید؟",
    "آیا می خواهید ضبط را متوقف کنید و فایل های ضبط شده را مرور کنید؟",
    "حافظه جانبی از دستگاه جدا شده است.",
    "فضای خالی کافی وجود ندارد.",
    "فایل ضبط شده ای موجود نیست، شروع جهت ضبط.",
    "‏PVR در یک کانال کد شده پشتیبانی نمی شود.",
    "قابلیت موجود نیست",
    "ذخیره شد.",
    "آیا می خواهید فرایند ضبط را قطع کرده و منبع ورودی را عوض کنید؟",
    "تلویزیون نوبت ضبط کنونی را متوقف خواهد کرد. آیا می خواهید خارج شوید؟",
    "ضبط PVR برای کار نیاز به سیگنال تلویزیون دارد، لطفاً سیگنال خود را کنترل کنید."];
var pvrChangeCh = ["آیا می خواهید کانال را عوض کنید؟","آیا می خواهید فرایند ضبط را قطع کرده و کانال را عوض کنید؟"];	
var pvrChangeToPIN8 = ["آیا می خواهید منبع را به وسیله متصل به ورودی SCART تغییر دهید؟",    "آیا می خواهید فرایند ضبط را قطع کرده و منبع را به وسیله متصل به ورودی SCART تغییر دهید؟"];	
var pvrChangeToCEC = ["آیا می خواهید منبع را به وسیله متصل به ورودی HDMI تغییر دهید؟",   "آیا می خواهید فرایند ضبط را قطع کرده و منبع را به وسیله متصل به ورودی HDMI تغییر دهید؟"];	
var pvrGuideJump = ["آیا می خواهید وارد EPG شوید؟","آیا می خواهید فرایند ضبط را قطع کرده و وارد EPG شوید؟"];	
var pvrMediaJump = ["آیا می خواهید وارد رسانه شوید؟","آیا می خواهید فرایند ضبط را قطع کرده و وارد رسانه شوید؟"];	
var timeshiftExtra = ["آیا می خواهید ماشین زمان را متوقف و کانال را عوض کنید؟",
    "آیا می خواهید ماشین زمان را متوقف و منبع ورودی را به و  ورودی SCART تغییر دهید؟",
    "آیا می خواهید ماشین زمان را متوقف و منبع را به ورودی HDMI تغییر دهید؟",
    "ماشین زمان در یک کانال کد شده پشتیبانی نمی شود.",
    "آیا می خواهید ماشین زمان را متوقف و وارد راهنمای الکترونیکی برنامه شوید؟",
    "آیا می خواهید ماشین زمان را متوقف و وارد رسانه شوید؟",
    "آیا می خواهید ماشین زمان را متوقف و منبع ورودی را عوض کنید؟",
    "برای ضبط حافظه جانبی USB را وارد دهید.",
    "فضای خالی حافظه جانبی USB کافی نیست.",
    "تلویزیون ماشین زمان فعلی را خاتمه خواهد داد. آیا می خواهید خارج شوید؟"];
var timeshiftStatus = ["حرکت سریع به عقب","توقف","پخش","مکث","حرکت سریع به جلو"];	
var pvrPowerOffRemind = ["ضبط در حالت آماده ‏به ‏کار","حالت آماده‏ به ‏کار","تلویزیون در حال ضبط است، آیا می خواهید وقتی تلویزیون در حالت آماده بکار است به ضبط ادامه دهید؟"];
var timeshiftInitTitle = "تنظیم حافظه جانبی USB";	
var timeshiftInitReminds = ["این راهنما برای تنظیم حافظه جانبی USB جهت ماشین زمان است. لطفاً حالت تنظیم را انتخاب کنید.",
    "برای عملکرد بهتر، توصیه می کنیم حافظه جانبی USB را فرمت کنید. این کار باعث پاک شدن اطلاعات می شود.",
    "لطفاً اندازه فایل را برای ماشین زمان انتخاب کنید.",
    "در حال فرمت کردن",
    "فضای خالی کافی وجود ندارد.",
    "ایجاد فایل ماشین زمان",
    "در حال آزمایش سرعت",
    "سرعت حافظه جانبی برای قابلیت ماشین زمان خیلی کم است (< ‎%f مگابایت/ثانیه)!",
    "حافظه جانبی برای ماشین زمان آماده است. اما برای عملکرد بهتر توصیه می کنید آنرا به (سرعت > ‎%f مگابایت/ثانیه) تغییر دهید.",
    "حافظه جانبی برای ماشین زمان آماده است."];
var timeshiftInitButtons = ["فرمت","پرش","لغو","تایید","پایان","خروج"];	
var timeshiftInitOther = ["سرعت حافظه جانبی :","مگابایت/ثانیه"];
var selectChoice = "آیا مطمئن هستید که می خواهید این عملکرد را انتخاب کنید؟";	
var chAtvStore = "ذخیره بعنوان XXXX";	
var chEpgFirstGenreUK = ["فیلم","اخبار و مستند","سرگرمی","ورزشی","کودکان","آموزشی","شیوه زندگی","تأتر"];
var homePageTitleList = ["برنامه ها","تلویزیون","ویدیوها","صفحه‏ی اصلی"];	
var homePageFavAndAllName = ["برنامه های برگزیده","همه‏ی برنامه‏ها"];	
var homePageBackUp = ["راهنمای الکترونیکی","راهنما روشن"];	
var homePageRemind = ["قابلیت های کامل بعد از اتصال شبکه موجود هستند.",
    "تلویزیون شما هنوز هیچ کانالی ندارد. بعد از جستجوی کانال امکان دسترسی به برنامه ها وجود خواهد داشت.",
    "فاقد برنامه","کانال ها جستجو شوند؟"];
var homePageHistory = ["تاریخچه"];	
var miracastTitle = ["نمایش WiFi","دستگاه TCL"];	
var miracastRemind = ["نمایش WiFi به شما اجازه می دهد تا صفحه نمایش و صدای وسیله خود اعم از تلفن هوشمند یا تبلت را بطور بیسیم (یعنی بدون کابل) روی تلویزیون به اشتراک بگذارید. بدین ترتیب می توانید همزمان آنچه را که روی تلفن هوشمند یا تبلت نمایش داده می شود در تلویزیون مشاهده کنید. بعنوان مثال می توانید یک فیلم را در تلفن هوشمند خود به نمایش درآورده و آنرا همزمان در تلویزیون ببینید، یا از تبلت خود بعنوان یک کنترل کننده بازی روی تصاویری که در صفحه بزرگ تلویزیون نمایش داده می شوند استفاده کنید.",
    "نمایش WiFi روی تلویزیون آماده است، لطفاً اشتراک گذاری صفحه دستگاه خود روی تلویزیون را شروع کنید.",
    "برقراری ارتباط. لطفاً صبر کنید!","اتصال برقرار نشد!","وصل نشد. لطفاً بررسی کنید!"];
var homePageLittleWin = ["تنظیمات","رسانه","کانال های برگزیده","تلویزیون هوشمند","راهنمای پخش برنامه‏ها"];	
var hbbtvStopRemind = ["آیا می خواهید پخش را متوقف کنید؟"];	
var colorSystem = ["خودكار","PAL","SECAM","NTSC"];	
var deviceTitleTipsText = "جهت کسب اطلاعات بیشتر ≡ را فشار دهید";	
var emptyListInfo = "هیچ حافظه جانبی USB به تلویزیون وصل نیست!";	
var optionVideoListArray_1 = ["حالت تصویر", "حالت صدا", "حالت پخش", "حالت صفحه نمایش", "حالت سه بعدی",   "تغییر حالت چپ به راست", "عمق میدان", "زیرنویس", "تراک صوتی", "عنوان", "فصل", "اطلاعات"];
var optionVideoListArray_2 = ["حالت تصویر", "حالت صدا", "حالت پخش", "حالت صفحه نمایش",   "زیرنویس", "تراک صوتی", "عنوان", "فصل", "اطلاعات"];
var bottomTipsText = ["پخش/مکث", "حرکت سریع به عقب", "حرکت سریع به جلو", "فهرست پخش", "تنظیمات"];	
var picturePresetArray = ["استاندارد", "پویا", "طبیعی", "فیلم", "شخصی"];
var videoPlayModeArray = ["تکرار همه", "تکرار یکی", "معمولی"];
var screenModeHDArray = ["16:9", "4:3", "سینراما", "بزرگ نمایی واید", "بزرگ نمایی 2", "بزرگ نمایی واید 2", "بزرگ نمایی کشیده", "خودکار"];
var screenModeSDArray = ["16:9", "4:3", "سینراما", "بزرگ نمایی 14:9", "بزرگ نمایی 16:9 ", "بزرگ نمایی 16:9 زوم", "خودکار"];
var Mode3DArray = ["خاموش", "دو بعدی به سه بعدی", "پهلو به پهلو", "بالا-و-پایین", "فاصله بین خطوط"];
var videoOptionListArray = ["خاموش", "شيار", "زیرنویس", "عنوان", "فصل"];	
var subMenuTitleText = "زیرنویس";	
var langMenuTitleText = "زبان شنیداری";	
var titleMenuTitleText = "عنوان";	
var mode3DMenuTitleText = "حالت سه بعدی";	
var langInfoText = "شيار";	
var STOP_RESUME_INFO = "توقف-ازسرگیری";	
var playListName = "نام";	
var eb_tips = "نکات";	
var ok_button = "تایید";	
var eb_info = ["خطای کدگشایی صدا.",
    "خطای کدگشایی تصویر.",
    "فرمت صدا پشتیبانی نشده.",
    "فرمت ویدیویی پشتیبانی نمی شود.",
    "این فایل باز نمی شود.",
    "خطای پخش، لطفاً دوباره امتحان کنید.",
    "فرمت فایل پشتیبانی نمی شود.",
    "ببخشید! پخش کننده متوقف شده است.",
    "مسیر فایل وجود ندارد یا اشتباه است.\\n وسیله ذخیره سازی را دوباره گذاشته و مجدداً امتحان کنید.",
    "ادامه پخش از وضعیت پخش\n قبلی؟"];
var picturePlayErrorTips = ["بارگذاری نشد!!!", "تصویر خیلی بزرگ است!!", "خطا در شبکه!", "خطای رشته!!", "خطای پارامتر!!", "خطای ناشناخته"];	
var frameTitleText = "وسیله جدید";	
var eb_quit_info = "آیا مطمئنید كه می خواهید خارج شوید؟";	
var eb_yes = "بله";	
var eb_no = "خير";	
var offinfo = "خاموش";	
var naInfo = "تهی";	
var consoleInfoArray = ["حرکت سریع به عقب", "حرکت سریع به جلو", "پخش/مکث", "فهرست پخش"];	
var cantOperateText = ["قابلیت پشتیبانی نمی شود."];
var chapterChangeInfo = "فقط فصل های 1 تا XXXX موجود هستند.";
var metaDataArray = ["داده نمای عنوان/نگارش:", "داده نمای فصل:", "داده نمای صدا:", "داده نمای زیرنویس:"];	
var metaTitleInfo = "عنوان";	
var metaChapterInfo = "فصل";	
var videoLoadingInfo = "در حال تجزیه و تحلیل،...";	
var listLoadingInfo = "در حال بارگذاری...";	
var pgInfo = "رده بندی قانونی:";	
var fileNameText = "نام";	
var fileDateText = "تاریخ";	
var fileSizeText = "اندازه";	
var fileDurationText = "مدت:";	
var fileDirectorText = "کارگردان:";	
var fileCopyrightText = "کپی رایت";	
var fileArtistText = "هنرمند";	
var fileAlbumText = "آلبوم";	
var fileGenreText = "سبک";	
var fileYearText = "سال";	
var fileGenreText = "سبک";	
var mainListArray = ["همه", "تصویر", "ویدیو", "موزیک"];
var sortArray = ["نام", "تاریخ"];	
var parserArray = ["معمولي", "بازگشتی"];	
var emptyTipsInfo = "ببخشید. هیچ فایل پشتیبانی شده ای نیست.";
var emptyFolderInfo = "ببخشید. هیچ فایل پشتیبانی شده ای نیست.";
var sortName = "مرتب سازی بر اساس";	
var parserName = "تجزیه کننده";	
var divx_str1 = "ثبت DivX(R)‎";	
var divx_str2 = "لغو ثبت DivX(R)‎";	
var infor_str = "اطلاعات";	
var quickMenuEmptyText = "هیچ گزینه ای موجود نیست.";
var musicSoundPresetArray = ["استاندارد", "فیلم", "موزیک", "صدای واضح", "شخصی"];
var musicInformationArray = ["نام", "هنرمند", "آلبوم", "سبک:", "سال:", "مدت زمان:"];
var playListName = "نام";	
var playTipsInfo = ["شما فایل اول را پخش می کنید.", "شما فایل آخر را پخش می کنید."];
var musicNameInfo = "نام";	
var musicArtistInfo = "هنرمند";	
var musicAlbumInfo = "اطلاعات";	
var optionSoundPresetInfo = "حالت صدا";
var optionBGMInfo = "پخش در پس زمینه";	
var optionAudioOnlyInfo = "فقط صدا";	
var optionInfoText = "اطلاعات";	
var remotePhoneConnecte = "‏XXXX به تلویزیون وصل شده است!";	
var tvRemoteTitle = "کنترل از راه دور تلویزیون";	
var tvRemoteDeveloper = "این نرم‏ افزار محصول شرکت TCL می‏باشد";
var tvRemoteDeviceTitle = "نام دستگاه:";	
var remoteOption = ["به اشتراک ‏گذاری رسانه‏ها","کنترل از راه دور","راهنما","درباره","اتصال هوشمند"];
var remotebottom = "لطفاً \"TV Remote\" را در تلفن هوشمند خود دانلود کنید";	
var remoteStage = ["اندروید","iOS"];	
var sharingReminds = ["اشتراک گذاری عکس ها، فیلم ها و موسیقی با تلویزیون از طریق تلفن.","مراحل کار: ‎\n‏   1. روی \"TV Remote\" در تلفن کلیک کنید. تلفن را با همان شبکه WiFi به تلویزیون وصل کنید؛‎\n‏   2. روی \"اشتراک گذاری رسانه\" کلیک کنید تا فایل های رسانه ای را ببینید؛‎\n‏   3. رسانه ها را جهت پخش به تلویزیون بفرستید (با یکی از گزینه های زیر)","‏a) پوشه/فایل را کشیده و روی نماد تلویزیون در بالای صفحه رها کنید؛‎\n‏   b) تلفن را به سمت تلویزیون حرکت دهید تا نخستین فایل پخش شود؛‎\n‏   c) رسانه موجود روی تلفن را پخش کرده و روی نماد اشتراک گذاری تلویزیون کلیک کنید؛","‏4. هنگام پخش روی تلویزیون، تلفن را تکان دهید تا فایل قبلی یا بعدی پخش شود."];
var controlReminds = ["از تلفن بعنوان کنترل از راه دور تلویزیون استفاده کنید."," ",
    "مراحل کار: ‎\\n‏   1. روی \\\"TV Remote\\\" در تلفن کلیک کنید. تلفن را با همان شبکه WiFi به تلویزیون وصل کنید؛‎\\n‏   2. برای کار با تلویزیون روی \\\"کنترل از راه دور\\\" کلیک کنید"];
var helpDeviceWords = "تعامل چند-صفحه ای";	
var helpBottom = "در عصر فن آوری های ابری، تجهیزات هوشمند مانند تلفن و تلویزیون دارای ارتباط و اتصال دوسویه هستند. رسانه های را روی چندین صفحه با خانواده به اشتراک گذاشته و تلویزیون خود را از طریق تلفن کنترل کنید!";	
var helpReminds = ["آماده سازی ها\‎\n‏   1. \"TV Remote\" را از Google Play یا Apple Store دانلود و نصب کنید.‎\n‏   2. تلفن را با همان شبکه WiFi به تلویزیون وصل کنید."," ","مشخصات توصیه شده تلفن‎\n‏   1. ‏CPU: سرعت بالای 800 مگاهرتز‎\n‏   2. فضای ذخیره سازی: حداقل 80 مگابایت فضای خالی"," ","اعلامیه سلب مسئولیت\n  اگر \"TV Remote\" در تلفن شما موجود نیست، لطفاً با سازنده تلفن تماس بگیرید."];	
var helpButtons = ["قبلی","بعدی"];	
var aboutReminds = ["کنترل از راه دور تلویزیون","این نرم‏ افزار محصول شرکت TCL می‏باشد"];
var aboutExit = "خروج";	
var smartReminds = ["اتصال سریع و هوشمندانه میان تلویزیون و تلفن."," ","مراحل ‎\n‏   1. تلویزیون و تلفن هوشمند را به یک شبکه LAN یکسان وصل کنید. روی \"TV Remote\" در تلفن هوشمند کلیک کنید.‎\n‏   2. روی \"Smart Connect\" برای اسکن کردن کد QR کلیک کنید.‎\n‏   3. در حالی که تلویزیون در حالت نمایش است، کلید اطلاعات روی کنترل از راه دور تلویزیون را برای 4 ثانیه فشار دهید، یک کد QR تمام صفحه باز خواهد شد.",];
var smartQRReminds = ["لطفاً روی \"Smart Connect\" در \"TV Remote\" در تلفن خود کلیک کرده و کد QR را برای اتصال سریع تلویزیون و تلفن اسکن کنید.","کد QR حاوی اطلاعات حساب LAN می باشد. لطفاً آنرا محفوظ نگه دارید."];	
var consoleTipArray = ["قبلی","بعدی","کنسول","فهرست پخش"];	
var optionInfoArray = ["حالت تصویر","حالت پخش","مدت:","جلوه","اطلاعات"];
var playModeArray = ["معمولی","تصادفی","تکرار"];
var durationArray = ["کوتاه (5 ثانیه)", "متوسط (10 ثانیه)", "بلند (15 ثانیه)"];	
var effectArray = ["هیچ‏کدام", "چرخش", "جلوه وایپ به راست", "جلوه وایپ به چپ", "جلوه وایپ به بالا", "جلوه وایپ به پایین", "جلوه جمع شونده", "جلوه منبسط شونده", "تصادفی"];	
var infoArray = ["نام:","حجم:","تاریخ:","محل سکونت:"];	
var picturePresetBarTitleInfo = "حالت تصویر";
var picturePresetBarArray = ["استاندارد","پویا","استودیو","فیلم","شخصی"];
var upTipsInfo = "حرکت تصویر";
var consoleTipsArray = ["کنسول","قبلی","بعدی","فهرست پخش","تنظیمات"];	
var pictureMoveTipsArray = ["برای پخش تصویر بعدی دوباره راست را فشار دهید","برای پخش تصویر قبلی دوباره چپ را فشار دهید","برای نمایش فهرست پخش دوباره پایین را فشار دهید"];	
var optionPvrListArray = ["حالت تصویر","حالت صدا", "حالت صفحه نمایش", "حالت سه بعدی", "زیرنویس", "تراک صوتی", "اطلاعات"];
var titleSpanFirstArray = ["کنترل و اتصال","عملکردهای اولیه","برنامه ها","تلویزیون","تنظیمات","پرسشهای متداول"];	
var titleSpanSecondArray = [["کنترل از راه دور","کلیدهای پنل","پیمایش آسان","اتصال تلویزیون","اتصال تلویزیون","اتصال تلویزیون","بی‏سیم"],
    ["راه اندازی","نوار وضعیت","منبع ورودی"],
    ["برنامه های در حال اجرا","رسانه","کنترل از راه دور تلویزیون"],
    ["تنظیم کانال و حجم صدا","فهرست کانال","راهنمای پخش برنامه‏ها","نصب کانال","کانالهای مورد علاقه"],
    ["تنظیم تصویر","تنظیم صدا","تنظیمات کانال","بروز رسانی نرم ‏افزار","زبان","قفل والدین"],
    ["پرسشهای متداول","پرسشهای متداول","عیب یابی","عیب یابی","شرایط و مقررات"]];
var contentSpan1_1Array = [["پاور:","منبع:","تنظیمات:","گزینه:","بازگشت:","اطلاعات:","صفحه اصلی:","خروج:","فهرست:"],
    ["باعث روشن شدن یا انتخاب حالت آماده به کار می شود",
        "منبع ورودی را انتخاب کنید",
        "برای نمایش منوی تنظیمات",
        "برای نمایش منوی گزینه",
        "بازگشت به منوی قبلی یا خروج از برنامه در حال اجرا",
        "نمایش اطلاعات برنامه",
        "برای دسترسی به صفحه اصلی تلویزیون هوشمند",
        "بازگشت به منوی قبلی یا خروج از برنامه در حال اجرا",
        "فهرست کانال ها را نمایش می دهد"]];
var contentSpan1_2Array = ["کانال قبلی","کانال بعدی","افزایش حجم صدا","کاهش حجم صدا","به صفحه اصلی می رود","تایید گزینه انتخابی","آماده بکار / روشن"];	
var contentSpan1_3Array = ["تایید / راهنما","کانال بالا","کانال پایین","صدا کم","صدا زیاد",
    "در بعضی قابلیت ها بعنوان کلیدهای پیکان دار موجود هستند."];
var contentSpan1_4Array = ["LAN","HDMI ( MHL )‎","HDMI","HDMI ( ARC )‎","آداپتور AV OUT","LAN","تلفن هوشمند","گیرنده/کامپیوتر/DVD","تقویت کننده صوتی","تقویت کننده صوتی/نمایشگر","تلویزیون شما شاید تمام سوکت ها را نداشته باشد."];
var contentSpan1_5Array = ["USB 2.0","USB 3.0","هدفون","آداپتور AV IN","SPDIF","آداپتور صدای ورودی CMP","آداپتور CMP IN (YPbPr)‎","تجهیزات USB","تجهیزات USB","هدفون","‏DVC/کنسول بازی/گیرنده/DVD","تقویت کننده صوتی","‏DVC/کنسول بازی/گیرنده/DVD",
    "تلویزیون شما شاید تمام سوکت ها را نداشته باشد."];
var contentSpan1_6Array = ["رابط عمومی","SD","VGA","SCART","Mini SCART","ANTENNA IN","CI  CAM","کارت SD","PC","گیرنده/DVD","آنتن/کابل/ماهواره","تلویزیون شما شاید تمام سوکت ها را نداشته باشد."];
var contentSpan1_7Array = ["تبلت","PC","روتر","تلفن","تلویزیون"];	
var contentSpan1_8Array = ["عملکرد کلید / پاور","با انتخاب و فشار طولانی مدت، زمان خاموشی را انتخاب کنید ","پایین","بالا","حجم صدا / کانال / منبع"];
var contentSpan2Array = [["با انتخاب کلید Home به صفحه خانگی بروید.","برای مشاهده یکی از برنامه های روز یا ورود به برنامه، تایید را فشار دهید."],["نمایش تاریخ، شبکه و دستگاه ها در گوشه بالا و سمت راست صفحه نمایش."],
    ["منبع ورودی از دستگاه های متصل به تلویزیون از طریق درگاه های مختلف مانند TV ،AV ،HDMI و غیره را انتخاب کنید."]];
var contentSpan3Array = ["از برنامه های برگزیده خود در صفحه تلویزیون هوشمند خود لذت برده و آنها را مشاهده کنید.",
    "تماشای عکس و ویدیو و پخش موسیقی از یک حافظه جانبی .",
    "تلویزیون، تلفن هوشمند یا تبلت خود را به یک LAN متصل کنید.",
    "برنامه اشتراگ گذاری مربوطه را بر روی گوشی و یا تبلت خود اجرا نمایید.",
    "به اشتراک گذاری تصویر، ویدیو و موسیقی روی چند صفحه نمایش با"+
    "اعضای خانواده خود و کنترل تلویزیون از طریق تلفن هوشمند"
    ];
var contentSpan4Array = [["برای عوض کردن کانال P+/P-‎ را فشار دهید.","برای تنظیم صدا V+/V-‎ را فشار دهید."],
    ["برای مشاهده فهرست کانال ها، از روی کنترل از راه دور فهرست را فشار دهید.","برای انتخاب کانال مورد نظر خود دکمه های بالا/پایین را فشار دهید."],
    [".‏EPG یک راهنمای روی صفحه است که برنامه های آتی تلویزیون را نمایش می دهد. شما می توانید بین برنامه ها جا به جا شوید، انتخاب کنید و آنها را ضبط نمایید"],
    ["جستجو و نصب کانالها."],
    ["در لیست کانالها می توانید کانالهای مورد علاقه خود را اضافه یا ویرایش کنید."]];
var contentSpan5Array = ["با استفاده از برنامه های ویدیویی از برنامه مورد علاقه خود لذت ببرید."];
var contentSpan6Array = [["جهت نمایش منوی تنظیمات سیستم، کلید منو را فشار دهید",
    "برای تنظیم مقدارها، به بخش تنظیمات تصویر وارد شوید."],
    ["جهت نمایش منوی تنظیمات سیستم، کلید منو را فشار دهید","برای تنظیم گزینه ها، به بخش تنظیمات صدا وارد شوید."],
    ["جهت نمایش منوی تنظیمات سیستم، کلید منو را فشار دهید","برای تنظیم گزینه ها، به بخش تنظیمات کانال وارد شوید."],
    ["وقتی نسخه جدیدی از نرم افزار موجود است، تلویزیون خود را بروز رسانی کنید."],
    ["شما می توانید زبان دلخواه خود را برای منو انتخاب کنید."],
    ["برای قفل کردن کانال ها یا برنامه هایی که برای کودکان مناسب نیستند، قفل والدین را فعال کنید."]];
var contentSpan7_1Array = [["بدون تصویر، بدون صدا",
    "بررسی کنید که فیوز یا مدارشکن به درستی عمل می کنند.",
    "یک وسیله برقی دیگر را به پریز برق متصل کنید تا مطمئن شوید به درستی کار می کند یا روشن شده است.",
    "دوشاخه برق به درستی به پریز متصل نشده است.",
    "منبع سیگنال را بررسی کنید."],
    ["تصویر عادی، بدون صدا",
        "برای زیاد کردن صدا دکمه V+‎ را فشار دهید.",
        "تنظیمات صدا نادرست است.",
        "خطا در سیگنال از سوی پخش کننده."],
    ["صدای عادی، بدون تصویر",
        "روشنایی و کنتراست را تنظیم کنید.",
        "خطا در سیگنال از سوی پخش کننده.",
        "بررسی کنید که آیا در حالت فقط صدا قرار دارد یا خیر."]];
var contentSpan7_2Array = [["تداخل فرکانس رادیویی",".این تداخل باعث ایجاد امواج متحرک یا خطوط مورب و در بعضی موارد، از دست رفتن کنتراست تصویر می شود. منبع تداخل رادیویی را شناسایی نموده و آن را از بین ببرید"],
    ["بدون رنگ",
        "تنظیمات رنگ را بررسی کنید .",
        "یک کانال دیگر را امتحان کنید، ممکن است برنامه به صورت سیاه و سفید دریافت شود ."],
    ["كنترل از راه دور كار نمى كند",
        "باتری ها را عوض کنید .",
        "باتری ها به درستی در جای خود قرار نگرفته اند، کابل برق اصلی تلویزیون متصل نشده است ."]];
var contentSpan7_3Array = [["محتوای حافظه USB نمایش داده نمی شود .",
    "بررسی کنید که حافظه USB با تلویزیون سازگاری دارد .",
    "بررسی کنید که تلویزیون از فرمت فایلهای صدا و تصویر پشتیبانی می کند ."],
    ["تصویر بدون صدا پخش می شود.",
        "فرمت صدای همراه این تصویر توسط تلویزیون پشتیبانی نمی شود."],
    ["فایلها به خوبی پخش نمی شوند.",
        "عملکرد انتقال حافظه USB ممکن است سرعت انتقال اطلاعات به تلویزیون را تحت تاثیر قرار دهد."]];
var contentSpan7_4Array = [["در زمان بروز رسانی نرم افزار باید به چه نکاتی توجه کنم",
    "هنگام بروز رسانی نرم افزار دستگاه نباید خاموش شود.",
    "هنگام بروز رسانی نرم افزار از هیچ یک از عملکردهای دستگاه کنترل از راه دور استفاده نکنید.",
    "صبور باشید زیرا روند بروزرسانی نرم افزار ممکن است به زمانی نسبتاً طولانی نیاز داشته باشد."],
    ["بعد از بروز رسانی نرم افزار، تغییرات متمایزی در رابط کاربری تلویزیون ایجاد نخواهند شد.",
        ".با بروزرسانی نرم افزاری در بعضی شرایط ممکن است هم عملکردهای دستگاه بروزرسانی شده و مواردی به آن افزوده شود و هم در عین حال عملکرد کلی تلویزیون ارتقا یابد بدون اینکه ظاهر رابط کاربری دچار تغییری شده باشد. در بعضی موارد ظاهر رابط کاربری تلویزیون بدون تغییر باقی می ماند"]];
var termsTitle = "شرایط و مقررات";	
var termsConditions = ["محتوا و خدمات (مجموعاً \"\برنامه مجاز\"\) که از طریق این دستگاه تلویزیون در اختیار شما قرار می گیرند، فقط به صورت مجاز در اختیار شما قرار گرفته و فروخته نمی شوند و شما فقط مطابق با این شرایط و مقررات می توانید از آنها استفاده کنید. تامین کنندگان برنامه مجاز (هر یک \"\تامین کننده برنامه\"\) مالک کلیه حقوقی هستند که صریحاً به شما واگذار نشده باشد. ‎\n‏ 1. حدود مجوز. \nمجوزی که توسط تامین کننده برنامه برای یک برنامه مجاز به شما ارائه شده، محدود و غیر قابل انتقال بوده و فقط شامل حال برنامه مجاز روی دستگاهی است که مالک آن هستید یا کنترل آن را در دست دارید. شما نباید برنامه مجاز موجود روی دستگاه خود را منتشر کنید یا از طریق شبکه به اشتراک بگذارید به گونه ای که دستگاه های مختلفی بتوانند در آن واحد از آن استفاده کنند. شما اجازه ندارید برنامه مجاز را کرایه دهید، اجاره دهید، بفروشید، دوباره منتشر کنید یا مجوز آن را دوباره بفروشید. ‎\n شما تایید و موافقت می کنید که همه برنامه های مجاز و همه محتواهای ارائه شده که از طریق این دستگاه قابل دسترسی هستند، به تامین کننده برنامه تعلق داشته و تحت حمایت قانون مالکیت معنوی آثار هستند. شما اجازه ندارید این اقدامات را برای هیچ یک از برنامه های مجاز یا هر گونه نسخه به روز شده آن انجام دهید: ایجاد تغییر، کپی برداری، جزء جزء کردن، مهندسی معکوس، مجزا کردن، انتظار مجدد، آپلود، پست، انتقال، ترجمه، تلاش برای دستیابی به کد منبع، ایجاد کارهای ترکیبی و مشتق یا هرگونه بهره برداری دیگر. اگر این محدودیت ها را نقض کنید، ممکن است مشمول پیگرد قانونی و خسارت شوید. شرایط این مجوز، تعیین کننده ی کلیه بروزرسانی های صورت گرفته توسط تامین کننده برنامه نیز خواهد بود که این نسخه ها جایگزین و/یا مکمل برنامه مجاز اصلی می شوند مگر اینکه نسخه بروزرسانی شده دارای مجوزی جداگانه باشد که در این صورت شرایط آن مجوز صادق خواهد بود. شما به تنهایی مسئول هرگونه و کلیه هزینه های بروزرسانی (در صورت وجود) برنامه مجاز خواهید بود. ‎\n‏ 2. مطالب اشخاص ثالث. ‎ \nامکان دسترسی به تامین کننده برنامه و خدمات و وب سایت های ثالث (مجموعاً \"خدمات\") از طریق برنامه مجاز به وجود خواهد آمد. شما موافقت می کنید که با استفاده از این خدمات، ممکن است با محتواهایی مواجه شوید که شاید اهانت آمیز، نامناسب یا قابل اعتراض باشند، که مضامین آنها شاید دربرگیرنده واژگان صریح و بی پرده شناخته شود یا نشود و یا اینکه در نتیجه هرگونه جستجو یا وارد کردن آدرس اینترنتی خاصی به صورت خودکار و بدون قصد قبلی لینکها یا ارجاعاتی به مطالب قابل اعتراض ایجاد شود. با این حال شما موافقت می کنید که سازنده این دستگاه (\"سازنده\") و ارائه کننده برنامه هیچ مسئولیتی در قبال شما برای محتویاتی که ممکن است توهین آمیز، گستاخانه و یا قابل اعتراض تشخیص داده شوند نخواهند داشت.\nشما با استفاده از خدمات، تایید و موافقت می کنید که سازنده هیچ مسئولیتی برای بررسی یا ارزیابی محتوا، دقت، کامل بودن، مناسبت، اعتبار، سازگاری با قوانین کپی رایت، قانونی بودن، کیفیت یا هیچ جنبه دیگری از این خدمات ندارد. سازنده در زمینه این خدمات هیچ تضمین یا توصیه ای نمی کند و هیچگونه وظیفه یا مسئولیتی را در قبال شما یا هر فرد دیگری بر عهده نمی گیرد. ‎\n شما تایید و موافقت می کنید که خدمات ممکن است حاوی محتوا، اطلاعات و مطالب اختصاصی (مجموعاً \"\مطالب طرف های ثالث\"\) باشند که این اطلاعات می توانند تحت پوشش قوانین حمایت از مالکیت معنوی و سایر قوانین باشند و در چنین شرایطی احتمال دارد شما به هیچ صورتی مجاز به استفاده از مطالب دیگران نباشید مگر اینکه برای این کار مجوز داشته باشید. شما موافقت می کنید که به هیچ طریقی مطالب دیگران را بازتولید نکنید، تغییر ندهید، اجاره ندهید، کرایه ندهید، قرض ندهید، نفروشید، توزیع نکنید یا کارهای ترکیبی و مشتق از آن ایجاد نکنید، و به هیچ شیوه غیرمجاز از خدمات بهره برداری نکنید. همچنین موافقت می کنید که به هیچ روشی از خدمات برای آزار رساندن، سوء استفاده، تعقیب کردن، تهدید کردن، بدنام کردن یا به هر حالت دیگری برای نقض یا تجاوز به حقوق هر فرد دیگری استفاده نکنید، و اینکه سازنده به هیچ وجه مسئول چنین اقداماتی از سوی شما نخواهد بود و نه مسئول هرگونه پیام آزار دهنده، تهدیدآمیز، بدنام کننده، اهانت آمیز یا غیرقانونی که ممکن است در نتیجه استفاده از خدمات دریافت کنید. ‎\n‏ 3. سلب مسئولیت تضمین.\n شما تایید و موافقت می کنید که با مسئولیت خودتان از برنامه و خدمات مجاز استفاده خواهید کرد. کلیه برنامه ها و خدمات مجاز \"\به همین صورت\"\ و \"\در صورت در دسترس بودن\"\ و بدون هیچگونه تضمینی از هر نوع، چه به صورت صریح و چه به صورت ضمنی، ارائه می شوند. سازنده صریحاً از پذیرفتن کلیه تضمین ها و شرایط تضمینی در زمینه برنامه مجاز و خدمات، چه به صورت صریح و چه به صورت ضمنی، سلب مسئولیت می کند؛ از جمله، اما نه محدود به، تضمین فروش، کیفیت رضایت بخش، تناسب برای اهداف خاص، دقت، واگذاری مطلق و حقوق غیر قابل نقض اشخاص ثالث. سازنده مسئول تضمین دقت، اعتبار، به وقت بودن، قانونی بودن، یا کامل بودن هیچ یک از برنامه های مجاز یا خدمات ارائه شده از طریق این دستگاه نیست و تضمین نمی کند که دستگاه، برنامه مجاز یا خدمات، تامینن کننده نیازهای شما باشند یا اینکه عملکرد برنامه مجاز یا خدمات بدون اختلال و عاری از خطا باشد یا اینکه نقصهای موجود در برنامه مجاز یا خدمات اصلاح شود. اگر مشخص گردد که برنامه یا خدمات دارای مجوز اشکال دارند، تمام هزینه های مربوط به کلیه سرویس ها، تعمیرات یا اصلاحات لازم بر عهده شما می باشد.\nشما تایید و موافقت می کنید که برنامه یا خدمات دارای مجوز ممکن است در هر زمان و بدون اعلام قبلی تغییر کرده، به حالت تعلیق درآمده، حذف شده، خاتمه یافته، با وقفه روبرو شده و یا دسترسی به آنها قطع گردد و سازنده هیچ قول یا تعهدی از بابت موجود بودن هیچیک از محتویات یا خدمات در برنامه یا خدمات دارای مجوز نمی دهد. چنین محتواها و خدماتی از طریق اشخاص ثالث و به وسیله شبکه ها و تجهیزات انتقال ارائه می شوند که سازنده هیچ کنترلی بر آنها ندارد. بدون محدود کردن کلیت موارد فوق، سازنده، صریحاً از هرگونه مسئولیت یا تعهد در قبال هرگونه تغییرات، اختلال، غیرفعالسازی، حذف یا تعلیق هرگونه محتوا یا خدمات ارائه شده در این دستگاه، اعلام سلب مسئولیت می کند. تامین کننده برنامه مجاز و سایر تامین کنندگان خدمات، این حق را برای خود محفوظ می دارند که در هر زمانی و بدون اعلام قبلی برنامه مجاز یا خدمات را تغییر دهند، به حالت تعلیق درآورند، حذف کنند یا دسترسی به آنها را غیرفعال سازند. سازنده همچنین ممکن است در هر زمان و بدون اعلام قبلی و یا ایجاد هیچگونه تعهدی، محدودیت هایی برای استفاده یا دسترسی به برخی از برنامه ها یا خدمات دارای مجوز وضع نماید.\nسازنده هیچ مسئولیت یا تعهدی برای خدمات مشتریان مربوط به برنامه یا خدمات دارای مجوز ندارد. هرگونه استعلام یا درخواست در ارتباط با برنامه یا خدمات دارای مجوز باید مستقیماً با ارائه کننده مربوطه مطرح گردد.‎\n‏ 4. گردآوری و استفاده از اطلاعات\nشما موافقت می کنید که سازنده، ارائه کنندگان برنامه و ارائه کنندگان خدمات ممکن است نسبت به گردآوری و استفاده از اطلاعات فنی و اطلاعات مربوطه برای تسهیل ارائه بروزرسانی های نرم افزاری، پشتیبانی محصولات و سایر خدمات (در صورت وجود) مربوط به دستگاه و برنامه دارای مجوز اقدام نمایند، شامل ولی نه محدود به اطلاعات فنی درباره این دستگاه، سیستم و نرم افزارها، و تجهیزات جانبی. سازنده، تامین کنندگان برنامه و تامین کنندگان خدمات، تا جایی که باعث شناسایی هویت شما نشده، ممکن است از چنین اطلاعاتی برای ارتقای محصولات خود یا ارائه خدمات و تکنولوژی های جدید به شما استفاده کنند. ‎\n‏ 5. موجود نبودن برخی قابلیت ها\nبه دلیل محدودیت های ارائه کننده برنامه، برخی قابلیت ها، برنامه ها و خدمات شاید در این دستگاه (شامل تجهیزات جانبی) یا در تمام مناطق موجود نباشند. استفاده از بعضی ویژگی های این دستگاه نیز ممکن است به ابزار جانبی یا پرداخت حق عضویت نیاز داشته باشد که این موارد به صورت جداگانه فروخته می شوند. ‎\n‏ 6. مسئولیت محدود\nدر محدوده ای که توسط قوانین موضوع غیرمجاز دانسته نشود، تحت هیچ شرایطی، شامل بی توجهی، سازنده هیچ مسئولیتی در قبال شما یا هیچ طرف ثالثی بصورت قراردادی یا خارج از قرارداد برای هیچگونه خسارات مستقیم، غیرمستقیم، اتفاقی، خاص یا تبعی، هزینه وکلا، مخارج، یا هیچ خسارت دیگر ناشی یا در ارتباط با هیچیک از اطلاعات موجود یا در نتیجه استفاده از دستگاه، برنامه دارای مجوز یا هیچیک از خدمات ندارد، حتی اگر احتمال وجود چنین خساراتی مطرح شده باشد."];	
var noChannelListRemind = ["کانالی پیدا نشد. فهرست کانال ها بعد ازجستجوی کانال در اختیار قرار می گیرد.","جستجوی کانال"];	
var closeSubtitleRemind = "در صورتی که زیرنویس خاموش باشد، این قابلیت در دسترس خواهد بود. آیا مایل به خاموش کردن زیرنویس هستید؟";	
var estickerTitles = ["تصاویر بسیار واقعی","رنگ های زنده","حرکت های بسیار طبیعی","کیفیت تصویر دینامیک","ارتقای SR UHD","تجربه دنیای 3 بعدی","عملکرد سریعتر","برنامه های آتی 4K","لذت بردن از دنیای آنلاین","دسترسی به محتواهای گسترده تر","تیونرهای دیجیتال داخلی","اتصال همه دستگاه ها","منابع 4K مختلف","محتوای USB","‏WIFI فوق العاده سریع","محتوای موبایل در تلویزیون","محتوای دستگاه موبایل","محتوای محلی","مورد تایید DivX","تصویر بدون خدشه","کانال آماده","TDT Premium"];	
var estickerDescriptions = ["تجربه شگفت انگیز به یمن تصاویری با جزییات چهار برابر HD کامل روی صفحه UHD",
    "طیف رنگ گسترده حس تمام تصاویر را با رنگ های قرمز عالی و رنگ های سبز زمردی منعکس می سازد",
    "قابلیت میان یابی فریم 4K و محرک نور زمینه با مشکلات تاری تصویر مقابله می کنند",
    "وضوح تصویر اصلی بهبود می یابد تا حس واقعی و پویا با کنتراست فوق العاده نمایش داده شود",
    "از برنامه های تلویزیونی و دیسک های Blu-Ray با وضوح بی مانند لذت ببرید که به یمن فن آوری وضوح برتر ممکن شده است",
    "تلویزیون آماده برای 3 بعدی را تجربه کرده و برنامه های مختلف 3 بعدی را تماشا کنید",
    "با پردازنده چهار هسته ای و تعامل بهتر و عملکرد بالاتر از تجربه سرگرمی برتر لذت ببرید",
    "پشتیبانی از کدگذاری HEVC (H.265)‎ برای استاندارد آتی 4K تصاویر ویدیویی",
    "مجموعه متنوعی از برنامه های آنلاین، خدمات VOD، آرشیو برنامه های تلویزیونی و اینترنت گردی",
    "مشاهده برنامه ها و خدمات اضافی از شبکه های دلخواه شما",
    "دسترسی به کانال های تلویزیونی با وضوح بالا بدون نیاز به گیرنده اضافی",
    "اتصال آسان به بسیاری از منابع دیجیتال موجود در خانه",
    "تلویزیون آماده برای آینده دارای قابلیت پخش 4K 50/60Hz از طریق HDMI 2.0 با HDCP 2.2",
    "پخش مستقیم فیلم یا عکس از حافظه جانبی USB و HDD یا دوربین روی صفحه بزرگ با وضوح 4K",
    "جدیدترین نسل استانداردهای 2x2 MIMO و AC سرعت دسترسی اینترنتی بی مانندی را در اختیار شما قرار می دهند",
    "با اشتراک گذاری بیسیم تصویر،  می توان از عکس ها، فیلم ها و برنامه های موجود در دستگاه های موبایل روی صفحه بزرگ لذت ببرید",
    "تمامی محتواهای تلفن همرا و تبلت می توانند بر روی صفحه بزرگ نمایش داده شوند.",
    "محتواهای محلی مانند عکس و فیلم را از تجهیزات متصل به شبکه محلی روی صفحه بزرگ نمایش دهید",
    "فیلم های کرایه ای یا خریداری شده که توسط DivX محافظت می شوند را پخش کنید",
    "انحنای بسیار باریک و طراحی فوق العاده کم عرض",
    "آزمایش شده و مورد تایید +Canal",
    "آزمایش شده و مورد تایید TDT Premium"];
var eManualTextArray = ["راهنمای الکترونیکی دستگاه","تمام تصاویر گرافیکی موجود صرفاً جهت نمایش هستند."];
var frontPanelRemind = "کلید های دستگاه قفل است.";
var eRPRemind = "حالت فروشگاه با الزامات ERP هماهنگی ندارد. آیا مطمئنید كه مایل به انتخاب آن هستید؟";	
var noRelatedChannel = "هیچ کانال مرتبطی موجود نیست";	
var option0624Name = ["BOP","BFS","رویداد به رویداد","دریافت شناسه کاربر","موسیقی زمینه","بازنشانی همه","بازنشانی فروشگاه","NRM","‏DVB-T2 و انتخاب کشور","حالت HbbTV"];	
var DVBT2AndChoice = ["روشن","برحسب کشور","خاموش"];	
var hbbtvServiceRemind = "سرویس HbbTV بزودی ارائه می گردد.";	
var insertWord = "قرار دهید";	
var viewDetail = "مشاهده جزییات";	
var remindOAD = "بروزرسانی نرم افزار. ممکن است یک بروزرسانی جدید توصیه شده نرم افزاری روی کانالی دیگر موجود باشد. اگر با دانلود آن موافقت کنید، تلویزیون بطور خودکار به آن کانال خواهد رفت. آیا می خواهید الان انجام دهید؟";	
var LEDStatus = ["چشمک زن", "معمولی","خاموش"];
var netFlixRemind = "این قابلیت دسترسی به خدمات Netflix را تا ورود دوباره قطع خواهد کرد.";
var ESNExplanation = "شماره سریال الکترونیکی";	
var resetShopRemind = "سیستم در حال خاموش و روشن شده است، لطفاً تلویزیون را خاموش نکنید";	
var initialSelectOption = "لطفاً یک گزینه را انتخاب کنید:";	
var databaseRemind = "سیستم تشخیص داده است که پایگاه داده ها به دلیلی نامعلوم آسیب دیده و بطور خودکار آن را بازسازی نموده است، برای ادامه تایید را فشار دهید";	
var Deactivation = "غیرفعال سازی";	
var oadFutureRemind = "بروزرسانی نرم افزار.\n یک نرم افزار توصیه شده جدید در ‎%s موجود خواهد بود. بروزرسانی ممکن است مدتی طول بکشد و صفحه ممکن است سیاه شود. لطفاً در طول بروزرسانی گیرنده را خاموش نکنید. اگر این بروزرسانی را می پذیرید، لطفاً گیرنده را در زمان تعیین شده روشن بگذارید. آیا می خواهید این بروزرسانی را دریافت کنید؟";	
var bt_title = "بلوتوث";	
var bt_soundOutPutName = "خروجی صدا";	
var bt_soundOutPutTV = "بلندگوهای تلویزیون";	
var bt_soundOutPutBT = "دستگاه های بلوتوث";	
var bt_soundOutPutBT_TV = "بلوتوث و تلویزیون";	
var bt_refreshBarName = "دستگاه ها";	
var bt_settingTips_On = "جهت جستجوی دستگاه ها، بلوتوث را روشن کنید.";
var bt_settingTips_Finding = "در حال یافتن دستگاه ها...";	
var bt_settingTips_NoDevice = "هیچ دستگاهی موجود نیست.";
var bt_deviceList_State_NoConnect = "متصل نیست";	
var bt_deviceList_State_Connecting = "در حال اتصال...";	
var bt_deviceList_State_Connected = "اتصال برقرار شد";	
var bt_deviceList_State_Paired = "جفت شده";	
var bt_deviceList_Conncect_Failed_Tips1 = "اتصال برقرار نشد.";
var bt_deviceList_Conncect_Failed_Tips2 = "لطفاً تایید کنید که قابلیت بلوتوث XXX روشن است";	
var bt_deviceList_Conncect_Success = "به دستگاه بلوتوث وصل شد.";
var bt_deviceList_Disconncect_Success = "اتصال با دستگاه بلوتوث قطع شد.";
var bt_deviceList_Disconnect = "آیا مطمئنید كه می خواهید از XXX قطع شوید؟";	
var bt_tipsTitle = "نکته";	
var bt_bluetooth_Pairing_Title = "جفت سازی بلوتوث";	
var bt_bluetooth_Input_Pin = "لطفاً پین را وارد کنید:";	
var bt_bluetooth_Output_Pin_Tip = "پین XXXX را با صفحه کلید وارد کنید .";
var bt_bluetooth_Pin_Wrong_Tip = "پین اشتباه";	
var bt_bluetooth_Remove_Pair_Title = "پرسش";	
var bt_bluetooth_Remove_Pair_Ask = "از این دستگاه صرفنظر شود؟";	
var audioDescriptionName = ["توضیحات صوتی","حجم","میزان صدای بلندگو","هدفون","میزان صدای هدفون","میزان صدای توضیحات صوتی","دستگاه بلوتوث","میزان صدای دستگاه  بلوتوث","تقویت کننده","بلندگو"];
var audioDescriptionOptions = ["خاموش","معمولی","توضیحات صوتی"];
var volumeOffRemind = "لطفاً XXX را در منوی تنظیمات روی \"روشن\" تنظیم کنید.";	
var mEPSRemind = "حالت فروشگاه با الزامات MEPS هماهنگی ندارد. آیا مطمئنید كه مایل به انتخاب آن هستید؟";	
var parentRatingAUOptions = ["بدون محدودیت", "‏G و بالاتر محدود شود (اختیاری)", "مسدود کردن PG و بالاتر", "مسدود کردن M و بالاتر", "مسدود کردن MA و بالاتر", "مسدود کردن AV و بالاتر",  "مسدود کردن R و بالاتر", "مسدود کردن همه"];	
var mEPSTips = [".حالت کنونی تصویر با الزامات MEPS مطابقت ندارد، حالت استاندارد توصیه می شود",
    "تلویزیون شما در حالت فروشگاه است.برای حالت خانه به منوی تنظیمات مراجعه کنید."];
var switchSourceRemind = "متصل شده است، آیا تمایل دارید تغییر کند ؟";	
var footballModeName = "حالت ورزشی";	
var resetStadium = "ورزشی";
var atvSearchMenu = "جستجوی دستی ATV";	
var dtvSearchMenu = "جستجوی دستی DTV";	
var settingNoticeSourceName = "منبع خودکار";	
var smartTVOptions = ["پرتال تلویزیون هوشمند","HbbTV","به اشتراک بگذارید و ببینید","نمایش WiFi","شرایط و ضوابط",
    "آماده به کار شبکه","بازنشانی تلویزیون هوشمند","Cookie policy","سیاست حفظ حریم خصوصی","حذف داده ها"];
var supportOptions = ["عیب یابی از راه دور","تماس با ما"];	
var tvDoctor = ["عیب یابی از راه دور 2.0 ",
    "این برنامه فقط برای تلویزیون هوشمند شما جهت اجرای عیب یابی و بهبود تجربه کار با دستگاه موجود می باشد. اطلاعات کارکرد و مشخصات مدل آن توسط این برنامه گردآوری شده و در یک سرور بارگذاری خواهد شد و از آن برای حل مشکل استفاده می شود. دسترسی به اطلاعات شخصی شما انجام نخواهد شد. مطمئن شوید که تلویزیون بطور صحیح به اینترنت وصل باشد.",
    "عیب یابی محلی",
    "بعد از شروع عیب یابی، راهنمایی های کارکنان پشتیبانی را دنبال کنید.",
    "عیب یابی از راه دور",
    "مطمئن شوید که کارکنان پشتیبانی آنلاین باشند.",
    "شماره سریال:",
    "&nbsp;&nbsp;&nbsp;&nbsp;User ID:",
    "در حال اتصال...",
    "متصل شد، لطفاً شبکه را متصل نگاه دارید.",
    "امکان دسترسی به اینترنت نیست، \\nلطفاً اتصال شبکه را کنترل کنید.",
    "خروج"];
var ClosedcaptionName = "زیرنویس";	
var sysCCOptions = ["حالت CC","‏CC آنالوگ","‏CC دیجیتال","سوپرایمپوز","زیرنویس"];	
var sysCCmodeOption = ["خاموش", "روشن", "روشن در صورت بیصدا بودن "];
var sysanalogCCOption = ["خاموش", "CC1", "CC2", "CC3", "CC4", "متن1", "متن2", "متن3", "متن4"];	
var sysdigitalCCOption = ["خاموش", "سرویس 1", "سرویس 2", "سرویس 3", "سرویس 4", "سرویس 5", "سرویس 6", "سرویس 7", "سرویس 8"];	
var syssuperimposeOption = ["خاموش", "سرویس 1", "سرویس 2", "سرویس 3", "سرویس 4", "سرویس 5", "سرویس 6", "سرویس 7", "سرویس 8"];	
var sysCCOPtionItems = ["گزینه CC","حالت","سبک فونت","اندازه فونت","سبک لبه قلم","رنگ لبه قلم","رنگ FG","رنگ BG","ظرفیت FG","ظرفیت BG"];
var sysCCOtionMode = ["دلخواه","پیش‏فرض"];	
var sysCCOptionFontStyle = ["پیش‏فرض","فونت 1","فونت 2","فونت 3","فونت 4","فونت 5","فونت 6","فونت 7"];
var sysCCOptionFontSize = ["پیش‏فرض","بزرگ","کوچک","معمولي"];	
var sysCCOptionFontEdgeStyle = ["پیش‏فرض","هیچ‏کدام","برجسته","فرورفته","سایه چپ","سایه راست"];	
var sysCCOptionFontColor = ["پیش‏فرض","سیاه","سفیدپوست","قرمز","سبز","آبی","زرد","زرشکی","نیلی"];	
var sysCCOptionFontOpacity = ["پیش‏فرض","مستحکم","چشمک زن","نیمه شفاف","شفاف"];	
var contactUsOption = ["تماس با ما",
    "اگر هنگام کار با این دستگاه با مشکلی روبرو شده اید با خدمات پس از فروش تماس بگیرید.",
    "تماس با خدمات پس از فروش",
    "وب سایت: مراجعه",
    "شماره مرکز تماس:",
    "مشخصات دستگاه",
    "نام مدل:",
    "نسخه‏ی نرم ‏افزار:",
    "",
    "شناسه کاربری:",
    "شناسه پروژه:",
    "نوع کلاینت:",
    "آدرس MAC بیسیم:",
    "آدرس MAC با سیم:",
    "Netflix ESN:",
    "اطلاعات روی تلفن موبایل خود را اسکن کنید.",
    "سپس کشور خود را انتخاب کنید."];
var homePageWords = ["تاریخچه", "جستجو"];	
var titlePageWords = ["خانگی", "ویدیو","تلویزیون","برنامه ها"];	
var videosPageWords = ["فیلم", "ورزشی","موزیک","پرطرفدار","بازی","آموزشی","اخبار"];
var statusPageWords = ["USB","تنظیمات","WiFi","با سیم"];	
var searchPageWords = ["جستجو", "جستجوهای پرطرفدار:","برنامه های تلویزیونی، فیلم ها، افراد..."];	
var resultSearchPageWords = ["نتایج درباره"," ","لطفاً کلیدواژه های دیگری را امتحان کنید.","متاسفیم، فایل تصویری یافت نشده است."," "];
var historyPageWords = ["تاریخچه", "فشار دهید","حذف سابقه","حذف یکی","حذف همه","دیروز","امروز",
    "هنوز هیچ فایل تصویری مشاهده نشده است.",
    "سابقه مشاهده حذف گردید!"];
var channelPageWords = [".متاسفیم، هنوز فایل تصویری یافت نشده است"];
var virtualRemoteValues = ["1","2","3","4","5","6","7","8","9",                          "کوچکنمایی","0","بزرگنمایی",                          "خروج","0","",                          "فهرست","0","متن",                          "راهنما","ورود","خروج",                          "منو","زیرنویس","اطلاعات",                          "توقف",                          "اطلاعات","منو","خروج",                          "خروج"                          ];	
var sportsModeInitReminds = ["این راهنما برای تنظیم حافظه جانبی USB جهت حالت ورزشی است. لطفاً حالت تنظیم را انتخاب کنید.", "لطفاً اندازه فایل را برای حالت ورزشی انتخاب کنید.", "ایجاد فایل حالت ورزشی", "سرعت حافظه جانبی USB برای قابلیت حالت ورزشی خیلی کم است (< ‎%f مگابایت/ثانیه)!", "حافظه جانبی USB برای حالت ورزشی آماده است. اما برای عملکرد بهتر توصیه می شود آن را به (سرعت > ‎%f مگابایت/ثانیه) تغییر دهید.", "حافظه جانبی USB برای حالت ورزشی آماده است."];	
var sportsModeExtra = ["آیا می خواهید حالت ورزشی را قطع کرده و کانال را عوض کنید؟","آیا می خواهید حالت ورزشی را قطع کرده و منبع را به وسیله متصل به ورودی SCART تغییر دهید؟","آیا می خواهید حالت ورزشی را قطع کرده و  منبع ورودی به ورودی HDMI تغییر کند؟","حالت ورزشی در یک کانال کد شده پشتیبانی نمی شود.","آیا می خواهید حالت ورزشی را قطع کرده و وارد راهنمای الکترونیکی برنامه شوید؟","آیا می خواهید حالت ورزشی را قطع کرده و وارد مرورگر رسانه شوید؟","آیا می خواهید حالت ورزشی را قطع کرده و منبع ورودی را عوض کنید؟","تلویزیون حالت ورزشی فعلی را خاتمه خواهد داد. آیا می خواهید خارج شوید؟"];	
var remoteControlNote = "- کنترل از راه دور ارائه شده با دستگاه شما شاید بر حسب مدل متفاوت باشد.";	
var textArray = ["حجم صدا ","کانال","منبع ورودی","روشن  ","راهنما","ثانیه تا خاموش شدن"];
var guideArray = ["VOL-","VOL+","کانال-","کانال+","قبلی","بعدی"];	
var favChannelListRemind = [".کانال مورد علاقه ای وجود ندارد، جهت افزودن به لیست علاقه مندی ها، در لیست کانال از کلید سبز رنگ بر روی ریموت استفاده کنید"];
var proxySetting = ["تنظیمات پروکسی","پورت"];
var powerOffShop = ["پیشنهاد می شود از حالت فروشگاهی استفاده گردد، آیا مایل به این کار هستید؟"];
var tcastTextPageWords = ["ویدیوهای متنوع، برنامه‌های فوق‌العاده","کنترل تلویزیون، کاملاً در اختیار شما","محتوای عالی برای اشتراک روی نمایشگر بزرگ"];	
var tcastOtherWords = ["جهت دانلود نرم افزار بار کد را اسکن کنید .","شبکه به تلویزیون متصل شد","نام تلویزیون","‎T-Cast"];
var hbbtvWords = ["تنظیمات HbbTV","HbbTV","کوکی‏ها","کوکی های ثالث","مشخصه دستگاه","ردیابی"];
var hbbtvTrackingWords = ["بله","خیر","بدون اهمیت"];
var eStickerTipWords = ["Storage is under 400M,would you like to delete the videos in Demo mode bo obtain more space?"];
var delEstickerVideoRemid = ["The video has been deleted successfully"];	
var clockPageWords = ["Local","Beijing","Tokyo","Hongkong","Taipei","سنگاپور","Paris","London","Moscow","New Delhi","Djakarta","New York","Rio","Press the \"OK\" key","It can not be added!"];	
var smartKeyWords = ["Wireless Display","Enjoy Music","زمان سنج خواب","World Clock","Soundbar ready","WiFi","PVR","حالت ورزشی"];	
var recommendWords = ["Recommend"];	
var onlyListenRemindWords = ["Enter Audio Only Mode","Press any key except volume key to exit!"];
var selectSatRemind = "حداکثر می­توانید 20 ماهواره انتخاب کنید!";
var emailWord = "آدرس پست الکترونیکی:";
var cookiePolicyTitle = "سیاست کوکی - خدمات برخط تلویزیون هوشمند";
var cookiePolicyConditions = ["این شرکت در هنگام استفاده شما از تلویزیون های تولید شده و خدمات ارائه گردیده توسط آن، به حریم خصوصی شما احترام می گذارد. کوکی ها توسط بسیاری از وبسایت ها و دیگر سرویس های اینترنتی استفاده می شوند و تلویزیون هوشمند شما کوکی ها را می پذیرد، ذخیره می کند و منتقل می نماید تا اطمینان حاصل شود که این وبسایت ها و خدمات به درستی کار می کنند. این شرکت همچنین در هنگام ارائه خدمات به شما از کوکی ها استفاده می کند. این شرکت در سیاست کوکی خود تشریح می نماید که چه کوکی هایی در تلویزیون هوشمند شما قرار گرفته اند و چگونه شما می توانید آنها را مدیریت نمایید.\nلطفاً توجه داشته باشید که تمامی اطلاعات شخصی که شرکت از طریق کوکی ها یا با استفاده از آنها جمع آوری و/یا پردازش می کند مشمول سیاست حفظ حریم خصوصی می باشد و شما باید سیاست کوکی و سیاست حفظ حریم خصوصی را مطالعه نمایید.\n1. کوکی چیست؟\nکوکی ها فایل های متنی کوچکی هستند که ممکن است در تلویزیون هوشمند شما قرار داده شوند. هنگامی که یک وبسایت یا سرویس دکمه-قرمز یک ایستگاه تلویزیونی در دسترس قرار می گیرد، وبسایت یا سرویس مذکور ممکن است یک کوکی را در تلویزیون هوشمند ذخیره کند. طی دسترسی های بعدی، یک کوکی که در تلویزیون هوشمند شما قرار گرفته است اطلاعاتی را به طرفی که کوکی را قرار داده است ارسال خواهد نمود. کوکی ها بسیار رایج هستند و در برخی از وبسایت ها و خدمات مورد استفاده قرار می گیرند. هر کوکی به طور معمول حاوی نام دامنه ای که از آن بر آمده است و \"\"طول عمر\"\" کوکی و یک مقدار (که معمولاً یک عدد منحصر به فرد است) می باشد. برای توضیح کامل تری درباره ماهیت کوکی ها و چگونگی کارکرد آنها، لطفاً به سایت www.allaboutcookies.org مراجعه نمایید.\nکوکی ها را می توان به کوکی های کاربردی و کوکی های غیر کاربردی طبقه بندی نمود. کوکی های کاربردی آنهایی هستند که به طور اکید برای ارائه خدمات به تلویزیون هوشمند شما و برای وبسایت ها و سایر سرویس هایی که محتوای متناسبی را برای تلویزیون هوشمند شما تأمین می کنند مورد نیاز می باشند. کوکی های غیر کاربردی شامل همه کوکی های دیگر می شود.\nاین سیاست کوکی با کوکی هایی که توسط ما و نیز کوکی های تبلیغاتی که از طریق سرویس های ما توسط طرف های سوم در تلویزیون هوشمند شما قرار می گیرند مرتبط می باشد. این سیاست کوکی با کوکی هایی که ممکن است در هنگام استفاده شما از خدمات تلویزیون هوشمند جهت دسترسی به وبسایت ها، خدمات یا برنامه های طرف سوم در تلویزیون شما قرار گیرند، مرتبط نمی باشد. در ارتباط با این کوکی ها، ما شما را به سیاست های کوکی مرتبط با چنین طرف های سومی ارجاع می دهیم. با این حال، این سیاست کوکی روش حذف کردن چنین کوکی هایی را توضیح می دهد (به بخش 4 در قسمت زیر مراجعه کنید).\n2. ما از کدام کوکی های غیر کاربردی استفاده می کنیم؟\nآگهی تبلیغاتی: ممکن است هنگام استفاده از سرویس های تلویزیون هوشمند آگهی های تبلیغاتی ویدیویی و نمایشی در تلویزیون هوشمند شما ارائه گردد. این آگهی های تبلیغاتی می تواند توسط ما یا توسط طرف های سوم، یا از طریق هماهنگی با سرور تبلیغاتی ما ارائه شوند که نقش هماهنگ کننده محوری در ارتباط با ارائه چنین تبلیغاتی ایفا می کند. سرور تبلیغاتی ما یا سرور تبلیغاتی طرف سوم یک کوکی در تلویزیون هوشمند شما قرار خواهد داد. با استفاده از این کوکی، یک سرور تبلیغاتی این موضوع را ثبت می کند که آیا یک آگهی تبلیغاتی به تلویزیون هوشمند شما ارائه شده است یا اینکه فردی که از تلویزیون هوشمند شما استفاده می کند روی یک آگهی تبلیغاتی کلیک کرده است یا خیر. ما از اطلاعات ذخیره شده در کوکی های تبلیغاتی استفاده می کنیم تا بدانیم کدام آگهی های تبلیغاتی به تلویزیون هوشمند شما ارائه گردیده اند تا بتوانیم اطمینان حاصل کنیم که تعداد زیادی از تبلیغات مشابه وارد هیچ تلویزیون هوشمندی نمی گردد، و اینکه بتوانیم قرارهای تجاری خود را با شرکای تبلیغاتی خود حل و فصل کنیم ما از این اطلاعات به منظور ارائه تبلیغات هدفمند استفاده نخواهیم کرد. افزون بر این، طرف های سوم می توانند از سیستم تبلیغاتی ما به منظور ارسال آگهی های تبلیغاتی به تلویزیون هوشمند شما استفاده کنند و در هنگام ارسال این آگهی ها کوکی هایی را در تلویزیون هوشمند شما قرار دهند. \nاین کوکی ها، از میان سایر اطلاعات، حاوی اطلاعاتی در مورد تبلیغات ارائه شده، اطلاعات مرتبط با برنامه یا دامینی که این تبلیغات از طریق آنها ارسال شده و آدرس آی پی شما می باشد. این کار به خاطر یادآوری این موضوع است که یک تبلیغات خاص چند وقت یکبار نمایش داده می شود، و نیز به منظور جلوگیری از نمایش مکرر یک تبلیغات مشخص می باشد. آگهی دهنده های طرف های سوم خارج از شرکت که ممکن است تبلیغاتی را ارائه دهند نیز می توانند از کوکی هایی برای رصد کردن فعالیت شما در وبسایت های مختلف استفاده کنند تا تبلیغاتی را ارائه نمایند که مطابق با اولویت های شخصی شما باشد.\n3. وبسایت های طرف سوم\nهنگامی که شما از طریق سرویس های تلویزیون هوشمند خود از وبسایت ها یا سرویس های طرف های سوم بازدید می کنید، امکان دارد که چنین وبسایت ها یا سرویس هایی کوکی هایی را در تلویزیون هوشمند شما قرار دهند، و نیز ممکن است این وبسایت ها تعاملات شما را در چنین وبسایت هایی رصد و ذخیره کنند. ما چنین فعالیت هایی را درخواست نمی کنیم و به انجام آنها تشویق نمی نماییم و از چنین اطلاعاتی استفاده نخواهیم کرد. لطفاً جهت دریافت اطلاعات بیشتر در مورد استفاده از این قبیل کوکی ها توسط طرف های سوم به سیاست های مربوط به کوکی و حفظ حریم خصوصی چنین وبسایت ها و سرویس هایی مراجعه کنید.\n4. حذف کوکی\nواسط کاربری تلویزیون هوشمند شما این امکان را برایتان فراهم می کند تا تمام کوکی ها و سایر حافظه های مرورگر محلی را از تلویزیون هوشمند حذف کنید. به طور اکید توصیه می شود تا قبل از فروش یا رد کردن تلویزیون هوشمند خود تمام کوکی ها و تنظیمات محلی ذخیره شده را حذف نمایید.\n5. ارتباط با ما\nچنانچه درباره سیاست کوکی ما یا شیوه استفاده کوکی ها توسط ما پرسش یا نظری دارید، می توانید از طریق این آدرس FRsupport@tcl.com به ما ایمیل بفرستید.\nنسخه: 1.0\n"];
var privacyPolicyTitle = "سیاست حفظ حریم خصوصی - خدمات تلویزیون هوشمند آنلاین";
var privacyPolicyConditions = ["ما در هنگام مدیریت اطلاعات شخصی شما، به حریم خصوصی تان احترام می گذاریم. این سیاست حفظ حریم خصوصی به تشریح مسئول جمع آوری، پردازش و استفاده از اطلاعات شخصی که ما در خصوص استفاده شما از خدمات تلویزیون هوشمندمان (\"\"خدمات\"\") دریافت می کنیم، نوع اطلاعات شخصی که در مورد شما جمع آوری می کنیم، کاری که با آن انجام می دهیم و حقوق شما نسبت به استفاده ما از اطلاعات شخصی شما می پردازد. \n1. کنترل کننده اطلاعات\nجمع آوری، پردازش و استفاده از اطلاعات شخصی جمع آوری شده درباره شما در هنگام استفاده از خدمات ما توسط شرکت Shenzhenhenzhen TCL New Technology Co., Ltd.، به آدرس No. 5, Industrial Avenue (M), Sheko Industrial Zone, Shenzhen City, Guangdong Province, China (\"\"Company\"\")  صورت می گیرد. لطفاً توجه داشته باشید، که ما مسئول کلیه فعالیت های پردازش اطلاعات که در بخش زیر تشریح شده است، نمی باشیم. با این حال، بدین سبب که پردازش اطلاعات با استفاده شما از تلویزیون هوشمند ارتباط دارد، ما در سیاست حفظ حریم خصوصی خود شرحی از فعالیت های مرتبط را گنجانده ایم.\n2. موافقت با پردازش اطلاعات\nبخشی از کار جمع آوری، پردازش و/یا استفاده از اطلاعات شخصی شما منوط به موافقت شما می باشد. \nچنانچه شما با استفاده از اطلاعات شخصی خود در راستای بهبود خدمات موافقت کرده باشید، موافقت شما به شرح زیر می باشد:\n\"\"من با جمع آوری، پردازش و استفاده از زمان روشن شدن دستگاه ، فهرست کانال های تلویزیون دیجیتال، فهرست کانال های مورد علاقه، زمان بازدید و کانال های مشاهده شده توسط من به منظور تجزیه و تحلیل عادت های کاربران، در راستای بهبود خدمات و/یا تجزیه و تحلیل تعداد کاربران آنلاینی که شرکت در روز/ماه/سال دارد و نیز با به اشتراک گذاری این اطلاعات با ایستگاه های تلویزیونی موافق می باشم.\"\"\nاگر شما با استفاده از اطلاعات شخصی تان در خصوص آگهی های تبلیغاتی که با علایق شما متناسب می باشد موافقت کنید، موافقت شما به شرح زیر می باشد:\n\"\"من با جمع آوری، پردازش و استفاده از اطلاعات کشور و نوع کلاینت خود با هدف دریافت آگهی های تبلیغاتی مناسب موافق می باشم.\"\"\nاعلام موافقت توسط شما اختیاری است و اگر موافق نباشید، همچنان می توانید از خدمات ما استفاده کنید. با این حال، ممکن است آگهی های تبلیغاتی و سایر مواردی را که با علایق شما متناسب نباشند مشاهده نمایید. صرفنظر از اعلام موافقت شما، این شرکت حق خود را در جمع آوری، پردازش و/یا استفاده از اطلاعات فوق به اندازه ای که قانون مجاز بداند محفوظ می شمارد.\nشما می توانید موافقت خود را با هر یک از موارد فوق، در هر زمانی در آینده پس بگیرید. شما می توانید نسبت به استفاده از اطلاعات شخصی خود به منظور بازاریابی، تحقیق در بازار یا نظرسنجی و نیز نسبت به متناسب سازی خدمات با نیازهای خود اعتراض کنید. به منظور پس گرفتن موافقت خود و/یا اعلام اعتراض، لطفاً تنظیمات حریم خصوصی تلویزیون هوشمند خود را به طور مناسب تغییر دهید.\n3. اطلاعات شخصی جمع آوری شده\nصرفنظر از موافقت شما، شرکت به جمع آوری، پردازش، ذخیره سازی و استفاده از اطلاعات در دسته های زیر اقدام می کند:\nشناسه دستگاه: تلویزیون هوشمند شما یک عدد ثابت و منحصر به فرد را ذخیره می نماید که به ما اجازه می دهد تا در هنگام استفاده شما از خدمات، تلویزیون هوشمند را شناسایی و تأیید اعتبار نماییم. این شماره شناسه دستگاه نامیده می شود. این شناسه دستگاه در اختیار شریک خدمات رسانی ما قرار می گیرد تا خدماتی را به شما ارائه دهد. ما همچنین این شناسه دستگاه را برای فرایندهای تأیید اعتبار در اختیار شرکای تأمین محتوا قرار می دهیم. شرکای تأمین محتوا از شناسه دستگاه به منظور تأیید اعتبار تلویزیون هوشمند شما جهت دسترسی به خدمات قابل ارائه توسط یک شریک محتوا استفاده می کنند.\nآدرس آی پی و آدرس مک: هنگام دسترسی به اینترنت، یک آدرس آی پی به تلویزیون هوشمند شما اختصاص خواهد یافت. هر بار که تلویزیون هوشمند شما از خدمات ما درخواست اطلاعات یا داده هایی را می کند، این آدرس آی پی به ما منتقل و پردازش می شود. هنگامی که تلویزیون هوشمند شما در محدوده یک روتر قرار داشته باشد (به عنوان مثال در یک شبکه خانگی محلی یا یک شبکه بی‌سیم محلی)، ممکن است ما آدرس آی پی این روتر را دریافت و پردازش کنیم. آدرس مک، یک شماره منحصر به فرد است که به واسط شبکه تلویزیون هوشمند شما اختصاص می یابد. هنگامی که تلویزیون هوشمند از سرویس های ما درخواست اطلاعات یا داده هایی را می کند، آدرس مک توسط ما دریافت و پردازش می شود.\nاطلاعات درخواست خدمات: هنگامی که شما تلویزیون هوشمند خود را به اینترنت وصل و تلویزیون هوشمند را روشن می کنید، دستگاه به طور خودکار به خدماتی وصل می شود که توسط شریک خدمات رسان ما مدیریت می شود. سپس تلویزیون هوشمند شما به عنوان دستگاه مجاز برای دسترسی به خدمات تأیید اعتبار می شود. به منظور تأیید اعتبار، خدمات ما یک یا چند شناسه منحصر بفرد عددی مرتبط با تلویزیون هوشمند شما را ذخیره می نمایند. در هنگام اتصال به خدمات، تلویزیون هوشمند آدرس آی پی را که به آن اختصاص داده شده  و اطلاعات خاص دستگاه را منتقل می نماید (مدل تلویزیون هوشمند، نسخه نرم افزار) تا در مورد احتمال وجود بروزسانی های نرم افزار بررسی صورت پذیرد.\nتنظیمات خدمات: به عنوان بخشی از کارآمدی منظم خدمات ما، شما می توانید به صورت دستی ترتیبی را که برنامه های کاربردی طبق آن نمایش داده می شوند مشخص کنید. شریک خدمات رسان ما تنظیمات و سایر اولویت هایی را که شما می توانید در طول استفاده از خدمات تعیین کنید ذخیره خواهد نمود. این اطلاعات با شناسه دستگاه مرتبط خواهند شد.\nاطلاعات خاص دستگاه: تلویزیون هوشمند اطلاعات متعددی را درباره خود و تنظیماتش ذخیره می نماید. این اطلاعات نوع تلویزیون هوشمند، نسخه سیستم عامل تلویزیون هوشمند، تفکیک پذیری پنلی آن، شناسه پروژه (به عبارتی، اطلاعات مرتبط با فایل های پیکربندی)، نمایندگی کاربر، نام مرورگر، نسخه مرورگر و زبان و کشوری که در تلویزیون هوشمند پیکربندی شده اند را شامل می گردد. این اطلاعات توسط ما استفاده خواهد شد و در اختیار شریک خدمات رسان و شرکای تأمین محتوا قرار خواهد گرفت.\nآگهی تبلیغاتی: خدمات ما برخی آگهی های تبلیغاتی را ارائه می دهد. این آگهی های تبلیغاتی توسط ما یا طرف های دیگری ارائه می شوند که از موجودی تبلیغاتی تعیین شده توسط ما بهره می گیرند. تمامی آگهی های تبلیغاتی توسط یا از طریق سرور تبلیغاتی ما ارائه می گردند که نقش هماهنگ کننده ای را برای ارائه آگهی های تبلیغاتی ایفا می کنند. سرور آگهی های تبلیغاتی ما یا سرور آگهی های تبلیغاتی سایر طرف ها ممکن است یک کوکی را در تلویزیون هوشمند قرار دهند. لطفاً برای دریافت اطلاعات بیشتر در مورد این کوکی ها، به سیاست کوکی ما مراجعه کنید.\nترافیک شریک خدمات رسان و تأمین محتوا هنگامی که شما از خدمات ما استفاده می کنید، تلویزیون هوشمند شما از طریق اینترنت اطلاعاتی را از مرکز خدمات درخواست می کند. به عنوان بخشی از این درخواست ها، آدرس آی پی، زبان و کشوری که در آن تلویزیون هوشمند شما پیکربندی شده است به طوری که در بالا شرح داده شد، به شریک خدمات رسان ما ارسال می شود. شریک خدمات رسان ما اطلاعات مرتبط را بر اساس سیاست حفظ حریم خصوصی خود پردازش می کند.\nاستفاده از صفحه نمایش دوم: اگر شما از برنامه صفحه نمایش دوم ما استفاده می کنید، کنترل هایی که در برنامه فعال می کنید و تنظیمات کشور و زبان، فهرست کانال های تلویزیون دیجیتال، فهرست های کانال های مورد علاقه، فهرست های زمانبندی، شناسه دستگاه، کانال فعلی، نسخه پروتکل و آدرس آی پی تلویزیون هوشمند شما دریافت و در سرورهای ما پردازش خواهند شد. سرورهای ما تلویزیون هوشمند شما را به صورتی که در برنامه صفحه نمایش دوم مشخص کرده اید کنترل خواهند نمود.\nHbbTV (تلویزیون هیبریدی پهن ‌باند) - \"\"دکمه قرمز\"\":  ممکن است ایستگاه های تلویزیونی (\"\"ایستگاه ها\"\") اطلاعات اضافی را با سیگنال تلویزیونی خود ارسال کنند. چنانچه تلویزیون هوشمند دستورالعمل های خاصی را در ارتباط با این اطلاعات اضافی دریافت کند و در صورت اتصال به اینترنت، تلویزیون هوشمند یک تصویر یا صفحه کوچک را از وبسایت ایستگاه دانلود می کند و آن را همراه با اطلاعاتی که از شما می خواهد دکمه «قرمز» روی کنترل تلویزیون را فشار دهید نشان می دهد، تا اگر بخواهید خدمات بیشتری را از ایستگاه مرتبط دریافت نمایید. هر بار که شما آگهی ها را حذف یا رد می کنید این اتفاق رخ می دهد. با دانلود تصویر از وبسایت ایستگاه مورد نظر، تلویزیون هوشمند برخی از اطلاعات شخصی، مانند فهرست کانال های تلویزیون دیجیتال، کانال فعلی، جدول اطلاعات رویدادها، زمان تلویزیون، آدرس آی پی تلویزیون هوشمند شما و کوکی های ذخیره شده در تلویزیون هوشمند را (در صورت وجود) انتقال خواهد داد. این ایستگاه مسئول جمع آوری، پردازش و/یا استفاده از این قبیل اطلاعات است. افزون بر این، اگر شما از طریق دکمه قرمز از خدمات اضافی قابل ارائه توسط یک ایستگاه استفاده کنید، این ایستگاه ممکن است سایر اطلاعات شخصی شما را جمع آوری کند (مانند فیلم هایی درخواستی که تماشا کرده اید، اخباری که می خوانید، و مانند آن).\n4. هدف ما از پردازش و/یا استفاده از اطلاعات شخصی شما\nما اطلاعات جمع آوری شده را با اهداف زیر پردازش می کنیم:\nارائه خدمات: ما از آدرس آی پی و آدرس مک، شناسه دستگاه، نسخه سیستم عامل تلویزیون هوشمند، نوع کلاینت تلویزیون هوشمند شما و تفکیک پذیری پنلی آن، شناسه پروژه (به عبارتی، اطلاعات مرتبط با فایل های پیکربندی)، فهرست کانال های تلویزیون دیجیتال، فهرست کانال های مشاهده شده، منطقه زمانی، تنظیمات کشوری و زبانی به منظور فراهم کردن ایجاد دسترسی برای تلویزیون هوشمند شما به خدمات ما و خدمات قابل ارائه توسط شرکای تأمین محتوایمان بهره می گیریم.  اهداف ما عبارتند از (اما نه محدود به) تأیید اعتبار، ارائه خدمات مبتنی بر مکان به شما (به عنوان مثال پیش بینی های آب و هوایی)؛ مدیریت سوء استفاده ها، مدیریت حوادث امنیتی، پایش دسترسی به خدمات و ارائه خدمات پشتیبان با توجه به اولویت های کاربران.\nتأیید اعتبار ما از شناسه دستگاه و آدرس مک برای فرایندهای تأیید اعتبار بهره می گیریم.\nبروز رسانی نرم افزار: هربار که تلویزیون هوشمند شما روشن می شود، آدرس آی پی، شناسه دستگاه، نسخه نرم افزار، نوع کلاینت تلویزیون هوشمند شما، شناسه پروژه (به عبارتی، فایل های پیکربندی)، شناسه کاربر و  شماره سریال را به ما اعلام می کند تا بروز رسانی های متناسب به شما پیشنهاد و در اختیارتان قرار داده شود.  \nبهبود خدمات: ما از داده های کاربری جمع آوری شده و ناشناس (یعنی داده های مرتبط با تعامل شما با خدمات ما) به منظور بهبود تجربه کاربران خدمات خود استفاده می کنیم.\nارائه آگهی های تبلیغاتی: ما از اطلاعات موجود در کوکی های تبلیغاتی استفاده می کنیم تا به سیستم اجازه بدهیم وارد آگهی های تبلیغاتی ای شود که در تلویزیون هوشمند شما نشان داده شده است، تا مطمئن شویم که شما آگهی های تبلیغاتی مشابه زیادی را دریافت نمی کنید و بتوانیم قرارهای تجاری خود را با شرکای تبلیغاتی خود حل و فصل کنیم. ممکن است آگهی دهندگان خارج از شرکت که آگهی های تبلیغاتی خود را با خدمات ما ارائه می دهند یا وبسایت های شرکای تأمین محتوا، با هماهنگی سرور تبلیغاتی ما نیز از کوکی هایی برای رصد کردن شما در وبسایت های متعدد استفاده کنند و آگهی های تبلیغاتی را ارائه دهند که منافع شخصی آنها را در بر دارد.\nبهینه سازی آگهی های تبلیغاتی: ما از اطلاعات مرتبط با تعداد بازدید و کلیک های صورت گرفته بر روی تبلیغات به منظور بهینه سازی تجربه تبلیغات مصرف کنندگان خدمات خود بهره می گیریم.\nتخفیف: ما شناسه دستگاه شما را در اختیار شرکای تأمین محتوای منتخب خود می گذاریم تا به آنها امکان بدهیم بدانند تا چه اندازه می توانند برای شما دسترسی رایگان به ویدیوهای درخواستی موجود در مجموعه خود را فراهم نمایند.\nاجرای قانون: ممکن است ما مجبور شویم اطلاعاتی را در اختیار مراجع اجرای قانون و یا دادگاه ها قرار دهیم. در چنین شرایطی، ما این کار را صرفاً بر اساس یک ابزار قانونی الزام آور مانند یک مجوز یا حکم قضایی انجام خواهیم داد که ما را به همکاری با مراجع مرتبط ملزم می نماید.\nبهره گیری از خدمات ما با استفاده از نام مستعار امکان پذیر است، مگر آنکه برخی خدمات خاص شما را ملزم به ارائه نام و/یا آدرس ایمیل نمایند.\n5. دسته بندی دریافت کنندگان اطلاعات شما\nاین شرکت اطلاعات شخصی شما را در هنگام استفاده از خدمات ما تنها با این طرف های سوم به اشتراک می گذارد:\nبا طرف های سوم ارائه دهنده خدمات تلویزیون هوشمند، در صورتی که چنین خدماتی را درخواست کرده باشید (برای مثال، اگر شما از برنامه Netflix در تلویزیون هوشمند خود استفاده کنید، ممکن است ما آدرس آی پی، آدرس مک، نسخه نرم افزار و نام مدل تلویزیون شما را با شرکت Netflix به اشتراک بگذاریم).\nبا شرکای تأمین محتوای طرف سوم، چنانچه شما درخواست محتوای خاصی را بدهید که توسط این شرکای تأمین محتوا ارائه گردد (برای مثال، به منظور ارائه خدمات GoLive IP TV به شما، ممکن است ما نوع کلاینت تلویزیون، آدرس آی پی و تنظیمات زبانی تلویزیون شما را در اختیار مرجع قانونی که خدمات GoLive را ارائه می دهد بگذاریم. \nبه میزانی که شما در خصوص به اشتراک گذاری اطلاعات شخصی خاص خود با طرف های سوم بالا موافقت نموده باشید، شرکت این اطلاعات را با این قبیل طرف های سوم به اشتراک خواهد گذاشت.\nبا ارائه دهندگان خدمات برون سپاری به عنوان پردازشگران اطلاعات که شرکت را در ارائه خدمات یاری می دهند.\nشرکت اطلاعات شخصی شما را تنها در صورتی با سایر طرف های سوم به اشتراک می گذارد که بر اساس الزامات قانونی ملزم به انجام این کار باشد (به عنوان مثال، با دادگاه ها یا مراجع تعقیب کیفری)، و نیز در صورتی که شما با به اشتراک گذاری اطلاعات خود موافقت کرده باشید یا به اشتراک گذاری اطلاعات شما به نحوی طبق مقررات قابل اطلاق قانونی باشد.\n6. کشورهایی که اطلاعات شما در آنجا پردازش می شوند\nشرکت و/ یا برخی از گیرندگان اطلاعات شخصی شما که در بالا فهرست شده اند ممکن است در خارج از منطقه اقتصادی اروپا واقع شده باشند (یعنی در کشورهای زیر: جمهوری خلق چین، ایالات متحده آمریکا).  بنابراین، اطلاعات شخصی شما ممکن است در کشورهایی پردازش شود که طبق دستورالعمل 95/46/EC پارلمان اروپا و شورای 24 اکتبر 1995 در خصوص حفاظت از افراد در ارتباط با پردازش اطلاعات شخصی آنها و انتقال آزاد این قبیل اطلاعات، به عنوان ارائه دهنده سطح مناسبی از حفاظت اطلاعات شخصی شما به رسمیت شناخته نشوند.\n7. حقوق شما\nشما می توانید به منظور دریافت اطلاعات در مورد داده های شخصی پردازش شده شما توسط شرکت و/ یا اعمال حقوق قانونی خود در ارتباط با دسترسی، اصلاح، حذف و مسدود کردن اطلاعات شخصی شما؛ و/یا اعتراض به پردازش اطلاعات شخصی شما برای اهداف بازاریابی و/یا تحقیق در بازار یا نظر سنجی، با شرکت تماس بگیرید.\n8. تغییر در سیاست حفظ حریم خصوصی\nما برای بهبود خدمات خود ممکن است نیاز به اصلاحاتی در سیاست حفظ حریم خصوصی خود داشته باشیم - به عنوان مثال، اجرای فناوری ها یا معرفی خدمات نوین. ما حق تغییر یا تکمیل این سیاست حفظ حریم خصوصی را در هر زمانی برای خود محفوظ می شماریم.\n9. اطلاعات تماس\n چنانچه در مورد سیاست حفظ حریم خصوصی ما هر گونه پرسشی دارید، یا مایلید درباره شیوه مدیریت اطلاعات خود توسط ما شکایتی را مطرح کنید، لطفاً با استفاده از یکی از روش های تماس زیر با ما تماس بگیرید:\nپست الکترونیک: FRsupport@tcl.com\nنسخه: 1.0\n"];
var privacyPolicyTerms = [
    "سرویس تلویزیون هوشمند را فعال کنید",
    "من رضایتم را نسبت به جمع آوری، پردازش و استفاده از زمان روشن شدن دستگاه، فهرست کانال های تلویزیون دیجیتال، فهرست کانال های مورد علاقه، زمان بازدید و کانال های مشاهده شده خود به منظور تجزیه و تحلیل عادت های کاربران برای بهبود خدمات و/یا تجزیه و تحلیل تعداد کاربران آنلاین TCL در روز/ماه/ سال و به اشتراک گذاری این اطلاعات با ایستگاه های تلویزیونی اعلام می کنم.",
    "سرویس پیشنهاد را فعال کنید",
    "برنامه دوم صفحه را برای دستگاه های تلفن همراه فعال کنید",
    "به روزرسانی خودکار نرم افزار را فعال کنید",
    "فعال کردن سرویس FreeviewPlay."
];
var privacyPolicyTips = [
    "کلیه خدمات تلویزیون هوشمند غیر فعال خواهد شد.",
    "سرویس HbbTV ارائه شده توسط کانال های تلویزیونی در زمان استفاده از تیونر داخلی غیر فعال خواهد شد.",
    "سرویس توصیه برنامه تلویزیون و محتوا غیر فعال خواهد شد.",
    "برنامه صفحه نمایش دوم غیر فعال خواهد شد.",
    "تلویزیون به طور خودکار به روز رسانی های نرم افزار و قابلیت های جدید را بررسی نخواهد کرد.",
    "محتوای سرویس FreeviewPlay غیرفعال خواهد شد."
];
var privacyPolicyRemind = "لطفا جعبه مربوطه را در تنظیم تنظیم کنید.";
var set = "تنظیم";
var copyShopDemoTips = ["به یو اس بی متصل شده اید، آیا می خواهید ویدیو را روی فلش کپی کنید؟","کپی کردن ویدیو روی فلش","ویدیو با موفقیت کپی شده است!","خطا در کپی کردن ویدیو!"];
var activateTVWords = ["تلویزیون خود را فعال کنید","لطفاً کد تأیید را وارد کنید.","بعد از فعال ساختن تلویزیون خود از سرویس های بیشتری بهره مند می شوید.","برای دریافت کد تأیید باید کد QR را اسکن کنید.","می توانید کد تأیید را به ترتیب زیر نیز دریافت کنید:","به شماره 1800588880 زنگ بزنید، عدد  داده و سپس SN را وارد کنید تا کد تأیید را دریافت نمائید.","مرکز خدمات مشتریان","لطفاً اطلاعات را وارد کرده و سرویس گارانتی خود را دریافت."];
var dataDeletionWords = ["حذف داده های سرویس تلویزیون هوشمند در سرورهای بک اند .","توجه: یک ماه پس از تیک زدن این آیتم، داده های کاربر تلویزیون هوشمند شما حذف خواهند شد. لطفا توجه کنید که حذف این داده ها روی داده های محلی ذخیره شده در تلویزیون شما تأثیری نخواهد داشت.","داده ها دیگر به سرور تلویزیون هوشمند گزارش نمی شوند.","توجه:  پس از تیک زدن این آیتم، داده های مرتبط با استفاد از خدمات تلویزیون هوشمند، دیگر به سرور منتقل نخواهند شد. تلویزیون شما دیگر خدمات توصیه شده را دریافت نخواهد نمود.","برای کسب اطلاعات بیشتر، لطفا به وبسایت www.tcl.eu مراجعه نمایید."];
var miracastWords = ["اتصال بیسیم","همسان نمایی تلفن اندروید در تلویزیون","برای وصل کردن کلیک کنید","این قابلیت فقط در دستگاه های دارای سیستم عامل اندروید موجود است"];
var miracastTips = ["مراحل اتصال","به منوی تنظیمات تلفن همراه بروید","به منوی شیوه های اتصال بیشتر \n / سایر اتصال های بیسیم بروید","انتخاب نمایشگر بیسیم","برای وصل کردن کلیک کنید \n منتظر یافت شدن"];
var eWarrantyCardWords=["E-warranty Card","The date of activation:"];